garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
// Register: I3C1CON0
#define I3C1CON0 I3C1CON0
extern volatile unsigned char           I3C1CON0            __at(0x083);
#ifndef _LIB_BUILD
asm("I3C1CON0 equ 083h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IBIREQ                 :1;
        unsigned HJREQ                  :1;
        unsigned ACKP                   :1;
        unsigned CLRRXB                 :1;
        unsigned CLRTXB                 :1;
        unsigned RST                    :1;
        unsigned BTOEN                  :1;
        unsigned EN                     :1;
    };
} I3C1CON0bits_t;
extern volatile I3C1CON0bits_t I3C1CON0bits __at(0x083);
// bitfield macros
#define _I3C1CON0_IBIREQ_POSN                               0x0
#define _I3C1CON0_IBIREQ_POSITION                           0x0
#define _I3C1CON0_IBIREQ_SIZE                               0x1
#define _I3C1CON0_IBIREQ_LENGTH                             0x1
#define _I3C1CON0_IBIREQ_MASK                               0x1
#define _I3C1CON0_HJREQ_POSN                                0x1
#define _I3C1CON0_HJREQ_POSITION                            0x1
#define _I3C1CON0_HJREQ_SIZE                                0x1
#define _I3C1CON0_HJREQ_LENGTH                              0x1
#define _I3C1CON0_HJREQ_MASK                                0x2
#define _I3C1CON0_ACKP_POSN                                 0x2
#define _I3C1CON0_ACKP_POSITION                             0x2
#define _I3C1CON0_ACKP_SIZE                                 0x1
#define _I3C1CON0_ACKP_LENGTH                               0x1
#define _I3C1CON0_ACKP_MASK                                 0x4
#define _I3C1CON0_CLRRXB_POSN                               0x3
#define _I3C1CON0_CLRRXB_POSITION                           0x3
#define _I3C1CON0_CLRRXB_SIZE                               0x1
#define _I3C1CON0_CLRRXB_LENGTH                             0x1
#define _I3C1CON0_CLRRXB_MASK                               0x8
#define _I3C1CON0_CLRTXB_POSN                               0x4
#define _I3C1CON0_CLRTXB_POSITION                           0x4
#define _I3C1CON0_CLRTXB_SIZE                               0x1
#define _I3C1CON0_CLRTXB_LENGTH                             0x1
#define _I3C1CON0_CLRTXB_MASK                               0x10
#define _I3C1CON0_RST_POSN                                  0x5
#define _I3C1CON0_RST_POSITION                              0x5
#define _I3C1CON0_RST_SIZE                                  0x1
#define _I3C1CON0_RST_LENGTH                                0x1
#define _I3C1CON0_RST_MASK                                  0x20
#define _I3C1CON0_BTOEN_POSN                                0x6
#define _I3C1CON0_BTOEN_POSITION                            0x6
#define _I3C1CON0_BTOEN_SIZE                                0x1
#define _I3C1CON0_BTOEN_LENGTH                              0x1
#define _I3C1CON0_BTOEN_MASK                                0x40
#define _I3C1CON0_EN_POSN                                   0x7
#define _I3C1CON0_EN_POSITION                               0x7
#define _I3C1CON0_EN_SIZE                                   0x1
#define _I3C1CON0_EN_LENGTH                                 0x1
#define _I3C1CON0_EN_MASK                                   0x80

// Register: I3C1CON1
#define I3C1CON1 I3C1CON1
extern volatile unsigned char           I3C1CON1            __at(0x084);
#ifndef _LIB_BUILD
asm("I3C1CON1 equ 084h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACKPOS                 :1;
        unsigned SASDRMD                :1;
        unsigned FHDRE                  :1;
        unsigned BERRDET                :1;
    };
} I3C1CON1bits_t;
extern volatile I3C1CON1bits_t I3C1CON1bits __at(0x084);
// bitfield macros
#define _I3C1CON1_ACKPOS_POSN                               0x0
#define _I3C1CON1_ACKPOS_POSITION                           0x0
#define _I3C1CON1_ACKPOS_SIZE                               0x1
#define _I3C1CON1_ACKPOS_LENGTH                             0x1
#define _I3C1CON1_ACKPOS_MASK                               0x1
#define _I3C1CON1_SASDRMD_POSN                              0x1
#define _I3C1CON1_SASDRMD_POSITION                          0x1
#define _I3C1CON1_SASDRMD_SIZE                              0x1
#define _I3C1CON1_SASDRMD_LENGTH                            0x1
#define _I3C1CON1_SASDRMD_MASK                              0x2
#define _I3C1CON1_FHDRE_POSN                                0x2
#define _I3C1CON1_FHDRE_POSITION                            0x2
#define _I3C1CON1_FHDRE_SIZE                                0x1
#define _I3C1CON1_FHDRE_LENGTH                              0x1
#define _I3C1CON1_FHDRE_MASK                                0x4
#define _I3C1CON1_BERRDET_POSN                              0x3
#define _I3C1CON1_BERRDET_POSITION                          0x3
#define _I3C1CON1_BERRDET_SIZE                              0x1
#define _I3C1CON1_BERRDET_LENGTH                            0x1
#define _I3C1CON1_BERRDET_MASK                              0x8

// Register: I3C1RXB
#define I3C1RXB I3C1RXB
extern volatile unsigned char           I3C1RXB             __at(0x085);
#ifndef _LIB_BUILD
asm("I3C1RXB equ 085h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} I3C1RXBbits_t;
extern volatile I3C1RXBbits_t I3C1RXBbits __at(0x085);
// bitfield macros
#define _I3C1RXB_RXB_POSN                                   0x0
#define _I3C1RXB_RXB_POSITION                               0x0
#define _I3C1RXB_RXB_SIZE                                   0x8
#define _I3C1RXB_RXB_LENGTH                                 0x8
#define _I3C1RXB_RXB_MASK                                   0xFF

// Register: I3C1TXB
#define I3C1TXB I3C1TXB
extern volatile unsigned char           I3C1TXB             __at(0x086);
#ifndef _LIB_BUILD
asm("I3C1TXB equ 086h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} I3C1TXBbits_t;
extern volatile I3C1TXBbits_t I3C1TXBbits __at(0x086);
// bitfield macros
#define _I3C1TXB_TXB_POSN                                   0x0
#define _I3C1TXB_TXB_POSITION                               0x0
#define _I3C1TXB_TXB_SIZE                                   0x8
#define _I3C1TXB_TXB_LENGTH                                 0x8
#define _I3C1TXB_TXB_MASK                                   0xFF

