garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
// Register: I3C1BIDLH
#define I3C1BIDLH I3C1BIDLH
extern volatile unsigned char           I3C1BIDLH           __at(0x093);
#ifndef _LIB_BUILD
asm("I3C1BIDLH equ 093h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIDLH                  :8;
    };
} I3C1BIDLHbits_t;
extern volatile I3C1BIDLHbits_t I3C1BIDLHbits __at(0x093);
// bitfield macros
#define _I3C1BIDLH_BIDLH_POSN                               0x0
#define _I3C1BIDLH_BIDLH_POSITION                           0x0
#define _I3C1BIDLH_BIDLH_SIZE                               0x8
#define _I3C1BIDLH_BIDLH_LENGTH                             0x8
#define _I3C1BIDLH_BIDLH_MASK                               0xFF

// Register: I3C1BAVL
#define I3C1BAVL I3C1BAVL
extern volatile unsigned char           I3C1BAVL            __at(0x094);
#ifndef _LIB_BUILD
asm("I3C1BAVL equ 094h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BAVL                   :8;
    };
} I3C1BAVLbits_t;
extern volatile I3C1BAVLbits_t I3C1BAVLbits __at(0x094);
// bitfield macros
#define _I3C1BAVL_BAVL_POSN                                 0x0
#define _I3C1BAVL_BAVL_POSITION                             0x0
#define _I3C1BAVL_BAVL_SIZE                                 0x8
#define _I3C1BAVL_BAVL_LENGTH                               0x8
#define _I3C1BAVL_BAVL_MASK                                 0xFF

// Register: I3C1BTO
#define I3C1BTO I3C1BTO
extern volatile unsigned short          I3C1BTO             __at(0x095);
#ifndef _LIB_BUILD
asm("I3C1BTO equ 095h");
#endif

// Register: I3C1BTOL
#define I3C1BTOL I3C1BTOL
extern volatile unsigned char           I3C1BTOL            __at(0x095);
#ifndef _LIB_BUILD
asm("I3C1BTOL equ 095h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTOL                   :8;
    };
} I3C1BTOLbits_t;
extern volatile I3C1BTOLbits_t I3C1BTOLbits __at(0x095);
// bitfield macros
#define _I3C1BTOL_BTOL_POSN                                 0x0
#define _I3C1BTOL_BTOL_POSITION                             0x0
#define _I3C1BTOL_BTOL_SIZE                                 0x8
#define _I3C1BTOL_BTOL_LENGTH                               0x8
#define _I3C1BTOL_BTOL_MASK                                 0xFF

// Register: I3C1BTOH
#define I3C1BTOH I3C1BTOH
extern volatile unsigned char           I3C1BTOH            __at(0x096);
#ifndef _LIB_BUILD
asm("I3C1BTOH equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTOH                   :8;
    };
} I3C1BTOHbits_t;
extern volatile I3C1BTOHbits_t I3C1BTOHbits __at(0x096);
// bitfield macros
#define _I3C1BTOH_BTOH_POSN                                 0x0
#define _I3C1BTOH_BTOH_POSITION                             0x0
#define _I3C1BTOH_BTOH_SIZE                                 0x8
#define _I3C1BTOH_BTOH_LENGTH                               0x8
#define _I3C1BTOH_BTOH_MASK                                 0xFF

// Register: I3C1IBIMDB
#define I3C1IBIMDB I3C1IBIMDB
extern volatile unsigned char           I3C1IBIMDB          __at(0x097);
#ifndef _LIB_BUILD
asm("I3C1IBIMDB equ 097h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IBIMDB                 :8;
    };
    struct {
        unsigned IBIMDB_4_0             :5;
        unsigned IBIMDB_7_5             :3;
    };
} I3C1IBIMDBbits_t;
extern volatile I3C1IBIMDBbits_t I3C1IBIMDBbits __at(0x097);
// bitfield macros
#define _I3C1IBIMDB_IBIMDB_POSN                             0x0
#define _I3C1IBIMDB_IBIMDB_POSITION                         0x0
#define _I3C1IBIMDB_IBIMDB_SIZE                             0x8
#define _I3C1IBIMDB_IBIMDB_LENGTH                           0x8
#define _I3C1IBIMDB_IBIMDB_MASK                             0xFF
#define _I3C1IBIMDB_IBIMDB_4_0_POSN                         0x0
#define _I3C1IBIMDB_IBIMDB_4_0_POSITION                     0x0
#define _I3C1IBIMDB_IBIMDB_4_0_SIZE                         0x5
#define _I3C1IBIMDB_IBIMDB_4_0_LENGTH                       0x5
#define _I3C1IBIMDB_IBIMDB_4_0_MASK                         0x1F
#define _I3C1IBIMDB_IBIMDB_7_5_POSN                         0x5
#define _I3C1IBIMDB_IBIMDB_7_5_POSITION                     0x5
#define _I3C1IBIMDB_IBIMDB_7_5_SIZE                         0x3
#define _I3C1IBIMDB_IBIMDB_7_5_LENGTH                       0x3
#define _I3C1IBIMDB_IBIMDB_7_5_MASK                         0xE0

// Register: I3C1RETRY
#define I3C1RETRY I3C1RETRY
extern volatile unsigned char           I3C1RETRY           __at(0x098);
#ifndef _LIB_BUILD
asm("I3C1RETRY equ 098h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RETRY                  :8;
    };
} I3C1RETRYbits_t;
extern volatile I3C1RETRYbits_t I3C1RETRYbits __at(0x098);
// bitfield macros
#define _I3C1RETRY_RETRY_POSN                               0x0
#define _I3C1RETRY_RETRY_POSITION                           0x0
#define _I3C1RETRY_RETRY_SIZE                               0x8
#define _I3C1RETRY_RETRY_LENGTH                             0x8
#define _I3C1RETRY_RETRY_MASK                               0xFF

// Register: I3C1FEAT
#define I3C1FEAT I3C1FEAT
extern volatile unsigned char           I3C1FEAT            __at(0x099);
#ifndef _LIB_BUILD
asm("I3C1FEAT equ 099h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HJCAP                  :1;
        unsigned HDRCAP                 :1;
    };
} I3C1FEATbits_t;
extern volatile I3C1FEATbits_t I3C1FEATbits __at(0x099);
// bitfield macros
#define _I3C1FEAT_HJCAP_POSN                                0x0
#define _I3C1FEAT_HJCAP_POSITION                            0x0
#define _I3C1FEAT_HJCAP_SIZE                                0x1
#define _I3C1FEAT_HJCAP_LENGTH                              0x1
#define _I3C1FEAT_HJCAP_MASK                                0x1
#define _I3C1FEAT_HDRCAP_POSN                               0x1
#define _I3C1FEAT_HDRCAP_POSITION                           0x1
#define _I3C1FEAT_HDRCAP_SIZE                               0x1
#define _I3C1FEAT_HDRCAP_LENGTH                             0x1
#define _I3C1FEAT_HDRCAP_MASK                               0x2

// Register: I3C1SADR
#define I3C1SADR I3C1SADR
extern volatile unsigned char           I3C1SADR            __at(0x09A);
#ifndef _LIB_BUILD
asm("I3C1SADR equ 09Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SADR                   :7;
    };
} I3C1SADRbits_t;
