garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
// Register: I3C1MWS
#define I3C1MWS I3C1MWS
extern volatile unsigned char           I3C1MWS             __at(0x0AC);
#ifndef _LIB_BUILD
asm("I3C1MWS equ 0ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MWS0                   :1;
        unsigned MWS1                   :1;
        unsigned MWS2                   :1;
        unsigned MWS3                   :1;
        unsigned MWS4                   :1;
        unsigned MWS5                   :1;
        unsigned MWS6                   :1;
        unsigned MWS7                   :1;
    };
    struct {
        unsigned MWS_2_0                :3;
        unsigned                        :1;
        unsigned MWS_7_4                :4;
    };
} I3C1MWSbits_t;
extern volatile I3C1MWSbits_t I3C1MWSbits __at(0x0AC);
// bitfield macros
#define _I3C1MWS_MWS0_POSN                                  0x0
#define _I3C1MWS_MWS0_POSITION                              0x0
#define _I3C1MWS_MWS0_SIZE                                  0x1
#define _I3C1MWS_MWS0_LENGTH                                0x1
#define _I3C1MWS_MWS0_MASK                                  0x1
#define _I3C1MWS_MWS1_POSN                                  0x1
#define _I3C1MWS_MWS1_POSITION                              0x1
#define _I3C1MWS_MWS1_SIZE                                  0x1
#define _I3C1MWS_MWS1_LENGTH                                0x1
#define _I3C1MWS_MWS1_MASK                                  0x2
#define _I3C1MWS_MWS2_POSN                                  0x2
#define _I3C1MWS_MWS2_POSITION                              0x2
#define _I3C1MWS_MWS2_SIZE                                  0x1
#define _I3C1MWS_MWS2_LENGTH                                0x1
#define _I3C1MWS_MWS2_MASK                                  0x4
#define _I3C1MWS_MWS3_POSN                                  0x3
#define _I3C1MWS_MWS3_POSITION                              0x3
#define _I3C1MWS_MWS3_SIZE                                  0x1
#define _I3C1MWS_MWS3_LENGTH                                0x1
#define _I3C1MWS_MWS3_MASK                                  0x8
#define _I3C1MWS_MWS4_POSN                                  0x4
#define _I3C1MWS_MWS4_POSITION                              0x4
#define _I3C1MWS_MWS4_SIZE                                  0x1
#define _I3C1MWS_MWS4_LENGTH                                0x1
#define _I3C1MWS_MWS4_MASK                                  0x10
#define _I3C1MWS_MWS5_POSN                                  0x5
#define _I3C1MWS_MWS5_POSITION                              0x5
#define _I3C1MWS_MWS5_SIZE                                  0x1
#define _I3C1MWS_MWS5_LENGTH                                0x1
#define _I3C1MWS_MWS5_MASK                                  0x20
#define _I3C1MWS_MWS6_POSN                                  0x6
#define _I3C1MWS_MWS6_POSITION                              0x6
#define _I3C1MWS_MWS6_SIZE                                  0x1
#define _I3C1MWS_MWS6_LENGTH                                0x1
#define _I3C1MWS_MWS6_MASK                                  0x40
#define _I3C1MWS_MWS7_POSN                                  0x7
#define _I3C1MWS_MWS7_POSITION                              0x7
#define _I3C1MWS_MWS7_SIZE                                  0x1
#define _I3C1MWS_MWS7_LENGTH                                0x1
#define _I3C1MWS_MWS7_MASK                                  0x80
#define _I3C1MWS_MWS_2_0_POSN                               0x0
#define _I3C1MWS_MWS_2_0_POSITION                           0x0
#define _I3C1MWS_MWS_2_0_SIZE                               0x3
#define _I3C1MWS_MWS_2_0_LENGTH                             0x3
#define _I3C1MWS_MWS_2_0_MASK                               0x7
#define _I3C1MWS_MWS_7_4_POSN                               0x4
#define _I3C1MWS_MWS_7_4_POSITION                           0x4
#define _I3C1MWS_MWS_7_4_SIZE                               0x4
#define _I3C1MWS_MWS_7_4_LENGTH                             0x4
#define _I3C1MWS_MWS_7_4_MASK                               0xF0

// Register: I3C1MRS
#define I3C1MRS I3C1MRS
extern volatile unsigned char           I3C1MRS             __at(0x0AD);
#ifndef _LIB_BUILD
asm("I3C1MRS equ 0ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRS0                   :1;
        unsigned MRS1                   :1;
        unsigned MRS2                   :1;
        unsigned MRS3                   :1;
        unsigned MRS4                   :1;
        unsigned MRS5                   :1;
        unsigned MRS6                   :1;
        unsigned MRS7                   :1;
    };
    struct {
        unsigned MRS_2_0                :3;
        unsigned MRS_5_3                :3;
    };
} I3C1MRSbits_t;
extern volatile I3C1MRSbits_t I3C1MRSbits __at(0x0AD);
// bitfield macros
#define _I3C1MRS_MRS0_POSN                                  0x0
#define _I3C1MRS_MRS0_POSITION                              0x0
#define _I3C1MRS_MRS0_SIZE                                  0x1
#define _I3C1MRS_MRS0_LENGTH                                0x1
#define _I3C1MRS_MRS0_MASK                                  0x1
#define _I3C1MRS_MRS1_POSN                                  0x1
#define _I3C1MRS_MRS1_POSITION                              0x1
#define _I3C1MRS_MRS1_SIZE                                  0x1
#define _I3C1MRS_MRS1_LENGTH                                0x1
#define _I3C1MRS_MRS1_MASK                                  0x2
#define _I3C1MRS_MRS2_POSN                                  0x2
#define _I3C1MRS_MRS2_POSITION                              0x2
#define _I3C1MRS_MRS2_SIZE                                  0x1
#define _I3C1MRS_MRS2_LENGTH                                0x1
#define _I3C1MRS_MRS2_MASK                                  0x4
#define _I3C1MRS_MRS3_POSN                                  0x3
#define _I3C1MRS_MRS3_POSITION                              0x3
#define _I3C1MRS_MRS3_SIZE                                  0x1
#define _I3C1MRS_MRS3_LENGTH                                0x1
#define _I3C1MRS_MRS3_MASK                                  0x8
#define _I3C1MRS_MRS4_POSN                                  0x4
#define _I3C1MRS_MRS4_POSITION                              0x4
#define _I3C1MRS_MRS4_SIZE                                  0x1
#define _I3C1MRS_MRS4_LENGTH                                0x1
#define _I3C1MRS_MRS4_MASK                                  0x10
#define _I3C1MRS_MRS5_POSN                                  0x5
#define _I3C1MRS_MRS5_POSITION                              0x5
#define _I3C1MRS_MRS5_SIZE                                  0x1
#define _I3C1MRS_MRS5_LENGTH                                0x1
#define _I3C1MRS_MRS5_MASK                                  0x20
#define _I3C1MRS_MRS6_POSN                                  0x6
#define _I3C1MRS_MRS6_POSITION                              0x6
#define _I3C1MRS_MRS6_SIZE                                  0x1
#define _I3C1MRS_MRS6_LENGTH                                0x1
#define _I3C1MRS_MRS6_MASK                                  0x40
#define _I3C1MRS_MRS7_POSN                                  0x7
#define _I3C1MRS_MRS7_POSITION                              0x7
#define _I3C1MRS_MRS7_SIZE                                  0x1
#define _I3C1MRS_MRS7_LENGTH                                0x1
#define _I3C1MRS_MRS7_MASK                                  0x80
#define _I3C1MRS_MRS_2_0_POSN                               0x0
#define _I3C1MRS_MRS_2_0_POSITION                           0x0
#define _I3C1MRS_MRS_2_0_SIZE                               0x3
#define _I3C1MRS_MRS_2_0_LENGTH                             0x3
#define _I3C1MRS_MRS_2_0_MASK                               0x7
#define _I3C1MRS_MRS_5_3_POSN                               0x3
#define _I3C1MRS_MRS_5_3_POSITION                           0x3
#define _I3C1MRS_MRS_5_3_SIZE                               0x3
#define _I3C1MRS_MRS_5_3_LENGTH                             0x3
#define _I3C1MRS_MRS_5_3_MASK                               0x38

// Register: I3C1MRT
#define I3C1MRT I3C1MRT
#ifndef __CCI__
extern volatile __uint24                I3C1MRT             __at(0x0AE);
#endif
#ifndef _LIB_BUILD
asm("I3C1MRT equ 0AEh");
#endif

