garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
extern volatile CLCnGLS2bits_t CLCnGLS2bits __at(0x1AD);
// bitfield macros
#define _CLCnGLS2_G3D1N_POSN                                0x0
#define _CLCnGLS2_G3D1N_POSITION                            0x0
#define _CLCnGLS2_G3D1N_SIZE                                0x1
#define _CLCnGLS2_G3D1N_LENGTH                              0x1
#define _CLCnGLS2_G3D1N_MASK                                0x1
#define _CLCnGLS2_G3D1T_POSN                                0x1
#define _CLCnGLS2_G3D1T_POSITION                            0x1
#define _CLCnGLS2_G3D1T_SIZE                                0x1
#define _CLCnGLS2_G3D1T_LENGTH                              0x1
#define _CLCnGLS2_G3D1T_MASK                                0x2
#define _CLCnGLS2_G3D2N_POSN                                0x2
#define _CLCnGLS2_G3D2N_POSITION                            0x2
#define _CLCnGLS2_G3D2N_SIZE                                0x1
#define _CLCnGLS2_G3D2N_LENGTH                              0x1
#define _CLCnGLS2_G3D2N_MASK                                0x4
#define _CLCnGLS2_G3D2T_POSN                                0x3
#define _CLCnGLS2_G3D2T_POSITION                            0x3
#define _CLCnGLS2_G3D2T_SIZE                                0x1
#define _CLCnGLS2_G3D2T_LENGTH                              0x1
#define _CLCnGLS2_G3D2T_MASK                                0x8
#define _CLCnGLS2_G3D3N_POSN                                0x4
#define _CLCnGLS2_G3D3N_POSITION                            0x4
#define _CLCnGLS2_G3D3N_SIZE                                0x1
#define _CLCnGLS2_G3D3N_LENGTH                              0x1
#define _CLCnGLS2_G3D3N_MASK                                0x10
#define _CLCnGLS2_G3D3T_POSN                                0x5
#define _CLCnGLS2_G3D3T_POSITION                            0x5
#define _CLCnGLS2_G3D3T_SIZE                                0x1
#define _CLCnGLS2_G3D3T_LENGTH                              0x1
#define _CLCnGLS2_G3D3T_MASK                                0x20
#define _CLCnGLS2_G3D4N_POSN                                0x6
#define _CLCnGLS2_G3D4N_POSITION                            0x6
#define _CLCnGLS2_G3D4N_SIZE                                0x1
#define _CLCnGLS2_G3D4N_LENGTH                              0x1
#define _CLCnGLS2_G3D4N_MASK                                0x40
#define _CLCnGLS2_G3D4T_POSN                                0x7
#define _CLCnGLS2_G3D4T_POSITION                            0x7
#define _CLCnGLS2_G3D4T_SIZE                                0x1
#define _CLCnGLS2_G3D4T_LENGTH                              0x1
#define _CLCnGLS2_G3D4T_MASK                                0x80

// Register: CLCnGLS3
#define CLCnGLS3 CLCnGLS3
extern volatile unsigned char           CLCnGLS3            __at(0x1AE);
#ifndef _LIB_BUILD
asm("CLCnGLS3 equ 01AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G4D1N                  :1;
        unsigned G4D1T                  :1;
        unsigned G4D2N                  :1;
        unsigned G4D2T                  :1;
        unsigned G4D3N                  :1;
        unsigned G4D3T                  :1;
        unsigned G4D4N                  :1;
        unsigned G4D4T                  :1;
    };
} CLCnGLS3bits_t;
extern volatile CLCnGLS3bits_t CLCnGLS3bits __at(0x1AE);
// bitfield macros
#define _CLCnGLS3_G4D1N_POSN                                0x0
#define _CLCnGLS3_G4D1N_POSITION                            0x0
#define _CLCnGLS3_G4D1N_SIZE                                0x1
#define _CLCnGLS3_G4D1N_LENGTH                              0x1
#define _CLCnGLS3_G4D1N_MASK                                0x1
#define _CLCnGLS3_G4D1T_POSN                                0x1
#define _CLCnGLS3_G4D1T_POSITION                            0x1
#define _CLCnGLS3_G4D1T_SIZE                                0x1
#define _CLCnGLS3_G4D1T_LENGTH                              0x1
#define _CLCnGLS3_G4D1T_MASK                                0x2
#define _CLCnGLS3_G4D2N_POSN                                0x2
#define _CLCnGLS3_G4D2N_POSITION                            0x2
#define _CLCnGLS3_G4D2N_SIZE                                0x1
#define _CLCnGLS3_G4D2N_LENGTH                              0x1
#define _CLCnGLS3_G4D2N_MASK                                0x4
#define _CLCnGLS3_G4D2T_POSN                                0x3
#define _CLCnGLS3_G4D2T_POSITION                            0x3
#define _CLCnGLS3_G4D2T_SIZE                                0x1
#define _CLCnGLS3_G4D2T_LENGTH                              0x1
#define _CLCnGLS3_G4D2T_MASK                                0x8
#define _CLCnGLS3_G4D3N_POSN                                0x4
#define _CLCnGLS3_G4D3N_POSITION                            0x4
#define _CLCnGLS3_G4D3N_SIZE                                0x1
#define _CLCnGLS3_G4D3N_LENGTH                              0x1
#define _CLCnGLS3_G4D3N_MASK                                0x10
#define _CLCnGLS3_G4D3T_POSN                                0x5
#define _CLCnGLS3_G4D3T_POSITION                            0x5
#define _CLCnGLS3_G4D3T_SIZE                                0x1
#define _CLCnGLS3_G4D3T_LENGTH                              0x1
#define _CLCnGLS3_G4D3T_MASK                                0x20
#define _CLCnGLS3_G4D4N_POSN                                0x6
#define _CLCnGLS3_G4D4N_POSITION                            0x6
#define _CLCnGLS3_G4D4N_SIZE                                0x1
#define _CLCnGLS3_G4D4N_LENGTH                              0x1
#define _CLCnGLS3_G4D4N_MASK                                0x40
#define _CLCnGLS3_G4D4T_POSN                                0x7
#define _CLCnGLS3_G4D4T_POSITION                            0x7
#define _CLCnGLS3_G4D4T_SIZE                                0x1
#define _CLCnGLS3_G4D4T_LENGTH                              0x1
#define _CLCnGLS3_G4D4T_MASK                                0x80

// Register: U1RXB
#define U1RXB U1RXB
extern volatile unsigned char           U1RXB               __at(0x1AF);
#ifndef _LIB_BUILD
asm("U1RXB equ 01AFh");
#endif
// aliases
extern volatile unsigned char           U1RXBL              __at(0x1AF);
#ifndef _LIB_BUILD
asm("U1RXBL equ 01AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBbits_t;
extern volatile U1RXBbits_t U1RXBbits __at(0x1AF);
// bitfield macros
#define _U1RXB_RXB_POSN                                     0x0
#define _U1RXB_RXB_POSITION                                 0x0
#define _U1RXB_RXB_SIZE                                     0x8
#define _U1RXB_RXB_LENGTH                                   0x8
#define _U1RXB_RXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBLbits_t;
extern volatile U1RXBLbits_t U1RXBLbits __at(0x1AF);
// bitfield macros
#define _U1RXBL_RXB_POSN                                    0x0
#define _U1RXBL_RXB_POSITION                                0x0
#define _U1RXBL_RXB_SIZE                                    0x8
#define _U1RXBL_RXB_LENGTH                                  0x8
#define _U1RXBL_RXB_MASK                                    0xFF

