garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
extern volatile T4INPPSbits_t T4INPPSbits __at(0x361);
// bitfield macros
#define _T4INPPS_T4INPPS_POSN                               0x0
#define _T4INPPS_T4INPPS_POSITION                           0x0
#define _T4INPPS_T4INPPS_SIZE                               0x5
#define _T4INPPS_T4INPPS_LENGTH                             0x5
#define _T4INPPS_T4INPPS_MASK                               0x1F
#define _T4INPPS_T4INPPS0_POSN                              0x0
#define _T4INPPS_T4INPPS0_POSITION                          0x0
#define _T4INPPS_T4INPPS0_SIZE                              0x1
#define _T4INPPS_T4INPPS0_LENGTH                            0x1
#define _T4INPPS_T4INPPS0_MASK                              0x1
#define _T4INPPS_T4INPPS1_POSN                              0x1
#define _T4INPPS_T4INPPS1_POSITION                          0x1
#define _T4INPPS_T4INPPS1_SIZE                              0x1
#define _T4INPPS_T4INPPS1_LENGTH                            0x1
#define _T4INPPS_T4INPPS1_MASK                              0x2
#define _T4INPPS_T4INPPS2_POSN                              0x2
#define _T4INPPS_T4INPPS2_POSITION                          0x2
#define _T4INPPS_T4INPPS2_SIZE                              0x1
#define _T4INPPS_T4INPPS2_LENGTH                            0x1
#define _T4INPPS_T4INPPS2_MASK                              0x4
#define _T4INPPS_T4INPPS3_POSN                              0x3
#define _T4INPPS_T4INPPS3_POSITION                          0x3
#define _T4INPPS_T4INPPS3_SIZE                              0x1
#define _T4INPPS_T4INPPS3_LENGTH                            0x1
#define _T4INPPS_T4INPPS3_MASK                              0x8
#define _T4INPPS_T4INPPS4_POSN                              0x4
#define _T4INPPS_T4INPPS4_POSITION                          0x4
#define _T4INPPS_T4INPPS4_SIZE                              0x1
#define _T4INPPS_T4INPPS4_LENGTH                            0x1
#define _T4INPPS_T4INPPS4_MASK                              0x10

// Register: TUIN0PPS
#define TUIN0PPS TUIN0PPS
extern volatile unsigned char           TUIN0PPS            __at(0x365);
#ifndef _LIB_BUILD
asm("TUIN0PPS equ 0365h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TUIN0PPS               :5;
    };
    struct {
        unsigned TUIN0PPS0              :1;
        unsigned TUIN0PPS1              :1;
        unsigned TUIN0PPS2              :1;
        unsigned TUIN0PPS3              :1;
        unsigned TUIN0PPS4              :1;
    };
} TUIN0PPSbits_t;
extern volatile TUIN0PPSbits_t TUIN0PPSbits __at(0x365);
// bitfield macros
#define _TUIN0PPS_TUIN0PPS_POSN                             0x0
#define _TUIN0PPS_TUIN0PPS_POSITION                         0x0
#define _TUIN0PPS_TUIN0PPS_SIZE                             0x5
#define _TUIN0PPS_TUIN0PPS_LENGTH                           0x5
#define _TUIN0PPS_TUIN0PPS_MASK                             0x1F
#define _TUIN0PPS_TUIN0PPS0_POSN                            0x0
#define _TUIN0PPS_TUIN0PPS0_POSITION                        0x0
#define _TUIN0PPS_TUIN0PPS0_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS0_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS0_MASK                            0x1
#define _TUIN0PPS_TUIN0PPS1_POSN                            0x1
#define _TUIN0PPS_TUIN0PPS1_POSITION                        0x1
#define _TUIN0PPS_TUIN0PPS1_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS1_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS1_MASK                            0x2
#define _TUIN0PPS_TUIN0PPS2_POSN                            0x2
#define _TUIN0PPS_TUIN0PPS2_POSITION                        0x2
#define _TUIN0PPS_TUIN0PPS2_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS2_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS2_MASK                            0x4
#define _TUIN0PPS_TUIN0PPS3_POSN                            0x3
#define _TUIN0PPS_TUIN0PPS3_POSITION                        0x3
#define _TUIN0PPS_TUIN0PPS3_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS3_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS3_MASK                            0x8
#define _TUIN0PPS_TUIN0PPS4_POSN                            0x4
#define _TUIN0PPS_TUIN0PPS4_POSITION                        0x4
#define _TUIN0PPS_TUIN0PPS4_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS4_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS4_MASK                            0x10

// Register: TUIN1PPS
#define TUIN1PPS TUIN1PPS
extern volatile unsigned char           TUIN1PPS            __at(0x366);
#ifndef _LIB_BUILD
asm("TUIN1PPS equ 0366h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TUIN1PPS               :5;
    };
    struct {
        unsigned TUIN1PPS0              :1;
        unsigned TUIN1PPS1              :1;
        unsigned TUIN1PPS2              :1;
        unsigned TUIN1PPS3              :1;
        unsigned TUIN1PPS4              :1;
    };
} TUIN1PPSbits_t;
extern volatile TUIN1PPSbits_t TUIN1PPSbits __at(0x366);
// bitfield macros
#define _TUIN1PPS_TUIN1PPS_POSN                             0x0
#define _TUIN1PPS_TUIN1PPS_POSITION                         0x0
#define _TUIN1PPS_TUIN1PPS_SIZE                             0x5
#define _TUIN1PPS_TUIN1PPS_LENGTH                           0x5
#define _TUIN1PPS_TUIN1PPS_MASK                             0x1F
#define _TUIN1PPS_TUIN1PPS0_POSN                            0x0
#define _TUIN1PPS_TUIN1PPS0_POSITION                        0x0
#define _TUIN1PPS_TUIN1PPS0_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS0_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS0_MASK                            0x1
#define _TUIN1PPS_TUIN1PPS1_POSN                            0x1
#define _TUIN1PPS_TUIN1PPS1_POSITION                        0x1
#define _TUIN1PPS_TUIN1PPS1_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS1_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS1_MASK                            0x2
#define _TUIN1PPS_TUIN1PPS2_POSN                            0x2
#define _TUIN1PPS_TUIN1PPS2_POSITION                        0x2
#define _TUIN1PPS_TUIN1PPS2_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS2_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS2_MASK                            0x4
#define _TUIN1PPS_TUIN1PPS3_POSN                            0x3
#define _TUIN1PPS_TUIN1PPS3_POSITION                        0x3
#define _TUIN1PPS_TUIN1PPS3_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS3_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS3_MASK                            0x8
#define _TUIN1PPS_TUIN1PPS4_POSN                            0x4
#define _TUIN1PPS_TUIN1PPS4_POSITION                        0x4
#define _TUIN1PPS_TUIN1PPS4_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS4_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS4_MASK                            0x10

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
extern volatile unsigned char           CCP1PPS             __at(0x369);
#ifndef _LIB_BUILD
asm("CCP1PPS equ 0369h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1PPS                :5;
    };
    struct {
        unsigned CCP1PPS0               :1;
        unsigned CCP1PPS1               :1;
        unsigned CCP1PPS2               :1;
        unsigned CCP1PPS3               :1;
        unsigned CCP1PPS4               :1;
    };
} CCP1PPSbits_t;
extern volatile CCP1PPSbits_t CCP1PPSbits __at(0x369);
// bitfield macros
#define _CCP1PPS_CCP1PPS_POSN                               0x0
#define _CCP1PPS_CCP1PPS_POSITION                           0x0
#define _CCP1PPS_CCP1PPS_SIZE                               0x5
#define _CCP1PPS_CCP1PPS_LENGTH                             0x5
#define _CCP1PPS_CCP1PPS_MASK                               0x1F
#define _CCP1PPS_CCP1PPS0_POSN                              0x0
#define _CCP1PPS_CCP1PPS0_POSITION                          0x0
#define _CCP1PPS_CCP1PPS0_SIZE                              0x1
#define _CCP1PPS_CCP1PPS0_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS0_MASK                              0x1
#define _CCP1PPS_CCP1PPS1_POSN                              0x1
#define _CCP1PPS_CCP1PPS1_POSITION                          0x1
#define _CCP1PPS_CCP1PPS1_SIZE                              0x1
#define _CCP1PPS_CCP1PPS1_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS1_MASK                              0x2
#define _CCP1PPS_CCP1PPS2_POSN                              0x2
#define _CCP1PPS_CCP1PPS2_POSITION                          0x2
#define _CCP1PPS_CCP1PPS2_SIZE                              0x1
#define _CCP1PPS_CCP1PPS2_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS2_MASK                              0x4
#define _CCP1PPS_CCP1PPS3_POSN                              0x3
#define _CCP1PPS_CCP1PPS3_POSITION                          0x3
#define _CCP1PPS_CCP1PPS3_SIZE                              0x1
#define _CCP1PPS_CCP1PPS3_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS3_MASK                              0x8
#define _CCP1PPS_CCP1PPS4_POSN                              0x4
#define _CCP1PPS_CCP1PPS4_POSITION                          0x4
#define _CCP1PPS_CCP1PPS4_SIZE                              0x1
#define _CCP1PPS_CCP1PPS4_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS4_MASK                              0x10

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
extern volatile unsigned char           CCP2PPS             __at(0x36A);
#ifndef _LIB_BUILD
asm("CCP2PPS equ 036Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2PPS                :5;
    };
    struct {
        unsigned CCP2PPS0               :1;
        unsigned CCP2PPS1               :1;
        unsigned CCP2PPS2               :1;
        unsigned CCP2PPS3               :1;
        unsigned CCP2PPS4               :1;
    };
} CCP2PPSbits_t;
extern volatile CCP2PPSbits_t CCP2PPSbits __at(0x36A);
// bitfield macros
#define _CCP2PPS_CCP2PPS_POSN                               0x0
#define _CCP2PPS_CCP2PPS_POSITION                           0x0
#define _CCP2PPS_CCP2PPS_SIZE                               0x5
#define _CCP2PPS_CCP2PPS_LENGTH                             0x5
#define _CCP2PPS_CCP2PPS_MASK                               0x1F
#define _CCP2PPS_CCP2PPS0_POSN                              0x0
#define _CCP2PPS_CCP2PPS0_POSITION                          0x0
#define _CCP2PPS_CCP2PPS0_SIZE                              0x1
#define _CCP2PPS_CCP2PPS0_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS0_MASK                              0x1
#define _CCP2PPS_CCP2PPS1_POSN                              0x1
#define _CCP2PPS_CCP2PPS1_POSITION                          0x1
#define _CCP2PPS_CCP2PPS1_SIZE                              0x1
#define _CCP2PPS_CCP2PPS1_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS1_MASK                              0x2
#define _CCP2PPS_CCP2PPS2_POSN                              0x2
#define _CCP2PPS_CCP2PPS2_POSITION                          0x2
#define _CCP2PPS_CCP2PPS2_SIZE                              0x1
#define _CCP2PPS_CCP2PPS2_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS2_MASK                              0x4
#define _CCP2PPS_CCP2PPS3_POSN                              0x3
#define _CCP2PPS_CCP2PPS3_POSITION                          0x3
#define _CCP2PPS_CCP2PPS3_SIZE                              0x1
#define _CCP2PPS_CCP2PPS3_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS3_MASK                              0x8
#define _CCP2PPS_CCP2PPS4_POSN                              0x4
#define _CCP2PPS_CCP2PPS4_POSITION                          0x4
#define _CCP2PPS_CCP2PPS4_SIZE                              0x1
#define _CCP2PPS_CCP2PPS4_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS4_MASK                              0x10

// Register: STATUS_CSHAD
#define STATUS_CSHAD STATUS_CSHAD
extern volatile unsigned char           STATUS_CSHAD        __at(0x373);
#ifndef _LIB_BUILD
asm("STATUS_CSHAD equ 0373h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned NOT_PD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_TO                 :1;
    };
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
} STATUS_CSHADbits_t;
extern volatile STATUS_CSHADbits_t STATUS_CSHADbits __at(0x373);
// bitfield macros
#define _STATUS_CSHAD_NOT_PD_POSN                           0x5
#define _STATUS_CSHAD_NOT_PD_POSITION                       0x5
#define _STATUS_CSHAD_NOT_PD_SIZE                           0x1
#define _STATUS_CSHAD_NOT_PD_LENGTH                         0x1
#define _STATUS_CSHAD_NOT_PD_MASK                           0x20
#define _STATUS_CSHAD_NOT_TO_POSN                           0x6
#define _STATUS_CSHAD_NOT_TO_POSITION                       0x6
#define _STATUS_CSHAD_NOT_TO_SIZE                           0x1
#define _STATUS_CSHAD_NOT_TO_LENGTH                         0x1
#define _STATUS_CSHAD_NOT_TO_MASK                           0x40
#define _STATUS_CSHAD_C_POSN                                0x0
#define _STATUS_CSHAD_C_POSITION                            0x0
#define _STATUS_CSHAD_C_SIZE                                0x1
#define _STATUS_CSHAD_C_LENGTH                              0x1
#define _STATUS_CSHAD_C_MASK                                0x1
#define _STATUS_CSHAD_DC_POSN                               0x1
#define _STATUS_CSHAD_DC_POSITION                           0x1
#define _STATUS_CSHAD_DC_SIZE                               0x1
#define _STATUS_CSHAD_DC_LENGTH                             0x1
#define _STATUS_CSHAD_DC_MASK                               0x2
#define _STATUS_CSHAD_Z_POSN                                0x2
#define _STATUS_CSHAD_Z_POSITION                            0x2
#define _STATUS_CSHAD_Z_SIZE                                0x1
#define _STATUS_CSHAD_Z_LENGTH                              0x1
#define _STATUS_CSHAD_Z_MASK                                0x4
#define _STATUS_CSHAD_OV_POSN                               0x3
#define _STATUS_CSHAD_OV_POSITION                           0x3
#define _STATUS_CSHAD_OV_SIZE                               0x1
#define _STATUS_CSHAD_OV_LENGTH                             0x1
#define _STATUS_CSHAD_OV_MASK                               0x8
#define _STATUS_CSHAD_N_POSN                                0x4
#define _STATUS_CSHAD_N_POSITION                            0x4
#define _STATUS_CSHAD_N_SIZE                                0x1
#define _STATUS_CSHAD_N_LENGTH                              0x1
#define _STATUS_CSHAD_N_MASK                                0x10
#define _STATUS_CSHAD_nPD_POSN                              0x5
#define _STATUS_CSHAD_nPD_POSITION                          0x5
#define _STATUS_CSHAD_nPD_SIZE                              0x1
#define _STATUS_CSHAD_nPD_LENGTH                            0x1
#define _STATUS_CSHAD_nPD_MASK                              0x20
#define _STATUS_CSHAD_nTO_POSN                              0x6
#define _STATUS_CSHAD_nTO_POSITION                          0x6
#define _STATUS_CSHAD_nTO_SIZE                              0x1
#define _STATUS_CSHAD_nTO_LENGTH                            0x1
#define _STATUS_CSHAD_nTO_MASK                              0x40
#define _STATUS_CSHAD_PD_POSN                               0x5
#define _STATUS_CSHAD_PD_POSITION                           0x5
#define _STATUS_CSHAD_PD_SIZE                               0x1
#define _STATUS_CSHAD_PD_LENGTH                             0x1
#define _STATUS_CSHAD_PD_MASK                               0x20
#define _STATUS_CSHAD_TO_POSN                               0x6
#define _STATUS_CSHAD_TO_POSITION                           0x6
#define _STATUS_CSHAD_TO_SIZE                               0x1
#define _STATUS_CSHAD_TO_LENGTH                             0x1
#define _STATUS_CSHAD_TO_MASK                               0x40

// Register: WREG_CSHAD
#define WREG_CSHAD WREG_CSHAD
extern volatile unsigned char           WREG_CSHAD          __at(0x374);
#ifndef _LIB_BUILD
asm("WREG_CSHAD equ 0374h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} WREG_CSHADbits_t;
