garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x479);
#ifndef _LIB_BUILD
asm("PIE6 equ 0479h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIE                 :1;
        unsigned U1TXIE                 :1;
        unsigned U1IE                   :1;
        unsigned U1EIE                  :1;
        unsigned U2RXIE                 :1;
        unsigned U2TXIE                 :1;
        unsigned U2IE                   :1;
        unsigned U2EIE                  :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x479);
// bitfield macros
#define _PIE6_U1RXIE_POSN                                   0x0
#define _PIE6_U1RXIE_POSITION                               0x0
#define _PIE6_U1RXIE_SIZE                                   0x1
#define _PIE6_U1RXIE_LENGTH                                 0x1
#define _PIE6_U1RXIE_MASK                                   0x1
#define _PIE6_U1TXIE_POSN                                   0x1
#define _PIE6_U1TXIE_POSITION                               0x1
#define _PIE6_U1TXIE_SIZE                                   0x1
#define _PIE6_U1TXIE_LENGTH                                 0x1
#define _PIE6_U1TXIE_MASK                                   0x2
#define _PIE6_U1IE_POSN                                     0x2
#define _PIE6_U1IE_POSITION                                 0x2
#define _PIE6_U1IE_SIZE                                     0x1
#define _PIE6_U1IE_LENGTH                                   0x1
#define _PIE6_U1IE_MASK                                     0x4
#define _PIE6_U1EIE_POSN                                    0x3
#define _PIE6_U1EIE_POSITION                                0x3
#define _PIE6_U1EIE_SIZE                                    0x1
#define _PIE6_U1EIE_LENGTH                                  0x1
#define _PIE6_U1EIE_MASK                                    0x8
#define _PIE6_U2RXIE_POSN                                   0x4
#define _PIE6_U2RXIE_POSITION                               0x4
#define _PIE6_U2RXIE_SIZE                                   0x1
#define _PIE6_U2RXIE_LENGTH                                 0x1
#define _PIE6_U2RXIE_MASK                                   0x10
#define _PIE6_U2TXIE_POSN                                   0x5
#define _PIE6_U2TXIE_POSITION                               0x5
#define _PIE6_U2TXIE_SIZE                                   0x1
#define _PIE6_U2TXIE_LENGTH                                 0x1
#define _PIE6_U2TXIE_MASK                                   0x20
#define _PIE6_U2IE_POSN                                     0x6
#define _PIE6_U2IE_POSITION                                 0x6
#define _PIE6_U2IE_SIZE                                     0x1
#define _PIE6_U2IE_LENGTH                                   0x1
#define _PIE6_U2IE_MASK                                     0x40
#define _PIE6_U2EIE_POSN                                    0x7
#define _PIE6_U2EIE_POSITION                                0x7
#define _PIE6_U2EIE_SIZE                                    0x1
#define _PIE6_U2EIE_LENGTH                                  0x1
#define _PIE6_U2EIE_MASK                                    0x80

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0x47A);
#ifndef _LIB_BUILD
asm("PIE7 equ 047Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIE               :1;
        unsigned SPI1TXIE               :1;
        unsigned SPI1IE                 :1;
        unsigned I2C1RXIE               :1;
        unsigned I2C1TXIE               :1;
        unsigned I2C1IE                 :1;
        unsigned I2C1EIE                :1;
    };
} PIE7bits_t;
extern volatile PIE7bits_t PIE7bits __at(0x47A);
// bitfield macros
#define _PIE7_SPI1RXIE_POSN                                 0x0
#define _PIE7_SPI1RXIE_POSITION                             0x0
#define _PIE7_SPI1RXIE_SIZE                                 0x1
#define _PIE7_SPI1RXIE_LENGTH                               0x1
#define _PIE7_SPI1RXIE_MASK                                 0x1
#define _PIE7_SPI1TXIE_POSN                                 0x1
#define _PIE7_SPI1TXIE_POSITION                             0x1
#define _PIE7_SPI1TXIE_SIZE                                 0x1
#define _PIE7_SPI1TXIE_LENGTH                               0x1
#define _PIE7_SPI1TXIE_MASK                                 0x2
#define _PIE7_SPI1IE_POSN                                   0x2
#define _PIE7_SPI1IE_POSITION                               0x2
#define _PIE7_SPI1IE_SIZE                                   0x1
#define _PIE7_SPI1IE_LENGTH                                 0x1
#define _PIE7_SPI1IE_MASK                                   0x4
#define _PIE7_I2C1RXIE_POSN                                 0x3
#define _PIE7_I2C1RXIE_POSITION                             0x3
#define _PIE7_I2C1RXIE_SIZE                                 0x1
#define _PIE7_I2C1RXIE_LENGTH                               0x1
#define _PIE7_I2C1RXIE_MASK                                 0x8
#define _PIE7_I2C1TXIE_POSN                                 0x4
#define _PIE7_I2C1TXIE_POSITION                             0x4
#define _PIE7_I2C1TXIE_SIZE                                 0x1
#define _PIE7_I2C1TXIE_LENGTH                               0x1
#define _PIE7_I2C1TXIE_MASK                                 0x10
#define _PIE7_I2C1IE_POSN                                   0x5
#define _PIE7_I2C1IE_POSITION                               0x5
#define _PIE7_I2C1IE_SIZE                                   0x1
#define _PIE7_I2C1IE_LENGTH                                 0x1
#define _PIE7_I2C1IE_MASK                                   0x20
#define _PIE7_I2C1EIE_POSN                                  0x6
#define _PIE7_I2C1EIE_POSITION                              0x6
#define _PIE7_I2C1EIE_SIZE                                  0x1
#define _PIE7_I2C1EIE_LENGTH                                0x1
#define _PIE7_I2C1EIE_MASK                                  0x40

// Register: PIE8
#define PIE8 PIE8
extern volatile unsigned char           PIE8                __at(0x47B);
#ifndef _LIB_BUILD
asm("PIE8 equ 047Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I3C1RXIE               :1;
        unsigned I3C1TXIE               :1;
        unsigned I3C1IE                 :1;
        unsigned I3C1EIE                :1;
        unsigned I3C1RIE                :1;
    };
} PIE8bits_t;
extern volatile PIE8bits_t PIE8bits __at(0x47B);
// bitfield macros
#define _PIE8_I3C1RXIE_POSN                                 0x0
#define _PIE8_I3C1RXIE_POSITION                             0x0
#define _PIE8_I3C1RXIE_SIZE                                 0x1
#define _PIE8_I3C1RXIE_LENGTH                               0x1
#define _PIE8_I3C1RXIE_MASK                                 0x1
#define _PIE8_I3C1TXIE_POSN                                 0x1
#define _PIE8_I3C1TXIE_POSITION                             0x1
#define _PIE8_I3C1TXIE_SIZE                                 0x1
#define _PIE8_I3C1TXIE_LENGTH                               0x1
#define _PIE8_I3C1TXIE_MASK                                 0x2
#define _PIE8_I3C1IE_POSN                                   0x2
#define _PIE8_I3C1IE_POSITION                               0x2
#define _PIE8_I3C1IE_SIZE                                   0x1
#define _PIE8_I3C1IE_LENGTH                                 0x1
#define _PIE8_I3C1IE_MASK                                   0x4
#define _PIE8_I3C1EIE_POSN                                  0x3
#define _PIE8_I3C1EIE_POSITION                              0x3
#define _PIE8_I3C1EIE_SIZE                                  0x1
#define _PIE8_I3C1EIE_LENGTH                                0x1
#define _PIE8_I3C1EIE_MASK                                  0x8
#define _PIE8_I3C1RIE_POSN                                  0x4
#define _PIE8_I3C1RIE_POSITION                              0x4
#define _PIE8_I3C1RIE_SIZE                                  0x1
#define _PIE8_I3C1RIE_LENGTH                                0x1
#define _PIE8_I3C1RIE_MASK                                  0x10

// Register: PIE9
#define PIE9 PIE9
extern volatile unsigned char           PIE9                __at(0x47C);
#ifndef _LIB_BUILD
asm("PIE9 equ 047Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned HLVDIE                 :1;
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
    };
} PIE9bits_t;
extern volatile PIE9bits_t PIE9bits __at(0x47C);
// bitfield macros
#define _PIE9_HLVDIE_POSN                                   0x5
#define _PIE9_HLVDIE_POSITION                               0x5
#define _PIE9_HLVDIE_SIZE                                   0x1
#define _PIE9_HLVDIE_LENGTH                                 0x1
#define _PIE9_HLVDIE_MASK                                   0x20
#define _PIE9_ADIE_POSN                                     0x6
#define _PIE9_ADIE_POSITION                                 0x6
#define _PIE9_ADIE_SIZE                                     0x1
#define _PIE9_ADIE_LENGTH                                   0x1
#define _PIE9_ADIE_MASK                                     0x40
#define _PIE9_ADTIE_POSN                                    0x7
#define _PIE9_ADTIE_POSITION                                0x7
#define _PIE9_ADTIE_SIZE                                    0x1
#define _PIE9_ADTIE_LENGTH                                  0x1
#define _PIE9_ADTIE_MASK                                    0x80

// Register: IPR0
#define IPR0 IPR0
extern volatile unsigned char           IPR0                __at(0x47D);
#ifndef _LIB_BUILD
asm("IPR0 equ 047Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIP                   :1;
        unsigned INT0IP                 :1;
        unsigned INT1IP                 :1;
        unsigned INT2IP                 :1;
        unsigned DMA1SCNTIP             :1;
        unsigned DMA1DCNTIP             :1;
        unsigned DMA1ORIP               :1;
        unsigned DMA1AIP                :1;
    };
} IPR0bits_t;
extern volatile IPR0bits_t IPR0bits __at(0x47D);
// bitfield macros
#define _IPR0_SWIP_POSN                                     0x0
#define _IPR0_SWIP_POSITION                                 0x0
#define _IPR0_SWIP_SIZE                                     0x1
#define _IPR0_SWIP_LENGTH                                   0x1
#define _IPR0_SWIP_MASK                                     0x1
#define _IPR0_INT0IP_POSN                                   0x1
#define _IPR0_INT0IP_POSITION                               0x1
#define _IPR0_INT0IP_SIZE                                   0x1
#define _IPR0_INT0IP_LENGTH                                 0x1
#define _IPR0_INT0IP_MASK                                   0x2
#define _IPR0_INT1IP_POSN                                   0x2
#define _IPR0_INT1IP_POSITION                               0x2
#define _IPR0_INT1IP_SIZE                                   0x1
#define _IPR0_INT1IP_LENGTH                                 0x1
#define _IPR0_INT1IP_MASK                                   0x4
#define _IPR0_INT2IP_POSN                                   0x3
#define _IPR0_INT2IP_POSITION                               0x3
#define _IPR0_INT2IP_SIZE                                   0x1
#define _IPR0_INT2IP_LENGTH                                 0x1
#define _IPR0_INT2IP_MASK                                   0x8
#define _IPR0_DMA1SCNTIP_POSN                               0x4
#define _IPR0_DMA1SCNTIP_POSITION                           0x4
#define _IPR0_DMA1SCNTIP_SIZE                               0x1
#define _IPR0_DMA1SCNTIP_LENGTH                             0x1
#define _IPR0_DMA1SCNTIP_MASK                               0x10
#define _IPR0_DMA1DCNTIP_POSN                               0x5
#define _IPR0_DMA1DCNTIP_POSITION                           0x5
#define _IPR0_DMA1DCNTIP_SIZE                               0x1
#define _IPR0_DMA1DCNTIP_LENGTH                             0x1
#define _IPR0_DMA1DCNTIP_MASK                               0x20
#define _IPR0_DMA1ORIP_POSN                                 0x6
#define _IPR0_DMA1ORIP_POSITION                             0x6
#define _IPR0_DMA1ORIP_SIZE                                 0x1
#define _IPR0_DMA1ORIP_LENGTH                               0x1
#define _IPR0_DMA1ORIP_MASK                                 0x40
#define _IPR0_DMA1AIP_POSN                                  0x7
#define _IPR0_DMA1AIP_POSITION                              0x7
#define _IPR0_DMA1AIP_SIZE                                  0x1
#define _IPR0_DMA1AIP_LENGTH                                0x1
#define _IPR0_DMA1AIP_MASK                                  0x80

// Register: IPR1
#define IPR1 IPR1
extern volatile unsigned char           IPR1                __at(0x47E);
#ifndef _LIB_BUILD
asm("IPR1 equ 047Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA2SCNTIP             :1;
        unsigned DMA2DCNTIP             :1;
        unsigned DMA2ORIP               :1;
        unsigned DMA2AIP                :1;
        unsigned DMA3SCNTIP             :1;
        unsigned DMA3DCNTIP             :1;
        unsigned DMA3ORIP               :1;
        unsigned DMA3AIP                :1;
    };
} IPR1bits_t;
extern volatile IPR1bits_t IPR1bits __at(0x47E);
// bitfield macros
#define _IPR1_DMA2SCNTIP_POSN                               0x0
#define _IPR1_DMA2SCNTIP_POSITION                           0x0
#define _IPR1_DMA2SCNTIP_SIZE                               0x1
#define _IPR1_DMA2SCNTIP_LENGTH                             0x1
#define _IPR1_DMA2SCNTIP_MASK                               0x1
#define _IPR1_DMA2DCNTIP_POSN                               0x1
#define _IPR1_DMA2DCNTIP_POSITION                           0x1
#define _IPR1_DMA2DCNTIP_SIZE                               0x1
#define _IPR1_DMA2DCNTIP_LENGTH                             0x1
#define _IPR1_DMA2DCNTIP_MASK                               0x2
#define _IPR1_DMA2ORIP_POSN                                 0x2
#define _IPR1_DMA2ORIP_POSITION                             0x2
#define _IPR1_DMA2ORIP_SIZE                                 0x1
#define _IPR1_DMA2ORIP_LENGTH                               0x1
#define _IPR1_DMA2ORIP_MASK                                 0x4
#define _IPR1_DMA2AIP_POSN                                  0x3
#define _IPR1_DMA2AIP_POSITION                              0x3
#define _IPR1_DMA2AIP_SIZE                                  0x1
#define _IPR1_DMA2AIP_LENGTH                                0x1
#define _IPR1_DMA2AIP_MASK                                  0x8
#define _IPR1_DMA3SCNTIP_POSN                               0x4
#define _IPR1_DMA3SCNTIP_POSITION                           0x4
#define _IPR1_DMA3SCNTIP_SIZE                               0x1
#define _IPR1_DMA3SCNTIP_LENGTH                             0x1
#define _IPR1_DMA3SCNTIP_MASK                               0x10
#define _IPR1_DMA3DCNTIP_POSN                               0x5
#define _IPR1_DMA3DCNTIP_POSITION                           0x5
#define _IPR1_DMA3DCNTIP_SIZE                               0x1
#define _IPR1_DMA3DCNTIP_LENGTH                             0x1
#define _IPR1_DMA3DCNTIP_MASK                               0x20
#define _IPR1_DMA3ORIP_POSN                                 0x6
#define _IPR1_DMA3ORIP_POSITION                             0x6
#define _IPR1_DMA3ORIP_SIZE                                 0x1
#define _IPR1_DMA3ORIP_LENGTH                               0x1
#define _IPR1_DMA3ORIP_MASK                                 0x40
#define _IPR1_DMA3AIP_POSN                                  0x7
#define _IPR1_DMA3AIP_POSITION                              0x7
#define _IPR1_DMA3AIP_SIZE                                  0x1
#define _IPR1_DMA3AIP_LENGTH                                0x1
#define _IPR1_DMA3AIP_MASK                                  0x80

// Register: IPR2
#define IPR2 IPR2
extern volatile unsigned char           IPR2                __at(0x47F);
#ifndef _LIB_BUILD
asm("IPR2 equ 047Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA4SCNTIP             :1;
        unsigned DMA4DCNTIP             :1;
        unsigned DMA4ORIP               :1;
        unsigned DMA4AIP                :1;
        unsigned NVMIP                  :1;
        unsigned CRCIP                  :1;
        unsigned SCANIP                 :1;
        unsigned ACTIP                  :1;
    };
} IPR2bits_t;
