garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0x483);
#ifndef _LIB_BUILD
asm("IPR6 equ 0483h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIP                 :1;
        unsigned U1TXIP                 :1;
        unsigned U1IP                   :1;
        unsigned U1EIP                  :1;
        unsigned U2RXIP                 :1;
        unsigned U2TXIP                 :1;
        unsigned U2IP                   :1;
        unsigned U2EIP                  :1;
    };
} IPR6bits_t;
extern volatile IPR6bits_t IPR6bits __at(0x483);
// bitfield macros
#define _IPR6_U1RXIP_POSN                                   0x0
#define _IPR6_U1RXIP_POSITION                               0x0
#define _IPR6_U1RXIP_SIZE                                   0x1
#define _IPR6_U1RXIP_LENGTH                                 0x1
#define _IPR6_U1RXIP_MASK                                   0x1
#define _IPR6_U1TXIP_POSN                                   0x1
#define _IPR6_U1TXIP_POSITION                               0x1
#define _IPR6_U1TXIP_SIZE                                   0x1
#define _IPR6_U1TXIP_LENGTH                                 0x1
#define _IPR6_U1TXIP_MASK                                   0x2
#define _IPR6_U1IP_POSN                                     0x2
#define _IPR6_U1IP_POSITION                                 0x2
#define _IPR6_U1IP_SIZE                                     0x1
#define _IPR6_U1IP_LENGTH                                   0x1
#define _IPR6_U1IP_MASK                                     0x4
#define _IPR6_U1EIP_POSN                                    0x3
#define _IPR6_U1EIP_POSITION                                0x3
#define _IPR6_U1EIP_SIZE                                    0x1
#define _IPR6_U1EIP_LENGTH                                  0x1
#define _IPR6_U1EIP_MASK                                    0x8
#define _IPR6_U2RXIP_POSN                                   0x4
#define _IPR6_U2RXIP_POSITION                               0x4
#define _IPR6_U2RXIP_SIZE                                   0x1
#define _IPR6_U2RXIP_LENGTH                                 0x1
#define _IPR6_U2RXIP_MASK                                   0x10
#define _IPR6_U2TXIP_POSN                                   0x5
#define _IPR6_U2TXIP_POSITION                               0x5
#define _IPR6_U2TXIP_SIZE                                   0x1
#define _IPR6_U2TXIP_LENGTH                                 0x1
#define _IPR6_U2TXIP_MASK                                   0x20
#define _IPR6_U2IP_POSN                                     0x6
#define _IPR6_U2IP_POSITION                                 0x6
#define _IPR6_U2IP_SIZE                                     0x1
#define _IPR6_U2IP_LENGTH                                   0x1
#define _IPR6_U2IP_MASK                                     0x40
#define _IPR6_U2EIP_POSN                                    0x7
#define _IPR6_U2EIP_POSITION                                0x7
#define _IPR6_U2EIP_SIZE                                    0x1
#define _IPR6_U2EIP_LENGTH                                  0x1
#define _IPR6_U2EIP_MASK                                    0x80

// Register: IPR7
#define IPR7 IPR7
extern volatile unsigned char           IPR7                __at(0x484);
#ifndef _LIB_BUILD
asm("IPR7 equ 0484h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIP               :1;
        unsigned SPI1TXIP               :1;
        unsigned SPI1IP                 :1;
        unsigned I2C1RXIP               :1;
        unsigned I2C1TXIP               :1;
        unsigned I2C1IP                 :1;
        unsigned I2C1EIP                :1;
    };
} IPR7bits_t;
extern volatile IPR7bits_t IPR7bits __at(0x484);
// bitfield macros
#define _IPR7_SPI1RXIP_POSN                                 0x0
#define _IPR7_SPI1RXIP_POSITION                             0x0
#define _IPR7_SPI1RXIP_SIZE                                 0x1
#define _IPR7_SPI1RXIP_LENGTH                               0x1
#define _IPR7_SPI1RXIP_MASK                                 0x1
#define _IPR7_SPI1TXIP_POSN                                 0x1
#define _IPR7_SPI1TXIP_POSITION                             0x1
#define _IPR7_SPI1TXIP_SIZE                                 0x1
#define _IPR7_SPI1TXIP_LENGTH                               0x1
#define _IPR7_SPI1TXIP_MASK                                 0x2
#define _IPR7_SPI1IP_POSN                                   0x2
#define _IPR7_SPI1IP_POSITION                               0x2
#define _IPR7_SPI1IP_SIZE                                   0x1
#define _IPR7_SPI1IP_LENGTH                                 0x1
#define _IPR7_SPI1IP_MASK                                   0x4
#define _IPR7_I2C1RXIP_POSN                                 0x3
#define _IPR7_I2C1RXIP_POSITION                             0x3
#define _IPR7_I2C1RXIP_SIZE                                 0x1
#define _IPR7_I2C1RXIP_LENGTH                               0x1
#define _IPR7_I2C1RXIP_MASK                                 0x8
#define _IPR7_I2C1TXIP_POSN                                 0x4
#define _IPR7_I2C1TXIP_POSITION                             0x4
#define _IPR7_I2C1TXIP_SIZE                                 0x1
#define _IPR7_I2C1TXIP_LENGTH                               0x1
#define _IPR7_I2C1TXIP_MASK                                 0x10
#define _IPR7_I2C1IP_POSN                                   0x5
#define _IPR7_I2C1IP_POSITION                               0x5
#define _IPR7_I2C1IP_SIZE                                   0x1
#define _IPR7_I2C1IP_LENGTH                                 0x1
#define _IPR7_I2C1IP_MASK                                   0x20
#define _IPR7_I2C1EIP_POSN                                  0x6
#define _IPR7_I2C1EIP_POSITION                              0x6
#define _IPR7_I2C1EIP_SIZE                                  0x1
#define _IPR7_I2C1EIP_LENGTH                                0x1
#define _IPR7_I2C1EIP_MASK                                  0x40

// Register: IPR8
#define IPR8 IPR8
extern volatile unsigned char           IPR8                __at(0x485);
#ifndef _LIB_BUILD
asm("IPR8 equ 0485h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I3C1RXIP               :1;
        unsigned I3C1TXIP               :1;
        unsigned I3C1IP                 :1;
        unsigned I3C1EIP                :1;
        unsigned I3C1RIP                :1;
    };
} IPR8bits_t;
extern volatile IPR8bits_t IPR8bits __at(0x485);
// bitfield macros
#define _IPR8_I3C1RXIP_POSN                                 0x0
#define _IPR8_I3C1RXIP_POSITION                             0x0
#define _IPR8_I3C1RXIP_SIZE                                 0x1
#define _IPR8_I3C1RXIP_LENGTH                               0x1
#define _IPR8_I3C1RXIP_MASK                                 0x1
#define _IPR8_I3C1TXIP_POSN                                 0x1
#define _IPR8_I3C1TXIP_POSITION                             0x1
#define _IPR8_I3C1TXIP_SIZE                                 0x1
#define _IPR8_I3C1TXIP_LENGTH                               0x1
#define _IPR8_I3C1TXIP_MASK                                 0x2
#define _IPR8_I3C1IP_POSN                                   0x2
#define _IPR8_I3C1IP_POSITION                               0x2
#define _IPR8_I3C1IP_SIZE                                   0x1
#define _IPR8_I3C1IP_LENGTH                                 0x1
#define _IPR8_I3C1IP_MASK                                   0x4
#define _IPR8_I3C1EIP_POSN                                  0x3
#define _IPR8_I3C1EIP_POSITION                              0x3
#define _IPR8_I3C1EIP_SIZE                                  0x1
#define _IPR8_I3C1EIP_LENGTH                                0x1
#define _IPR8_I3C1EIP_MASK                                  0x8
#define _IPR8_I3C1RIP_POSN                                  0x4
#define _IPR8_I3C1RIP_POSITION                              0x4
#define _IPR8_I3C1RIP_SIZE                                  0x1
#define _IPR8_I3C1RIP_LENGTH                                0x1
#define _IPR8_I3C1RIP_MASK                                  0x10

// Register: IPR9
#define IPR9 IPR9
extern volatile unsigned char           IPR9                __at(0x486);
#ifndef _LIB_BUILD
asm("IPR9 equ 0486h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned HLVDIP                 :1;
        unsigned ADIP                   :1;
        unsigned ADTIP                  :1;
    };
} IPR9bits_t;
extern volatile IPR9bits_t IPR9bits __at(0x486);
// bitfield macros
#define _IPR9_HLVDIP_POSN                                   0x5
#define _IPR9_HLVDIP_POSITION                               0x5
#define _IPR9_HLVDIP_SIZE                                   0x1
#define _IPR9_HLVDIP_LENGTH                                 0x1
#define _IPR9_HLVDIP_MASK                                   0x20
#define _IPR9_ADIP_POSN                                     0x6
#define _IPR9_ADIP_POSITION                                 0x6
#define _IPR9_ADIP_SIZE                                     0x1
#define _IPR9_ADIP_LENGTH                                   0x1
#define _IPR9_ADIP_MASK                                     0x40
#define _IPR9_ADTIP_POSN                                    0x7
#define _IPR9_ADTIP_POSITION                                0x7
#define _IPR9_ADTIP_SIZE                                    0x1
#define _IPR9_ADTIP_LENGTH                                  0x1
#define _IPR9_ADTIP_MASK                                    0x80

// Register: PORTA
#define PORTA PORTA
extern volatile unsigned char           PORTA               __at(0x487);
#ifndef _LIB_BUILD
asm("PORTA equ 0487h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
    };
} PORTAbits_t;
