garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
extern volatile PORTWbits_t PORTWbits __at(0x499);
// bitfield macros
#define _PORTW_RW0_POSN                                     0x0
#define _PORTW_RW0_POSITION                                 0x0
#define _PORTW_RW0_SIZE                                     0x1
#define _PORTW_RW0_LENGTH                                   0x1
#define _PORTW_RW0_MASK                                     0x1
#define _PORTW_RW1_POSN                                     0x1
#define _PORTW_RW1_POSITION                                 0x1
#define _PORTW_RW1_SIZE                                     0x1
#define _PORTW_RW1_LENGTH                                   0x1
#define _PORTW_RW1_MASK                                     0x2
#define _PORTW_RW2_POSN                                     0x2
#define _PORTW_RW2_POSITION                                 0x2
#define _PORTW_RW2_SIZE                                     0x1
#define _PORTW_RW2_LENGTH                                   0x1
#define _PORTW_RW2_MASK                                     0x4
#define _PORTW_RW3_POSN                                     0x3
#define _PORTW_RW3_POSITION                                 0x3
#define _PORTW_RW3_SIZE                                     0x1
#define _PORTW_RW3_LENGTH                                   0x1
#define _PORTW_RW3_MASK                                     0x8
#define _PORTW_RW4_POSN                                     0x4
#define _PORTW_RW4_POSITION                                 0x4
#define _PORTW_RW4_SIZE                                     0x1
#define _PORTW_RW4_LENGTH                                   0x1
#define _PORTW_RW4_MASK                                     0x10
#define _PORTW_RW5_POSN                                     0x5
#define _PORTW_RW5_POSITION                                 0x5
#define _PORTW_RW5_SIZE                                     0x1
#define _PORTW_RW5_LENGTH                                   0x1
#define _PORTW_RW5_MASK                                     0x20
#define _PORTW_RW6_POSN                                     0x6
#define _PORTW_RW6_POSITION                                 0x6
#define _PORTW_RW6_SIZE                                     0x1
#define _PORTW_RW6_LENGTH                                   0x1
#define _PORTW_RW6_MASK                                     0x40
#define _PORTW_RW7_POSN                                     0x7
#define _PORTW_RW7_POSITION                                 0x7
#define _PORTW_RW7_SIZE                                     0x1
#define _PORTW_RW7_LENGTH                                   0x1
#define _PORTW_RW7_MASK                                     0x80

// Register: LATW
#define LATW LATW
extern volatile unsigned char           LATW                __at(0x49A);
#ifndef _LIB_BUILD
asm("LATW equ 049Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATW0                  :1;
        unsigned LATW1                  :1;
        unsigned LATW2                  :1;
        unsigned LATW3                  :1;
        unsigned LATW4                  :1;
        unsigned LATW5                  :1;
        unsigned LATW6                  :1;
        unsigned LATW7                  :1;
    };
} LATWbits_t;
extern volatile LATWbits_t LATWbits __at(0x49A);
// bitfield macros
#define _LATW_LATW0_POSN                                    0x0
#define _LATW_LATW0_POSITION                                0x0
#define _LATW_LATW0_SIZE                                    0x1
#define _LATW_LATW0_LENGTH                                  0x1
#define _LATW_LATW0_MASK                                    0x1
#define _LATW_LATW1_POSN                                    0x1
#define _LATW_LATW1_POSITION                                0x1
#define _LATW_LATW1_SIZE                                    0x1
#define _LATW_LATW1_LENGTH                                  0x1
#define _LATW_LATW1_MASK                                    0x2
#define _LATW_LATW2_POSN                                    0x2
#define _LATW_LATW2_POSITION                                0x2
#define _LATW_LATW2_SIZE                                    0x1
#define _LATW_LATW2_LENGTH                                  0x1
#define _LATW_LATW2_MASK                                    0x4
#define _LATW_LATW3_POSN                                    0x3
#define _LATW_LATW3_POSITION                                0x3
#define _LATW_LATW3_SIZE                                    0x1
#define _LATW_LATW3_LENGTH                                  0x1
#define _LATW_LATW3_MASK                                    0x8
#define _LATW_LATW4_POSN                                    0x4
#define _LATW_LATW4_POSITION                                0x4
#define _LATW_LATW4_SIZE                                    0x1
#define _LATW_LATW4_LENGTH                                  0x1
#define _LATW_LATW4_MASK                                    0x10
#define _LATW_LATW5_POSN                                    0x5
#define _LATW_LATW5_POSITION                                0x5
#define _LATW_LATW5_SIZE                                    0x1
#define _LATW_LATW5_LENGTH                                  0x1
#define _LATW_LATW5_MASK                                    0x20
#define _LATW_LATW6_POSN                                    0x6
#define _LATW_LATW6_POSITION                                0x6
#define _LATW_LATW6_SIZE                                    0x1
#define _LATW_LATW6_LENGTH                                  0x1
#define _LATW_LATW6_MASK                                    0x40
#define _LATW_LATW7_POSN                                    0x7
#define _LATW_LATW7_POSITION                                0x7
#define _LATW_LATW7_SIZE                                    0x1
#define _LATW_LATW7_LENGTH                                  0x1
#define _LATW_LATW7_MASK                                    0x80

// Register: PORTWIN0
#define PORTWIN0 PORTWIN0
extern volatile unsigned char           PORTWIN0            __at(0x49B);
#ifndef _LIB_BUILD
asm("PORTWIN0 equ 049Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN0bits_t;
extern volatile PORTWIN0bits_t PORTWIN0bits __at(0x49B);
// bitfield macros
#define _PORTWIN0_IN_POSN                                   0x0
#define _PORTWIN0_IN_POSITION                               0x0
#define _PORTWIN0_IN_SIZE                                   0x8
#define _PORTWIN0_IN_LENGTH                                 0x8
#define _PORTWIN0_IN_MASK                                   0xFF
#define _PORTWIN0_IN0_POSN                                  0x0
#define _PORTWIN0_IN0_POSITION                              0x0
#define _PORTWIN0_IN0_SIZE                                  0x1
#define _PORTWIN0_IN0_LENGTH                                0x1
#define _PORTWIN0_IN0_MASK                                  0x1
#define _PORTWIN0_IN1_POSN                                  0x1
#define _PORTWIN0_IN1_POSITION                              0x1
#define _PORTWIN0_IN1_SIZE                                  0x1
#define _PORTWIN0_IN1_LENGTH                                0x1
#define _PORTWIN0_IN1_MASK                                  0x2
#define _PORTWIN0_IN2_POSN                                  0x2
#define _PORTWIN0_IN2_POSITION                              0x2
#define _PORTWIN0_IN2_SIZE                                  0x1
#define _PORTWIN0_IN2_LENGTH                                0x1
#define _PORTWIN0_IN2_MASK                                  0x4

