garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
// Register: MVIOSTAT
#define MVIOSTAT MVIOSTAT
extern volatile unsigned char           MVIOSTAT            __at(0x4A6);
#ifndef _LIB_BUILD
asm("MVIOSTAT equ 04A6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VDDIO2RDY              :1;
    };
} MVIOSTATbits_t;
extern volatile MVIOSTATbits_t MVIOSTATbits __at(0x4A6);
// bitfield macros
#define _MVIOSTAT_VDDIO2RDY_POSN                            0x0
#define _MVIOSTAT_VDDIO2RDY_POSITION                        0x0
#define _MVIOSTAT_VDDIO2RDY_SIZE                            0x1
#define _MVIOSTAT_VDDIO2RDY_LENGTH                          0x1
#define _MVIOSTAT_VDDIO2RDY_MASK                            0x1

// Register: STATUS
#define STATUS STATUS
extern volatile unsigned char           STATUS              __at(0x4D8);
#ifndef _LIB_BUILD
asm("STATUS equ 04D8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
} STATUSbits_t;
extern volatile STATUSbits_t STATUSbits __at(0x4D8);
// bitfield macros
#define _STATUS_C_POSN                                      0x0
#define _STATUS_C_POSITION                                  0x0
#define _STATUS_C_SIZE                                      0x1
#define _STATUS_C_LENGTH                                    0x1
#define _STATUS_C_MASK                                      0x1
#define _STATUS_DC_POSN                                     0x1
#define _STATUS_DC_POSITION                                 0x1
#define _STATUS_DC_SIZE                                     0x1
#define _STATUS_DC_LENGTH                                   0x1
#define _STATUS_DC_MASK                                     0x2
#define _STATUS_Z_POSN                                      0x2
#define _STATUS_Z_POSITION                                  0x2
#define _STATUS_Z_SIZE                                      0x1
#define _STATUS_Z_LENGTH                                    0x1
#define _STATUS_Z_MASK                                      0x4
#define _STATUS_OV_POSN                                     0x3
#define _STATUS_OV_POSITION                                 0x3
#define _STATUS_OV_SIZE                                     0x1
#define _STATUS_OV_LENGTH                                   0x1
#define _STATUS_OV_MASK                                     0x8
#define _STATUS_N_POSN                                      0x4
#define _STATUS_N_POSITION                                  0x4
#define _STATUS_N_SIZE                                      0x1
#define _STATUS_N_LENGTH                                    0x1
#define _STATUS_N_MASK                                      0x10
#define _STATUS_PD_POSN                                     0x5
#define _STATUS_PD_POSITION                                 0x5
#define _STATUS_PD_SIZE                                     0x1
#define _STATUS_PD_LENGTH                                   0x1
#define _STATUS_PD_MASK                                     0x20
#define _STATUS_TO_POSN                                     0x6
#define _STATUS_TO_POSITION                                 0x6
#define _STATUS_TO_SIZE                                     0x1
#define _STATUS_TO_LENGTH                                   0x1
#define _STATUS_TO_MASK                                     0x40

// Register: FSR2
#define FSR2 FSR2
extern volatile unsigned short          FSR2                __at(0x4D9);
#ifndef _LIB_BUILD
asm("FSR2 equ 04D9h");
#endif

// Register: FSR2L
#define FSR2L FSR2L
extern volatile unsigned char           FSR2L               __at(0x4D9);
#ifndef _LIB_BUILD
asm("FSR2L equ 04D9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2L                  :8;
    };
} FSR2Lbits_t;
extern volatile FSR2Lbits_t FSR2Lbits __at(0x4D9);
// bitfield macros
#define _FSR2L_FSR2L_POSN                                   0x0
#define _FSR2L_FSR2L_POSITION                               0x0
#define _FSR2L_FSR2L_SIZE                                   0x8
#define _FSR2L_FSR2L_LENGTH                                 0x8
#define _FSR2L_FSR2L_MASK                                   0xFF

// Register: FSR2H
#define FSR2H FSR2H
extern volatile unsigned char           FSR2H               __at(0x4DA);
#ifndef _LIB_BUILD
asm("FSR2H equ 04DAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2H                  :6;
    };
} FSR2Hbits_t;
extern volatile FSR2Hbits_t FSR2Hbits __at(0x4DA);
// bitfield macros
#define _FSR2H_FSR2H_POSN                                   0x0
#define _FSR2H_FSR2H_POSITION                               0x0
#define _FSR2H_FSR2H_SIZE                                   0x6
#define _FSR2H_FSR2H_LENGTH                                 0x6
#define _FSR2H_FSR2H_MASK                                   0x3F

// Register: PLUSW2
#define PLUSW2 PLUSW2
extern volatile unsigned char           PLUSW2              __at(0x4DB);
#ifndef _LIB_BUILD
asm("PLUSW2 equ 04DBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLUSW2                 :8;
    };
} PLUSW2bits_t;
extern volatile PLUSW2bits_t PLUSW2bits __at(0x4DB);
// bitfield macros
#define _PLUSW2_PLUSW2_POSN                                 0x0
#define _PLUSW2_PLUSW2_POSITION                             0x0
#define _PLUSW2_PLUSW2_SIZE                                 0x8
#define _PLUSW2_PLUSW2_LENGTH                               0x8
#define _PLUSW2_PLUSW2_MASK                                 0xFF

// Register: PREINC2
#define PREINC2 PREINC2
extern volatile unsigned char           PREINC2             __at(0x4DC);
#ifndef _LIB_BUILD
asm("PREINC2 equ 04DCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PREINC2                :8;
    };
} PREINC2bits_t;
extern volatile PREINC2bits_t PREINC2bits __at(0x4DC);
// bitfield macros
#define _PREINC2_PREINC2_POSN                               0x0
#define _PREINC2_PREINC2_POSITION                           0x0
#define _PREINC2_PREINC2_SIZE                               0x8
#define _PREINC2_PREINC2_LENGTH                             0x8
#define _PREINC2_PREINC2_MASK                               0xFF

// Register: POSTDEC2
#define POSTDEC2 POSTDEC2
extern volatile unsigned char           POSTDEC2            __at(0x4DD);
#ifndef _LIB_BUILD
asm("POSTDEC2 equ 04DDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTDEC2               :8;
    };
} POSTDEC2bits_t;
extern volatile POSTDEC2bits_t POSTDEC2bits __at(0x4DD);
// bitfield macros
#define _POSTDEC2_POSTDEC2_POSN                             0x0
#define _POSTDEC2_POSTDEC2_POSITION                         0x0
#define _POSTDEC2_POSTDEC2_SIZE                             0x8
#define _POSTDEC2_POSTDEC2_LENGTH                           0x8
#define _POSTDEC2_POSTDEC2_MASK                             0xFF

// Register: POSTINC2
#define POSTINC2 POSTINC2
extern volatile unsigned char           POSTINC2            __at(0x4DE);
#ifndef _LIB_BUILD
asm("POSTINC2 equ 04DEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTINC2               :8;
    };
} POSTINC2bits_t;
extern volatile POSTINC2bits_t POSTINC2bits __at(0x4DE);
// bitfield macros
#define _POSTINC2_POSTINC2_POSN                             0x0
#define _POSTINC2_POSTINC2_POSITION                         0x0
#define _POSTINC2_POSTINC2_SIZE                             0x8
#define _POSTINC2_POSTINC2_LENGTH                           0x8
#define _POSTINC2_POSTINC2_MASK                             0xFF

// Register: INDF2
#define INDF2 INDF2
extern volatile unsigned char           INDF2               __at(0x4DF);
#ifndef _LIB_BUILD
asm("INDF2 equ 04DFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INDF2                  :8;
    };
} INDF2bits_t;
extern volatile INDF2bits_t INDF2bits __at(0x4DF);
// bitfield macros
#define _INDF2_INDF2_POSN                                   0x0
#define _INDF2_INDF2_POSITION                               0x0
#define _INDF2_INDF2_SIZE                                   0x8
#define _INDF2_INDF2_LENGTH                                 0x8
#define _INDF2_INDF2_MASK                                   0xFF

