garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
#define                                 DMA2DCNTIF_bit      _BIT_ACCESS(PIR1,1)
// IPR1<DMA2DCNTIP>
extern volatile __bit                   DMA2DCNTIP          __at(0x23F1);	// @ (0x47E * 8 + 1)
#define                                 DMA2DCNTIP_bit      _BIT_ACCESS(IPR1,1)
// PMD0<DMA2MD>
extern volatile __bit                   DMA2MD              __at(0x1801);	// @ (0x300 * 8 + 1)
#define                                 DMA2MD_bit          _BIT_ACCESS(PMD0,1)
// PIE1<DMA2ORIE>
extern volatile __bit                   DMA2ORIE            __at(0x23A2);	// @ (0x474 * 8 + 2)
#define                                 DMA2ORIE_bit        _BIT_ACCESS(PIE1,2)
// PIR1<DMA2ORIF>
extern volatile __bit                   DMA2ORIF            __at(0x2352);	// @ (0x46A * 8 + 2)
#define                                 DMA2ORIF_bit        _BIT_ACCESS(PIR1,2)
// IPR1<DMA2ORIP>
extern volatile __bit                   DMA2ORIP            __at(0x23F2);	// @ (0x47E * 8 + 2)
#define                                 DMA2ORIP_bit        _BIT_ACCESS(IPR1,2)
// DMA2PR<DMA2PR0>
extern volatile __bit                   DMA2PR0             __at(0x1E0);	// @ (0x3C * 8 + 0)
#define                                 DMA2PR0_bit         _BIT_ACCESS(DMA2PR,0)
// DMA2PR<DMA2PR1>
extern volatile __bit                   DMA2PR1             __at(0x1E1);	// @ (0x3C * 8 + 1)
#define                                 DMA2PR1_bit         _BIT_ACCESS(DMA2PR,1)
// DMA2PR<DMA2PR2>
extern volatile __bit                   DMA2PR2             __at(0x1E2);	// @ (0x3C * 8 + 2)
#define                                 DMA2PR2_bit         _BIT_ACCESS(DMA2PR,2)
// PIE1<DMA2SCNTIE>
extern volatile __bit                   DMA2SCNTIE          __at(0x23A0);	// @ (0x474 * 8 + 0)
#define                                 DMA2SCNTIE_bit      _BIT_ACCESS(PIE1,0)
// PIR1<DMA2SCNTIF>
extern volatile __bit                   DMA2SCNTIF          __at(0x2350);	// @ (0x46A * 8 + 0)
#define                                 DMA2SCNTIF_bit      _BIT_ACCESS(PIR1,0)
// IPR1<DMA2SCNTIP>
extern volatile __bit                   DMA2SCNTIP          __at(0x23F0);	// @ (0x47E * 8 + 0)
#define                                 DMA2SCNTIP_bit      _BIT_ACCESS(IPR1,0)
// PIE1<DMA3AIE>
extern volatile __bit                   DMA3AIE             __at(0x23A7);	// @ (0x474 * 8 + 7)
#define                                 DMA3AIE_bit         _BIT_ACCESS(PIE1,7)
// PIR1<DMA3AIF>
extern volatile __bit                   DMA3AIF             __at(0x2357);	// @ (0x46A * 8 + 7)
#define                                 DMA3AIF_bit         _BIT_ACCESS(PIR1,7)
// IPR1<DMA3AIP>
extern volatile __bit                   DMA3AIP             __at(0x23F7);	// @ (0x47E * 8 + 7)
#define                                 DMA3AIP_bit         _BIT_ACCESS(IPR1,7)
// PIE1<DMA3DCNTIE>
extern volatile __bit                   DMA3DCNTIE          __at(0x23A5);	// @ (0x474 * 8 + 5)
#define                                 DMA3DCNTIE_bit      _BIT_ACCESS(PIE1,5)
// PIR1<DMA3DCNTIF>
extern volatile __bit                   DMA3DCNTIF          __at(0x2355);	// @ (0x46A * 8 + 5)
#define                                 DMA3DCNTIF_bit      _BIT_ACCESS(PIR1,5)
// IPR1<DMA3DCNTIP>
extern volatile __bit                   DMA3DCNTIP          __at(0x23F5);	// @ (0x47E * 8 + 5)
#define                                 DMA3DCNTIP_bit      _BIT_ACCESS(IPR1,5)
// PMD0<DMA3MD>
extern volatile __bit                   DMA3MD              __at(0x1802);	// @ (0x300 * 8 + 2)
#define                                 DMA3MD_bit          _BIT_ACCESS(PMD0,2)
// PIE1<DMA3ORIE>
extern volatile __bit                   DMA3ORIE            __at(0x23A6);	// @ (0x474 * 8 + 6)
#define                                 DMA3ORIE_bit        _BIT_ACCESS(PIE1,6)
// PIR1<DMA3ORIF>
extern volatile __bit                   DMA3ORIF            __at(0x2356);	// @ (0x46A * 8 + 6)
#define                                 DMA3ORIF_bit        _BIT_ACCESS(PIR1,6)
// IPR1<DMA3ORIP>
extern volatile __bit                   DMA3ORIP            __at(0x23F6);	// @ (0x47E * 8 + 6)
#define                                 DMA3ORIP_bit        _BIT_ACCESS(IPR1,6)
// DMA3PR<DMA3PR0>
extern volatile __bit                   DMA3PR0             __at(0x1E8);	// @ (0x3D * 8 + 0)
#define                                 DMA3PR0_bit         _BIT_ACCESS(DMA3PR,0)
// DMA3PR<DMA3PR1>
extern volatile __bit                   DMA3PR1             __at(0x1E9);	// @ (0x3D * 8 + 1)
#define                                 DMA3PR1_bit         _BIT_ACCESS(DMA3PR,1)
// DMA3PR<DMA3PR2>
extern volatile __bit                   DMA3PR2             __at(0x1EA);	// @ (0x3D * 8 + 2)
#define                                 DMA3PR2_bit         _BIT_ACCESS(DMA3PR,2)
// PIE1<DMA3SCNTIE>
extern volatile __bit                   DMA3SCNTIE          __at(0x23A4);	// @ (0x474 * 8 + 4)
#define                                 DMA3SCNTIE_bit      _BIT_ACCESS(PIE1,4)
// PIR1<DMA3SCNTIF>
extern volatile __bit                   DMA3SCNTIF          __at(0x2354);	// @ (0x46A * 8 + 4)
#define                                 DMA3SCNTIF_bit      _BIT_ACCESS(PIR1,4)
// IPR1<DMA3SCNTIP>
extern volatile __bit                   DMA3SCNTIP          __at(0x23F4);	// @ (0x47E * 8 + 4)
#define                                 DMA3SCNTIP_bit      _BIT_ACCESS(IPR1,4)
// PIE2<DMA4AIE>
extern volatile __bit                   DMA4AIE             __at(0x23AB);	// @ (0x475 * 8 + 3)
#define                                 DMA4AIE_bit         _BIT_ACCESS(PIE2,3)
// PIR2<DMA4AIF>
extern volatile __bit                   DMA4AIF             __at(0x235B);	// @ (0x46B * 8 + 3)
#define                                 DMA4AIF_bit         _BIT_ACCESS(PIR2,3)
// IPR2<DMA4AIP>
extern volatile __bit                   DMA4AIP             __at(0x23FB);	// @ (0x47F * 8 + 3)
#define                                 DMA4AIP_bit         _BIT_ACCESS(IPR2,3)
// PIE2<DMA4DCNTIE>
extern volatile __bit                   DMA4DCNTIE          __at(0x23A9);	// @ (0x475 * 8 + 1)
#define                                 DMA4DCNTIE_bit      _BIT_ACCESS(PIE2,1)
// PIR2<DMA4DCNTIF>
extern volatile __bit                   DMA4DCNTIF          __at(0x2359);	// @ (0x46B * 8 + 1)
#define                                 DMA4DCNTIF_bit      _BIT_ACCESS(PIR2,1)
// IPR2<DMA4DCNTIP>
extern volatile __bit                   DMA4DCNTIP          __at(0x23F9);	// @ (0x47F * 8 + 1)
#define                                 DMA4DCNTIP_bit      _BIT_ACCESS(IPR2,1)
// PMD0<DMA4MD>
extern volatile __bit                   DMA4MD              __at(0x1803);	// @ (0x300 * 8 + 3)
#define                                 DMA4MD_bit          _BIT_ACCESS(PMD0,3)
// PIE2<DMA4ORIE>
extern volatile __bit                   DMA4ORIE            __at(0x23AA);	// @ (0x475 * 8 + 2)
#define                                 DMA4ORIE_bit        _BIT_ACCESS(PIE2,2)
// PIR2<DMA4ORIF>
extern volatile __bit                   DMA4ORIF            __at(0x235A);	// @ (0x46B * 8 + 2)
#define                                 DMA4ORIF_bit        _BIT_ACCESS(PIR2,2)
// IPR2<DMA4ORIP>
extern volatile __bit                   DMA4ORIP            __at(0x23FA);	// @ (0x47F * 8 + 2)
#define                                 DMA4ORIP_bit        _BIT_ACCESS(IPR2,2)
// DMA4PR<DMA4PR0>
extern volatile __bit                   DMA4PR0             __at(0x1F0);	// @ (0x3E * 8 + 0)
#define                                 DMA4PR0_bit         _BIT_ACCESS(DMA4PR,0)
// DMA4PR<DMA4PR1>
extern volatile __bit                   DMA4PR1             __at(0x1F1);	// @ (0x3E * 8 + 1)
#define                                 DMA4PR1_bit         _BIT_ACCESS(DMA4PR,1)
// DMA4PR<DMA4PR2>
extern volatile __bit                   DMA4PR2             __at(0x1F2);	// @ (0x3E * 8 + 2)
#define                                 DMA4PR2_bit         _BIT_ACCESS(DMA4PR,2)
// PIE2<DMA4SCNTIE>
extern volatile __bit                   DMA4SCNTIE          __at(0x23A8);	// @ (0x475 * 8 + 0)
#define                                 DMA4SCNTIE_bit      _BIT_ACCESS(PIE2,0)
// PIR2<DMA4SCNTIF>
extern volatile __bit                   DMA4SCNTIF          __at(0x2358);	// @ (0x46B * 8 + 0)
#define                                 DMA4SCNTIF_bit      _BIT_ACCESS(PIR2,0)
// IPR2<DMA4SCNTIP>
extern volatile __bit                   DMA4SCNTIP          __at(0x23F8);	// @ (0x47F * 8 + 0)
#define                                 DMA4SCNTIP_bit      _BIT_ACCESS(IPR2,0)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x2794);	// @ (0x4F2 * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x1178);	// @ (0x22F * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x2790);	// @ (0x4F2 * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x2791);	// @ (0x4F2 * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x2792);	// @ (0x4F2 * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x2796);	// @ (0x4F2 * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// DMAnDPTRL<DPTR0>
extern volatile __bit                   DPTR0               __at(0x220);	// @ (0x44 * 8 + 0)
#define                                 DPTR0_bit           _BIT_ACCESS(DMAnDPTRL,0)
// DMAnDPTRL<DPTR1>
extern volatile __bit                   DPTR1               __at(0x221);	// @ (0x44 * 8 + 1)
#define                                 DPTR1_bit           _BIT_ACCESS(DMAnDPTRL,1)
// DMAnDPTRH<DPTR10>
extern volatile __bit                   DPTR10              __at(0x22A);	// @ (0x45 * 8 + 2)
#define                                 DPTR10_bit          _BIT_ACCESS(DMAnDPTRH,2)
// DMAnDPTRH<DPTR11>
extern volatile __bit                   DPTR11              __at(0x22B);	// @ (0x45 * 8 + 3)
#define                                 DPTR11_bit          _BIT_ACCESS(DMAnDPTRH,3)
// DMAnDPTRH<DPTR12>
extern volatile __bit                   DPTR12              __at(0x22C);	// @ (0x45 * 8 + 4)
#define                                 DPTR12_bit          _BIT_ACCESS(DMAnDPTRH,4)
// DMAnDPTRH<DPTR13>
extern volatile __bit                   DPTR13              __at(0x22D);	// @ (0x45 * 8 + 5)
#define                                 DPTR13_bit          _BIT_ACCESS(DMAnDPTRH,5)
// DMAnDPTRH<DPTR14>
extern volatile __bit                   DPTR14              __at(0x22E);	// @ (0x45 * 8 + 6)
#define                                 DPTR14_bit          _BIT_ACCESS(DMAnDPTRH,6)
// DMAnDPTRH<DPTR15>
extern volatile __bit                   DPTR15              __at(0x22F);	// @ (0x45 * 8 + 7)
#define                                 DPTR15_bit          _BIT_ACCESS(DMAnDPTRH,7)
// DMAnDPTRL<DPTR2>
extern volatile __bit                   DPTR2               __at(0x222);	// @ (0x44 * 8 + 2)
#define                                 DPTR2_bit           _BIT_ACCESS(DMAnDPTRL,2)
// DMAnDPTRL<DPTR3>
extern volatile __bit                   DPTR3               __at(0x223);	// @ (0x44 * 8 + 3)
#define                                 DPTR3_bit           _BIT_ACCESS(DMAnDPTRL,3)
// DMAnDPTRL<DPTR4>
extern volatile __bit                   DPTR4               __at(0x224);	// @ (0x44 * 8 + 4)
#define                                 DPTR4_bit           _BIT_ACCESS(DMAnDPTRL,4)
// DMAnDPTRL<DPTR5>
extern volatile __bit                   DPTR5               __at(0x225);	// @ (0x44 * 8 + 5)
#define                                 DPTR5_bit           _BIT_ACCESS(DMAnDPTRL,5)
// DMAnDPTRL<DPTR6>
extern volatile __bit                   DPTR6               __at(0x226);	// @ (0x44 * 8 + 6)
#define                                 DPTR6_bit           _BIT_ACCESS(DMAnDPTRL,6)
// DMAnDPTRL<DPTR7>
extern volatile __bit                   DPTR7               __at(0x227);	// @ (0x44 * 8 + 7)
#define                                 DPTR7_bit           _BIT_ACCESS(DMAnDPTRL,7)
// DMAnDPTRH<DPTR8>
extern volatile __bit                   DPTR8               __at(0x228);	// @ (0x45 * 8 + 0)
#define                                 DPTR8_bit           _BIT_ACCESS(DMAnDPTRH,0)
// DMAnDPTRH<DPTR9>
extern volatile __bit                   DPTR9               __at(0x229);	// @ (0x45 * 8 + 1)
#define                                 DPTR9_bit           _BIT_ACCESS(DMAnDPTRH,1)
// DMAnDSAL<DSA0>
extern volatile __bit                   DSA0                __at(0x240);	// @ (0x48 * 8 + 0)
#define                                 DSA0_bit            _BIT_ACCESS(DMAnDSAL,0)
// DMAnDSAL<DSA1>
extern volatile __bit                   DSA1                __at(0x241);	// @ (0x48 * 8 + 1)
#define                                 DSA1_bit            _BIT_ACCESS(DMAnDSAL,1)
// DMAnDSAH<DSA10>
extern volatile __bit                   DSA10               __at(0x24A);	// @ (0x49 * 8 + 2)
#define                                 DSA10_bit           _BIT_ACCESS(DMAnDSAH,2)
// DMAnDSAH<DSA11>
extern volatile __bit                   DSA11               __at(0x24B);	// @ (0x49 * 8 + 3)
#define                                 DSA11_bit           _BIT_ACCESS(DMAnDSAH,3)
// DMAnDSAH<DSA12>
extern volatile __bit                   DSA12               __at(0x24C);	// @ (0x49 * 8 + 4)
#define                                 DSA12_bit           _BIT_ACCESS(DMAnDSAH,4)
// DMAnDSAH<DSA13>
extern volatile __bit                   DSA13               __at(0x24D);	// @ (0x49 * 8 + 5)
#define                                 DSA13_bit           _BIT_ACCESS(DMAnDSAH,5)
// DMAnDSAH<DSA14>
extern volatile __bit                   DSA14               __at(0x24E);	// @ (0x49 * 8 + 6)
#define                                 DSA14_bit           _BIT_ACCESS(DMAnDSAH,6)
// DMAnDSAH<DSA15>
extern volatile __bit                   DSA15               __at(0x24F);	// @ (0x49 * 8 + 7)
#define                                 DSA15_bit           _BIT_ACCESS(DMAnDSAH,7)
// DMAnDSAL<DSA2>
extern volatile __bit                   DSA2                __at(0x242);	// @ (0x48 * 8 + 2)
#define                                 DSA2_bit            _BIT_ACCESS(DMAnDSAL,2)
// DMAnDSAL<DSA3>
extern volatile __bit                   DSA3                __at(0x243);	// @ (0x48 * 8 + 3)
#define                                 DSA3_bit            _BIT_ACCESS(DMAnDSAL,3)
// DMAnDSAL<DSA4>
extern volatile __bit                   DSA4                __at(0x244);	// @ (0x48 * 8 + 4)
#define                                 DSA4_bit            _BIT_ACCESS(DMAnDSAL,4)
// DMAnDSAL<DSA5>
extern volatile __bit                   DSA5                __at(0x245);	// @ (0x48 * 8 + 5)
#define                                 DSA5_bit            _BIT_ACCESS(DMAnDSAL,5)
// DMAnDSAL<DSA6>
extern volatile __bit                   DSA6                __at(0x246);	// @ (0x48 * 8 + 6)
#define                                 DSA6_bit            _BIT_ACCESS(DMAnDSAL,6)
// DMAnDSAL<DSA7>
extern volatile __bit                   DSA7                __at(0x247);	// @ (0x48 * 8 + 7)
#define                                 DSA7_bit            _BIT_ACCESS(DMAnDSAL,7)
// DMAnDSAH<DSA8>
extern volatile __bit                   DSA8                __at(0x248);	// @ (0x49 * 8 + 0)
#define                                 DSA8_bit            _BIT_ACCESS(DMAnDSAH,0)
// DMAnDSAH<DSA9>
extern volatile __bit                   DSA9                __at(0x249);	// @ (0x49 * 8 + 1)
#define                                 DSA9_bit            _BIT_ACCESS(DMAnDSAH,1)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0x1180);	// @ (0x230 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// DMAnCON1<DSTP>
extern volatile __bit                   DSTP                __at(0x2AD);	// @ (0x55 * 8 + 5)
#define                                 DSTP_bit            _BIT_ACCESS(DMAnCON1,5)
// DMAnDSZL<DSZ0>
extern volatile __bit                   DSZ0                __at(0x230);	// @ (0x46 * 8 + 0)
#define                                 DSZ0_bit            _BIT_ACCESS(DMAnDSZL,0)
// DMAnDSZL<DSZ1>
extern volatile __bit                   DSZ1                __at(0x231);	// @ (0x46 * 8 + 1)
#define                                 DSZ1_bit            _BIT_ACCESS(DMAnDSZL,1)
// DMAnDSZH<DSZ10>
extern volatile __bit                   DSZ10               __at(0x23A);	// @ (0x47 * 8 + 2)
#define                                 DSZ10_bit           _BIT_ACCESS(DMAnDSZH,2)
// DMAnDSZH<DSZ11>
extern volatile __bit                   DSZ11               __at(0x23B);	// @ (0x47 * 8 + 3)
#define                                 DSZ11_bit           _BIT_ACCESS(DMAnDSZH,3)
// DMAnDSZL<DSZ2>
extern volatile __bit                   DSZ2                __at(0x232);	// @ (0x46 * 8 + 2)
#define                                 DSZ2_bit            _BIT_ACCESS(DMAnDSZL,2)
// DMAnDSZL<DSZ3>
extern volatile __bit                   DSZ3                __at(0x233);	// @ (0x46 * 8 + 3)
#define                                 DSZ3_bit            _BIT_ACCESS(DMAnDSZL,3)
// DMAnDSZL<DSZ4>
extern volatile __bit                   DSZ4                __at(0x234);	// @ (0x46 * 8 + 4)
#define                                 DSZ4_bit            _BIT_ACCESS(DMAnDSZL,4)
// DMAnDSZL<DSZ5>
extern volatile __bit                   DSZ5                __at(0x235);	// @ (0x46 * 8 + 5)
#define                                 DSZ5_bit            _BIT_ACCESS(DMAnDSZL,5)
// DMAnDSZL<DSZ6>
extern volatile __bit                   DSZ6                __at(0x236);	// @ (0x46 * 8 + 6)
#define                                 DSZ6_bit            _BIT_ACCESS(DMAnDSZL,6)
// DMAnDSZL<DSZ7>
extern volatile __bit                   DSZ7                __at(0x237);	// @ (0x46 * 8 + 7)
#define                                 DSZ7_bit            _BIT_ACCESS(DMAnDSZL,7)
// DMAnDSZH<DSZ8>
extern volatile __bit                   DSZ8                __at(0x238);	// @ (0x47 * 8 + 0)
#define                                 DSZ8_bit            _BIT_ACCESS(DMAnDSZH,0)
// DMAnDSZH<DSZ9>
extern volatile __bit                   DSZ9                __at(0x239);	// @ (0x47 * 8 + 1)
#define                                 DSZ9_bit            _BIT_ACCESS(DMAnDSZH,1)
// I3C1EC<EC2>
extern volatile __bit                   EC2                 __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 EC2_bit             _BIT_ACCESS(I3C1EC,2)
// SPI1INTE<EOSIE>
extern volatile __bit                   EOSIE               __at(0xF14);	// @ (0x1E2 * 8 + 4)
#define                                 EOSIE_bit           _BIT_ACCESS(SPI1INTE,4)
// SPI1INTF<EOSIF>
extern volatile __bit                   EOSIF               __at(0xF0C);	// @ (0x1E1 * 8 + 4)
#define                                 EOSIF_bit           _BIT_ACCESS(SPI1INTF,4)
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0x10C8);	// @ (0x219 * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(ADERRL,0)
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0x10C9);	// @ (0x219 * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(ADERRL,1)
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0x10D2);	// @ (0x21A * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(ADERRH,2)
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0x10D3);	// @ (0x21A * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(ADERRH,3)
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0x10D4);	// @ (0x21A * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(ADERRH,4)
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0x10D5);	// @ (0x21A * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(ADERRH,5)
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0x10D6);	// @ (0x21A * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(ADERRH,6)
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0x10D7);	// @ (0x21A * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(ADERRH,7)
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0x10CA);	// @ (0x219 * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(ADERRL,2)
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0x10CB);	// @ (0x219 * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(ADERRL,3)
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0x10CC);	// @ (0x219 * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(ADERRL,4)
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0x10CD);	// @ (0x219 * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(ADERRL,5)
// ADERRL<ERR6>
extern volatile __bit                   ERR6                __at(0x10CE);	// @ (0x219 * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(ADERRL,6)
// ADERRL<ERR7>
extern volatile __bit                   ERR7                __at(0x10CF);	// @ (0x219 * 8 + 7)
#define                                 ERR7_bit            _BIT_ACCESS(ADERRL,7)
// ADERRH<ERR8>
extern volatile __bit                   ERR8                __at(0x10D0);	// @ (0x21A * 8 + 0)
#define                                 ERR8_bit            _BIT_ACCESS(ADERRH,0)
// ADERRH<ERR9>
extern volatile __bit                   ERR9                __at(0x10D1);	// @ (0x21A * 8 + 1)
#define                                 ERR9_bit            _BIT_ACCESS(ADERRH,1)
// OSCEN<EXTOEN>
extern volatile __bit                   EXTOEN              __at(0x3F7);	// @ (0x7E * 8 + 7)
#define                                 EXTOEN_bit          _BIT_ACCESS(OSCEN,7)
// OSCSTAT<EXTOR>
extern volatile __bit                   EXTOR               __at(0x3EF);	// @ (0x7D * 8 + 7)
#define                                 EXTOR_bit           _BIT_ACCESS(OSCSTAT,7)
// I3C1CON1<FHDRE>
extern volatile __bit                   FHDRE               __at(0x422);	// @ (0x84 * 8 + 2)
#define                                 FHDRE_bit           _BIT_ACCESS(I3C1CON1,2)
// I3C1I2CCON<FLTEN>
extern volatile __bit                   FLTEN               __at(0x5A2);	// @ (0xB4 * 8 + 2)
#define                                 FLTEN_bit           _BIT_ACCESS(I3C1I2CCON,2)
// ADFLTRL<FLTR0>
extern volatile __bit                   FLTR0               __at(0x10E8);	// @ (0x21D * 8 + 0)
#define                                 FLTR0_bit           _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<FLTR1>
extern volatile __bit                   FLTR1               __at(0x10E9);	// @ (0x21D * 8 + 1)
#define                                 FLTR1_bit           _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<FLTR10>
extern volatile __bit                   FLTR10              __at(0x10F2);	// @ (0x21E * 8 + 2)
#define                                 FLTR10_bit          _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<FLTR11>
extern volatile __bit                   FLTR11              __at(0x10F3);	// @ (0x21E * 8 + 3)
#define                                 FLTR11_bit          _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<FLTR12>
extern volatile __bit                   FLTR12              __at(0x10F4);	// @ (0x21E * 8 + 4)
