garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
#define                                 HLVDRDY_bit         _BIT_ACCESS(HLVDCON0,4)
// HLVDCON1<HLVDSEL0>
extern volatile __bit                   HLVDSEL0            __at(0x1018);	// @ (0x203 * 8 + 0)
#define                                 HLVDSEL0_bit        _BIT_ACCESS(HLVDCON1,0)
// HLVDCON1<HLVDSEL1>
extern volatile __bit                   HLVDSEL1            __at(0x1019);	// @ (0x203 * 8 + 1)
#define                                 HLVDSEL1_bit        _BIT_ACCESS(HLVDCON1,1)
// HLVDCON1<HLVDSEL2>
extern volatile __bit                   HLVDSEL2            __at(0x101A);	// @ (0x203 * 8 + 2)
#define                                 HLVDSEL2_bit        _BIT_ACCESS(HLVDCON1,2)
// HLVDCON1<HLVDSEL3>
extern volatile __bit                   HLVDSEL3            __at(0x101B);	// @ (0x203 * 8 + 3)
#define                                 HLVDSEL3_bit        _BIT_ACCESS(HLVDCON1,3)
// I2C1CNTL<I2C1CNT0>
extern volatile __bit                   I2C1CNT0            __at(0xF68);	// @ (0x1ED * 8 + 0)
#define                                 I2C1CNT0_bit        _BIT_ACCESS(I2C1CNTL,0)
// I2C1CNTL<I2C1CNT1>
extern volatile __bit                   I2C1CNT1            __at(0xF69);	// @ (0x1ED * 8 + 1)
#define                                 I2C1CNT1_bit        _BIT_ACCESS(I2C1CNTL,1)
// I2C1CNTH<I2C1CNT10>
extern volatile __bit                   I2C1CNT10           __at(0xF72);	// @ (0x1EE * 8 + 2)
#define                                 I2C1CNT10_bit       _BIT_ACCESS(I2C1CNTH,2)
// I2C1CNTH<I2C1CNT11>
extern volatile __bit                   I2C1CNT11           __at(0xF73);	// @ (0x1EE * 8 + 3)
#define                                 I2C1CNT11_bit       _BIT_ACCESS(I2C1CNTH,3)
// I2C1CNTH<I2C1CNT12>
extern volatile __bit                   I2C1CNT12           __at(0xF74);	// @ (0x1EE * 8 + 4)
#define                                 I2C1CNT12_bit       _BIT_ACCESS(I2C1CNTH,4)
// I2C1CNTH<I2C1CNT13>
extern volatile __bit                   I2C1CNT13           __at(0xF75);	// @ (0x1EE * 8 + 5)
#define                                 I2C1CNT13_bit       _BIT_ACCESS(I2C1CNTH,5)
// I2C1CNTH<I2C1CNT14>
extern volatile __bit                   I2C1CNT14           __at(0xF76);	// @ (0x1EE * 8 + 6)
#define                                 I2C1CNT14_bit       _BIT_ACCESS(I2C1CNTH,6)
// I2C1CNTH<I2C1CNT15>
extern volatile __bit                   I2C1CNT15           __at(0xF77);	// @ (0x1EE * 8 + 7)
#define                                 I2C1CNT15_bit       _BIT_ACCESS(I2C1CNTH,7)
// I2C1CNTL<I2C1CNT2>
extern volatile __bit                   I2C1CNT2            __at(0xF6A);	// @ (0x1ED * 8 + 2)
#define                                 I2C1CNT2_bit        _BIT_ACCESS(I2C1CNTL,2)
// I2C1CNTL<I2C1CNT3>
extern volatile __bit                   I2C1CNT3            __at(0xF6B);	// @ (0x1ED * 8 + 3)
#define                                 I2C1CNT3_bit        _BIT_ACCESS(I2C1CNTL,3)
// I2C1CNTL<I2C1CNT4>
extern volatile __bit                   I2C1CNT4            __at(0xF6C);	// @ (0x1ED * 8 + 4)
#define                                 I2C1CNT4_bit        _BIT_ACCESS(I2C1CNTL,4)
// I2C1CNTL<I2C1CNT5>
extern volatile __bit                   I2C1CNT5            __at(0xF6D);	// @ (0x1ED * 8 + 5)
#define                                 I2C1CNT5_bit        _BIT_ACCESS(I2C1CNTL,5)
// I2C1CNTL<I2C1CNT6>
extern volatile __bit                   I2C1CNT6            __at(0xF6E);	// @ (0x1ED * 8 + 6)
#define                                 I2C1CNT6_bit        _BIT_ACCESS(I2C1CNTL,6)
// I2C1CNTL<I2C1CNT7>
extern volatile __bit                   I2C1CNT7            __at(0xF6F);	// @ (0x1ED * 8 + 7)
#define                                 I2C1CNT7_bit        _BIT_ACCESS(I2C1CNTL,7)
// I2C1CNTH<I2C1CNT8>
extern volatile __bit                   I2C1CNT8            __at(0xF70);	// @ (0x1EE * 8 + 0)
#define                                 I2C1CNT8_bit        _BIT_ACCESS(I2C1CNTH,0)
// I2C1CNTH<I2C1CNT9>
extern volatile __bit                   I2C1CNT9            __at(0xF71);	// @ (0x1EE * 8 + 1)
#define                                 I2C1CNT9_bit        _BIT_ACCESS(I2C1CNTH,1)
// PIE7<I2C1EIE>
extern volatile __bit                   I2C1EIE             __at(0x23D6);	// @ (0x47A * 8 + 6)
#define                                 I2C1EIE_bit         _BIT_ACCESS(PIE7,6)
// PIR7<I2C1EIF>
extern volatile __bit                   I2C1EIF             __at(0x2386);	// @ (0x470 * 8 + 6)
#define                                 I2C1EIF_bit         _BIT_ACCESS(PIR7,6)
// IPR7<I2C1EIP>
extern volatile __bit                   I2C1EIP             __at(0x2426);	// @ (0x484 * 8 + 6)
#define                                 I2C1EIP_bit         _BIT_ACCESS(IPR7,6)
// PIE7<I2C1IE>
extern volatile __bit                   I2C1IE              __at(0x23D5);	// @ (0x47A * 8 + 5)
#define                                 I2C1IE_bit          _BIT_ACCESS(PIE7,5)
// PIR7<I2C1IF>
extern volatile __bit                   I2C1IF              __at(0x2385);	// @ (0x470 * 8 + 5)
#define                                 I2C1IF_bit          _BIT_ACCESS(PIR7,5)
// IPR7<I2C1IP>
extern volatile __bit                   I2C1IP              __at(0x2425);	// @ (0x484 * 8 + 5)
#define                                 I2C1IP_bit          _BIT_ACCESS(IPR7,5)
// PMD3<I2C1MD>
extern volatile __bit                   I2C1MD              __at(0x181E);	// @ (0x303 * 8 + 6)
#define                                 I2C1MD_bit          _BIT_ACCESS(PMD3,6)
// PIE7<I2C1RXIE>
extern volatile __bit                   I2C1RXIE            __at(0x23D3);	// @ (0x47A * 8 + 3)
#define                                 I2C1RXIE_bit        _BIT_ACCESS(PIE7,3)
// PIR7<I2C1RXIF>
extern volatile __bit                   I2C1RXIF            __at(0x2383);	// @ (0x470 * 8 + 3)
#define                                 I2C1RXIF_bit        _BIT_ACCESS(PIR7,3)
// IPR7<I2C1RXIP>
extern volatile __bit                   I2C1RXIP            __at(0x2423);	// @ (0x484 * 8 + 3)
#define                                 I2C1RXIP_bit        _BIT_ACCESS(IPR7,3)
// I2C1SCLPPS<I2C1SCLPPS0>
extern volatile __bit                   I2C1SCLPPS0         __at(0x1D68);	// @ (0x3AD * 8 + 0)
#define                                 I2C1SCLPPS0_bit     _BIT_ACCESS(I2C1SCLPPS,0)
// I2C1SCLPPS<I2C1SCLPPS1>
extern volatile __bit                   I2C1SCLPPS1         __at(0x1D69);	// @ (0x3AD * 8 + 1)
#define                                 I2C1SCLPPS1_bit     _BIT_ACCESS(I2C1SCLPPS,1)
// I2C1SCLPPS<I2C1SCLPPS2>
extern volatile __bit                   I2C1SCLPPS2         __at(0x1D6A);	// @ (0x3AD * 8 + 2)
#define                                 I2C1SCLPPS2_bit     _BIT_ACCESS(I2C1SCLPPS,2)
// I2C1SCLPPS<I2C1SCLPPS3>
extern volatile __bit                   I2C1SCLPPS3         __at(0x1D6B);	// @ (0x3AD * 8 + 3)
#define                                 I2C1SCLPPS3_bit     _BIT_ACCESS(I2C1SCLPPS,3)
// I2C1SCLPPS<I2C1SCLPPS4>
extern volatile __bit                   I2C1SCLPPS4         __at(0x1D6C);	// @ (0x3AD * 8 + 4)
#define                                 I2C1SCLPPS4_bit     _BIT_ACCESS(I2C1SCLPPS,4)
// I2C1SDAPPS<I2C1SDAPPS0>
extern volatile __bit                   I2C1SDAPPS0         __at(0x1D70);	// @ (0x3AE * 8 + 0)
#define                                 I2C1SDAPPS0_bit     _BIT_ACCESS(I2C1SDAPPS,0)
// I2C1SDAPPS<I2C1SDAPPS1>
extern volatile __bit                   I2C1SDAPPS1         __at(0x1D71);	// @ (0x3AE * 8 + 1)
#define                                 I2C1SDAPPS1_bit     _BIT_ACCESS(I2C1SDAPPS,1)
// I2C1SDAPPS<I2C1SDAPPS2>
extern volatile __bit                   I2C1SDAPPS2         __at(0x1D72);	// @ (0x3AE * 8 + 2)
#define                                 I2C1SDAPPS2_bit     _BIT_ACCESS(I2C1SDAPPS,2)
// I2C1SDAPPS<I2C1SDAPPS3>
extern volatile __bit                   I2C1SDAPPS3         __at(0x1D73);	// @ (0x3AE * 8 + 3)
#define                                 I2C1SDAPPS3_bit     _BIT_ACCESS(I2C1SDAPPS,3)
// I2C1SDAPPS<I2C1SDAPPS4>
extern volatile __bit                   I2C1SDAPPS4         __at(0x1D74);	// @ (0x3AE * 8 + 4)
#define                                 I2C1SDAPPS4_bit     _BIT_ACCESS(I2C1SDAPPS,4)
// PIE7<I2C1TXIE>
extern volatile __bit                   I2C1TXIE            __at(0x23D4);	// @ (0x47A * 8 + 4)
#define                                 I2C1TXIE_bit        _BIT_ACCESS(PIE7,4)
// PIR7<I2C1TXIF>
extern volatile __bit                   I2C1TXIF            __at(0x2384);	// @ (0x470 * 8 + 4)
#define                                 I2C1TXIF_bit        _BIT_ACCESS(PIR7,4)
// IPR7<I2C1TXIP>
extern volatile __bit                   I2C1TXIP            __at(0x2424);	// @ (0x484 * 8 + 4)
#define                                 I2C1TXIP_bit        _BIT_ACCESS(IPR7,4)
// I3C1PIE0<I2CACKIE>
extern volatile __bit                   I2CACKIE            __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 I2CACKIE_bit        _BIT_ACCESS(I3C1PIE0,4)
// I3C1PIR0<I2CACKIF>
extern volatile __bit                   I2CACKIF            __at(0x454);	// @ (0x8A * 8 + 4)
#define                                 I2CACKIF_bit        _BIT_ACCESS(I3C1PIR0,4)
// I2C1BTOC<I2CBTOC0>
extern volatile __bit                   I2CBTOC0            __at(0xFD0);	// @ (0x1FA * 8 + 0)
#define                                 I2CBTOC0_bit        _BIT_ACCESS(I2C1BTOC,0)
// I2C1BTOC<I2CBTOC1>
extern volatile __bit                   I2CBTOC1            __at(0xFD1);	// @ (0x1FA * 8 + 1)
#define                                 I2CBTOC1_bit        _BIT_ACCESS(I2C1BTOC,1)
// I2C1BTOC<I2CBTOC2>
extern volatile __bit                   I2CBTOC2            __at(0xFD2);	// @ (0x1FA * 8 + 2)
#define                                 I2CBTOC2_bit        _BIT_ACCESS(I2C1BTOC,2)
// I2C1CLK<I2CCLK0>
extern volatile __bit                   I2CCLK0             __at(0xFC8);	// @ (0x1F9 * 8 + 0)
#define                                 I2CCLK0_bit         _BIT_ACCESS(I2C1CLK,0)
// I2C1CLK<I2CCLK1>
extern volatile __bit                   I2CCLK1             __at(0xFC9);	// @ (0x1F9 * 8 + 1)
#define                                 I2CCLK1_bit         _BIT_ACCESS(I2C1CLK,1)
// I2C1CLK<I2CCLK2>
extern volatile __bit                   I2CCLK2             __at(0xFCA);	// @ (0x1F9 * 8 + 2)
#define                                 I2CCLK2_bit         _BIT_ACCESS(I2C1CLK,2)
// I2C1CLK<I2CCLK3>
extern volatile __bit                   I2CCLK3             __at(0xFCB);	// @ (0x1F9 * 8 + 3)
#define                                 I2CCLK3_bit         _BIT_ACCESS(I2C1CLK,3)
// I2C1CON0<I2CEN>
extern volatile __bit                   I2CEN               __at(0xF37);	// @ (0x1E6 * 8 + 7)
#define                                 I2CEN_bit           _BIT_ACCESS(I2C1CON0,7)
// I3C1ERRIE0<I2CNACKIE>
extern volatile __bit                   I2CNACKIE           __at(0x487);	// @ (0x90 * 8 + 7)
#define                                 I2CNACKIE_bit       _BIT_ACCESS(I3C1ERRIE0,7)
// I3C1ERRIR0<I2CNACKIF>
extern volatile __bit                   I2CNACKIF           __at(0x467);	// @ (0x8C * 8 + 7)
#define                                 I2CNACKIF_bit       _BIT_ACCESS(I3C1ERRIR0,7)
// PIE8<I3C1EIE>
extern volatile __bit                   I3C1EIE             __at(0x23DB);	// @ (0x47B * 8 + 3)
#define                                 I3C1EIE_bit         _BIT_ACCESS(PIE8,3)
// PIR8<I3C1EIF>
extern volatile __bit                   I3C1EIF             __at(0x238B);	// @ (0x471 * 8 + 3)
#define                                 I3C1EIF_bit         _BIT_ACCESS(PIR8,3)
// IPR8<I3C1EIP>
extern volatile __bit                   I3C1EIP             __at(0x242B);	// @ (0x485 * 8 + 3)
#define                                 I3C1EIP_bit         _BIT_ACCESS(IPR8,3)
// PIE8<I3C1IE>
extern volatile __bit                   I3C1IE              __at(0x23DA);	// @ (0x47B * 8 + 2)
#define                                 I3C1IE_bit          _BIT_ACCESS(PIE8,2)
// PIR8<I3C1IF>
extern volatile __bit                   I3C1IF              __at(0x238A);	// @ (0x471 * 8 + 2)
#define                                 I3C1IF_bit          _BIT_ACCESS(PIR8,2)
// IPR8<I3C1IP>
extern volatile __bit                   I3C1IP              __at(0x242A);	// @ (0x485 * 8 + 2)
#define                                 I3C1IP_bit          _BIT_ACCESS(IPR8,2)
// PMD3<I3C1MD>
extern volatile __bit                   I3C1MD              __at(0x181F);	// @ (0x303 * 8 + 7)
#define                                 I3C1MD_bit          _BIT_ACCESS(PMD3,7)
// PIE8<I3C1RIE>
extern volatile __bit                   I3C1RIE             __at(0x23DC);	// @ (0x47B * 8 + 4)
#define                                 I3C1RIE_bit         _BIT_ACCESS(PIE8,4)
// PIR8<I3C1RIF>
extern volatile __bit                   I3C1RIF             __at(0x238C);	// @ (0x471 * 8 + 4)
#define                                 I3C1RIF_bit         _BIT_ACCESS(PIR8,4)
// IPR8<I3C1RIP>
extern volatile __bit                   I3C1RIP             __at(0x242C);	// @ (0x485 * 8 + 4)
#define                                 I3C1RIP_bit         _BIT_ACCESS(IPR8,4)
// PIE8<I3C1RXIE>
extern volatile __bit                   I3C1RXIE            __at(0x23D8);	// @ (0x47B * 8 + 0)
#define                                 I3C1RXIE_bit        _BIT_ACCESS(PIE8,0)
// PIR8<I3C1RXIF>
extern volatile __bit                   I3C1RXIF            __at(0x2388);	// @ (0x471 * 8 + 0)
#define                                 I3C1RXIF_bit        _BIT_ACCESS(PIR8,0)
// IPR8<I3C1RXIP>
extern volatile __bit                   I3C1RXIP            __at(0x2428);	// @ (0x485 * 8 + 0)
#define                                 I3C1RXIP_bit        _BIT_ACCESS(IPR8,0)
// PIE8<I3C1TXIE>
extern volatile __bit                   I3C1TXIE            __at(0x23D9);	// @ (0x47B * 8 + 1)
#define                                 I3C1TXIE_bit        _BIT_ACCESS(PIE8,1)
// PIR8<I3C1TXIF>
extern volatile __bit                   I3C1TXIF            __at(0x2389);	// @ (0x471 * 8 + 1)
#define                                 I3C1TXIF_bit        _BIT_ACCESS(PIR8,1)
// IPR8<I3C1TXIP>
extern volatile __bit                   I3C1TXIP            __at(0x2429);	// @ (0x485 * 8 + 1)
#define                                 I3C1TXIP_bit        _BIT_ACCESS(IPR8,1)
// I3C1PIE1<IBIDONEIE>
extern volatile __bit                   IBIDONEIE           __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 IBIDONEIE_bit       _BIT_ACCESS(I3C1PIE1,5)
// I3C1PIR1<IBIDONEIF>
extern volatile __bit                   IBIDONEIF           __at(0x45D);	// @ (0x8B * 8 + 5)
#define                                 IBIDONEIF_bit       _BIT_ACCESS(I3C1PIR1,5)
// I3C1ERRIE0<IBIEIE>
extern volatile __bit                   IBIEIE              __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 IBIEIE_bit          _BIT_ACCESS(I3C1ERRIE0,3)
// I3C1ERRIR0<IBIEIF>
extern volatile __bit                   IBIEIF              __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 IBIEIF_bit          _BIT_ACCESS(I3C1ERRIR0,3)
// I3C1EC<IBIEN>
extern volatile __bit                   IBIEN               __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 IBIEN_bit           _BIT_ACCESS(I3C1EC,0)
// I3C1CON0<IBIREQ>
extern volatile __bit                   IBIREQ              __at(0x418);	// @ (0x83 * 8 + 0)
#define                                 IBIREQ_bit          _BIT_ACCESS(I3C1CON0,0)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x2797);	// @ (0x4F2 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// CWG1CON1<IN>
extern volatile __bit                   IN                  __at(0xCF5);	// @ (0x19E * 8 + 5)
#define                                 IN_bit              _BIT_ACCESS(CWG1CON1,5)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x20D0);	// @ (0x41A * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x20D1);	// @ (0x41A * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x20D2);	// @ (0x41A * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x20D3);	// @ (0x41A * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x20D4);	// @ (0x41A * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x20D5);	// @ (0x41A * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x2170);	// @ (0x42E * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x2171);	// @ (0x42E * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x2173);	// @ (0x42E * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x2174);	// @ (0x42E * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x2175);	// @ (0x42E * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x2176);	// @ (0x42E * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x2177);	// @ (0x42E * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// I3C1DSTAT0<INPEND0>
extern volatile __bit                   INPEND0             __at(0x550);	// @ (0xAA * 8 + 0)
#define                                 INPEND0_bit         _BIT_ACCESS(I3C1DSTAT0,0)
// INTCON0<INT0EDG>
extern volatile __bit                   INT0EDG             __at(0x2308);	// @ (0x461 * 8 + 0)
#define                                 INT0EDG_bit         _BIT_ACCESS(INTCON0,0)
// PIE0<INT0IE>
extern volatile __bit                   INT0IE              __at(0x2399);	// @ (0x473 * 8 + 1)
#define                                 INT0IE_bit          _BIT_ACCESS(PIE0,1)
// PIR0<INT0IF>
extern volatile __bit                   INT0IF              __at(0x2349);	// @ (0x469 * 8 + 1)
#define                                 INT0IF_bit          _BIT_ACCESS(PIR0,1)
// IPR0<INT0IP>
extern volatile __bit                   INT0IP              __at(0x23E9);	// @ (0x47D * 8 + 1)
#define                                 INT0IP_bit          _BIT_ACCESS(IPR0,1)
// INT0PPS<INT0PPS0>
extern volatile __bit                   INT0PPS0            __at(0x1A90);	// @ (0x352 * 8 + 0)
#define                                 INT0PPS0_bit        _BIT_ACCESS(INT0PPS,0)
// INT0PPS<INT0PPS1>
extern volatile __bit                   INT0PPS1            __at(0x1A91);	// @ (0x352 * 8 + 1)
#define                                 INT0PPS1_bit        _BIT_ACCESS(INT0PPS,1)
// INT0PPS<INT0PPS2>
extern volatile __bit                   INT0PPS2            __at(0x1A92);	// @ (0x352 * 8 + 2)
#define                                 INT0PPS2_bit        _BIT_ACCESS(INT0PPS,2)
// INT0PPS<INT0PPS3>
extern volatile __bit                   INT0PPS3            __at(0x1A93);	// @ (0x352 * 8 + 3)
#define                                 INT0PPS3_bit        _BIT_ACCESS(INT0PPS,3)
// INT0PPS<INT0PPS4>
extern volatile __bit                   INT0PPS4            __at(0x1A94);	// @ (0x352 * 8 + 4)
#define                                 INT0PPS4_bit        _BIT_ACCESS(INT0PPS,4)
// INTCON0<INT1EDG>
extern volatile __bit                   INT1EDG             __at(0x2309);	// @ (0x461 * 8 + 1)
#define                                 INT1EDG_bit         _BIT_ACCESS(INTCON0,1)
// PIE0<INT1IE>
extern volatile __bit                   INT1IE              __at(0x239A);	// @ (0x473 * 8 + 2)
#define                                 INT1IE_bit          _BIT_ACCESS(PIE0,2)
// PIR0<INT1IF>
extern volatile __bit                   INT1IF              __at(0x234A);	// @ (0x469 * 8 + 2)
#define                                 INT1IF_bit          _BIT_ACCESS(PIR0,2)
// IPR0<INT1IP>
extern volatile __bit                   INT1IP              __at(0x23EA);	// @ (0x47D * 8 + 2)
#define                                 INT1IP_bit          _BIT_ACCESS(IPR0,2)
// INT1PPS<INT1PPS0>
extern volatile __bit                   INT1PPS0            __at(0x1A98);	// @ (0x353 * 8 + 0)
#define                                 INT1PPS0_bit        _BIT_ACCESS(INT1PPS,0)
// INT1PPS<INT1PPS1>
extern volatile __bit                   INT1PPS1            __at(0x1A99);	// @ (0x353 * 8 + 1)
#define                                 INT1PPS1_bit        _BIT_ACCESS(INT1PPS,1)
// INT1PPS<INT1PPS2>
extern volatile __bit                   INT1PPS2            __at(0x1A9A);	// @ (0x353 * 8 + 2)
#define                                 INT1PPS2_bit        _BIT_ACCESS(INT1PPS,2)
// INT1PPS<INT1PPS3>
extern volatile __bit                   INT1PPS3            __at(0x1A9B);	// @ (0x353 * 8 + 3)
#define                                 INT1PPS3_bit        _BIT_ACCESS(INT1PPS,3)
// INT1PPS<INT1PPS4>
extern volatile __bit                   INT1PPS4            __at(0x1A9C);	// @ (0x353 * 8 + 4)
#define                                 INT1PPS4_bit        _BIT_ACCESS(INT1PPS,4)
// INTCON0<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x230A);	// @ (0x461 * 8 + 2)
#define                                 INT2EDG_bit         _BIT_ACCESS(INTCON0,2)
// PIE0<INT2IE>
extern volatile __bit                   INT2IE              __at(0x239B);	// @ (0x473 * 8 + 3)
#define                                 INT2IE_bit          _BIT_ACCESS(PIE0,3)
// PIR0<INT2IF>
extern volatile __bit                   INT2IF              __at(0x234B);	// @ (0x469 * 8 + 3)
#define                                 INT2IF_bit          _BIT_ACCESS(PIR0,3)
// IPR0<INT2IP>
extern volatile __bit                   INT2IP              __at(0x23EB);	// @ (0x47D * 8 + 3)
#define                                 INT2IP_bit          _BIT_ACCESS(IPR0,3)
// INT2PPS<INT2PPS0>
extern volatile __bit                   INT2PPS0            __at(0x1AA0);	// @ (0x354 * 8 + 0)
#define                                 INT2PPS0_bit        _BIT_ACCESS(INT2PPS,0)
// INT2PPS<INT2PPS1>
extern volatile __bit                   INT2PPS1            __at(0x1AA1);	// @ (0x354 * 8 + 1)
#define                                 INT2PPS1_bit        _BIT_ACCESS(INT2PPS,1)
// INT2PPS<INT2PPS2>
extern volatile __bit                   INT2PPS2            __at(0x1AA2);	// @ (0x354 * 8 + 2)
#define                                 INT2PPS2_bit        _BIT_ACCESS(INT2PPS,2)
// INT2PPS<INT2PPS3>
extern volatile __bit                   INT2PPS3            __at(0x1AA3);	// @ (0x354 * 8 + 3)
#define                                 INT2PPS3_bit        _BIT_ACCESS(INT2PPS,3)
// INT2PPS<INT2PPS4>
extern volatile __bit                   INT2PPS4            __at(0x1AA4);	// @ (0x354 * 8 + 4)
#define                                 INT2PPS4_bit        _BIT_ACCESS(INT2PPS,4)
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x1011);	// @ (0x202 * 8 + 1)
#define                                 INTH_bit            _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<INTL>
