garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
#define                                 PID6_bit            _BIT_ACCESS(I3C1PID0,6)
// I3C1PID0<PID7>
extern volatile __bit                   PID7                __at(0x517);	// @ (0xA2 * 8 + 7)
#define                                 PID7_bit            _BIT_ACCESS(I3C1PID0,7)
// I3C1PID1<PID8>
extern volatile __bit                   PID8                __at(0x518);	// @ (0xA3 * 8 + 0)
#define                                 PID8_bit            _BIT_ACCESS(I3C1PID1,0)
// I3C1PID1<PID9>
extern volatile __bit                   PID9                __at(0x519);	// @ (0xA3 * 8 + 1)
#define                                 PID9_bit            _BIT_ACCESS(I3C1PID1,1)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x348);	// @ (0x69 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x349);	// @ (0x69 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x34A);	// @ (0x69 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x34B);	// @ (0x69 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// CRCCON1<PLEN4>
extern volatile __bit                   PLEN4               __at(0x34C);	// @ (0x69 * 8 + 4)
#define                                 PLEN4_bit           _BIT_ACCESS(CRCCON1,4)
// OSCEN<PLLEN>
extern volatile __bit                   PLLEN               __at(0x3F0);	// @ (0x7E * 8 + 0)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCEN,0)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x3E8);	// @ (0x7D * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// VREGCON<PMSYS0>
extern volatile __bit                   PMSYS0              __at(0x3CC);	// @ (0x79 * 8 + 4)
#define                                 PMSYS0_bit          _BIT_ACCESS(VREGCON,4)
// VREGCON<PMSYS1>
extern volatile __bit                   PMSYS1              __at(0x3CD);	// @ (0x79 * 8 + 5)
#define                                 PMSYS1_bit          _BIT_ACCESS(VREGCON,5)
// CLCnPOL<POL>
extern volatile __bit                   POL                 __at(0xD37);	// @ (0x1A6 * 8 + 7)
#define                                 POL_bit             _BIT_ACCESS(CLCnPOL,7)
// CWG1CON1<POLA>
extern volatile __bit                   POLA                __at(0xCF0);	// @ (0x19E * 8 + 0)
#define                                 POLA_bit            _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<POLB>
extern volatile __bit                   POLB                __at(0xCF1);	// @ (0x19E * 8 + 1)
#define                                 POLB_bit            _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<POLC>
extern volatile __bit                   POLC                __at(0xCF2);	// @ (0x19E * 8 + 2)
#define                                 POLC_bit            _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<POLD>
extern volatile __bit                   POLD                __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 POLD_bit            _BIT_ACCESS(CWG1CON1,3)
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(PCON0,1)
// PMD1<PORTWMD>
extern volatile __bit                   PORTWMD             __at(0x1809);	// @ (0x301 * 8 + 1)
#define                                 PORTWMD_bit         _BIT_ACCESS(PMD1,1)
// PCON1<PORVDDIO2>
extern volatile __bit                   PORVDDIO2           __at(0x278B);	// @ (0x4F1 * 8 + 3)
#define                                 PORVDDIO2_bit       _BIT_ACCESS(PCON1,3)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x1187);	// @ (0x230 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x1A88);	// @ (0x351 * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0x1168);	// @ (0x22D * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0x1169);	// @ (0x22D * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0x1172);	// @ (0x22E * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0x1173);	// @ (0x22E * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0x1174);	// @ (0x22E * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0x116A);	// @ (0x22D * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0x116B);	// @ (0x22D * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0x116C);	// @ (0x22D * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0x116D);	// @ (0x22D * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0x116E);	// @ (0x22D * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0x116F);	// @ (0x22D * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0x1170);	// @ (0x22E * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0x1171);	// @ (0x22E * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0x11A0);	// @ (0x234 * 8 + 0)
#define                                 PREF0_bit           _BIT_ACCESS(ADREF,0)
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0x11A1);	// @ (0x234 * 8 + 1)
#define                                 PREF1_bit           _BIT_ACCESS(ADREF,1)
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0x1120);	// @ (0x224 * 8 + 0)
#define                                 PREV0_bit           _BIT_ACCESS(ADPREVL,0)
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0x1121);	// @ (0x224 * 8 + 1)
#define                                 PREV1_bit           _BIT_ACCESS(ADPREVL,1)
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0x112A);	// @ (0x225 * 8 + 2)
#define                                 PREV10_bit          _BIT_ACCESS(ADPREVH,2)
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0x112B);	// @ (0x225 * 8 + 3)
#define                                 PREV11_bit          _BIT_ACCESS(ADPREVH,3)
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0x112C);	// @ (0x225 * 8 + 4)
#define                                 PREV12_bit          _BIT_ACCESS(ADPREVH,4)
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0x112D);	// @ (0x225 * 8 + 5)
#define                                 PREV13_bit          _BIT_ACCESS(ADPREVH,5)
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0x112E);	// @ (0x225 * 8 + 6)
#define                                 PREV14_bit          _BIT_ACCESS(ADPREVH,6)
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0x112F);	// @ (0x225 * 8 + 7)
#define                                 PREV15_bit          _BIT_ACCESS(ADPREVH,7)
// ADPREVL<PREV2>
extern volatile __bit                   PREV2               __at(0x1122);	// @ (0x224 * 8 + 2)
#define                                 PREV2_bit           _BIT_ACCESS(ADPREVL,2)
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0x1123);	// @ (0x224 * 8 + 3)
#define                                 PREV3_bit           _BIT_ACCESS(ADPREVL,3)
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0x1124);	// @ (0x224 * 8 + 4)
#define                                 PREV4_bit           _BIT_ACCESS(ADPREVL,4)
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0x1125);	// @ (0x224 * 8 + 5)
#define                                 PREV5_bit           _BIT_ACCESS(ADPREVL,5)
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0x1126);	// @ (0x224 * 8 + 6)
#define                                 PREV6_bit           _BIT_ACCESS(ADPREVL,6)
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0x1127);	// @ (0x224 * 8 + 7)
#define                                 PREV7_bit           _BIT_ACCESS(ADPREVL,7)
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0x1128);	// @ (0x225 * 8 + 0)
#define                                 PREV8_bit           _BIT_ACCESS(ADPREVH,0)
// ADPREVH<PREV9>
extern volatile __bit                   PREV9               __at(0x1129);	// @ (0x225 * 8 + 1)
#define                                 PREV9_bit           _BIT_ACCESS(ADPREVH,1)
// PRLOCK<PRLOCKED>
extern volatile __bit                   PRLOCKED            __at(0x1C0);	// @ (0x38 * 8 + 0)
#define                                 PRLOCKED_bit        _BIT_ACCESS(PRLOCK,0)
// WDTPSL<PSCNT0>
extern volatile __bit                   PSCNT0              __at(0x3B0);	// @ (0x76 * 8 + 0)
#define                                 PSCNT0_bit          _BIT_ACCESS(WDTPSL,0)
// WDTPSL<PSCNT1>
extern volatile __bit                   PSCNT1              __at(0x3B1);	// @ (0x76 * 8 + 1)
#define                                 PSCNT1_bit          _BIT_ACCESS(WDTPSL,1)
// WDTPSH<PSCNT10>
extern volatile __bit                   PSCNT10             __at(0x3BA);	// @ (0x77 * 8 + 2)
#define                                 PSCNT10_bit         _BIT_ACCESS(WDTPSH,2)
// WDTPSH<PSCNT11>
extern volatile __bit                   PSCNT11             __at(0x3BB);	// @ (0x77 * 8 + 3)
#define                                 PSCNT11_bit         _BIT_ACCESS(WDTPSH,3)
// WDTPSH<PSCNT12>
extern volatile __bit                   PSCNT12             __at(0x3BC);	// @ (0x77 * 8 + 4)
#define                                 PSCNT12_bit         _BIT_ACCESS(WDTPSH,4)
// WDTPSH<PSCNT13>
extern volatile __bit                   PSCNT13             __at(0x3BD);	// @ (0x77 * 8 + 5)
#define                                 PSCNT13_bit         _BIT_ACCESS(WDTPSH,5)
// WDTPSH<PSCNT14>
extern volatile __bit                   PSCNT14             __at(0x3BE);	// @ (0x77 * 8 + 6)
#define                                 PSCNT14_bit         _BIT_ACCESS(WDTPSH,6)
// WDTPSH<PSCNT15>
extern volatile __bit                   PSCNT15             __at(0x3BF);	// @ (0x77 * 8 + 7)
#define                                 PSCNT15_bit         _BIT_ACCESS(WDTPSH,7)
// WDTTMR<PSCNT16>
extern volatile __bit                   PSCNT16             __at(0x3C0);	// @ (0x78 * 8 + 0)
#define                                 PSCNT16_bit         _BIT_ACCESS(WDTTMR,0)
// WDTTMR<PSCNT17>
extern volatile __bit                   PSCNT17             __at(0x3C1);	// @ (0x78 * 8 + 1)
#define                                 PSCNT17_bit         _BIT_ACCESS(WDTTMR,1)
// WDTPSL<PSCNT2>
extern volatile __bit                   PSCNT2              __at(0x3B2);	// @ (0x76 * 8 + 2)
#define                                 PSCNT2_bit          _BIT_ACCESS(WDTPSL,2)
// WDTPSL<PSCNT3>
extern volatile __bit                   PSCNT3              __at(0x3B3);	// @ (0x76 * 8 + 3)
#define                                 PSCNT3_bit          _BIT_ACCESS(WDTPSL,3)
// WDTPSL<PSCNT4>
extern volatile __bit                   PSCNT4              __at(0x3B4);	// @ (0x76 * 8 + 4)
#define                                 PSCNT4_bit          _BIT_ACCESS(WDTPSL,4)
// WDTPSL<PSCNT5>
extern volatile __bit                   PSCNT5              __at(0x3B5);	// @ (0x76 * 8 + 5)
#define                                 PSCNT5_bit          _BIT_ACCESS(WDTPSL,5)
// WDTPSL<PSCNT6>
extern volatile __bit                   PSCNT6              __at(0x3B6);	// @ (0x76 * 8 + 6)
#define                                 PSCNT6_bit          _BIT_ACCESS(WDTPSL,6)
// WDTPSL<PSCNT7>
extern volatile __bit                   PSCNT7              __at(0x3B7);	// @ (0x76 * 8 + 7)
#define                                 PSCNT7_bit          _BIT_ACCESS(WDTPSL,7)
// WDTPSH<PSCNT8>
extern volatile __bit                   PSCNT8              __at(0x3B8);	// @ (0x77 * 8 + 0)
#define                                 PSCNT8_bit          _BIT_ACCESS(WDTPSH,0)
// WDTPSH<PSCNT9>
extern volatile __bit                   PSCNT9              __at(0x3B9);	// @ (0x77 * 8 + 1)
#define                                 PSCNT9_bit          _BIT_ACCESS(WDTPSH,1)
// ADCON2<PSIS>
extern volatile __bit                   PSIS                __at(0x118F);	// @ (0x231 * 8 + 7)
#define                                 PSIS_bit            _BIT_ACCESS(ADCON2,7)
// PORTWDF<PWDF0>
extern volatile __bit                   PWDF0               __at(0x2520);	// @ (0x4A4 * 8 + 0)
#define                                 PWDF0_bit           _BIT_ACCESS(PORTWDF,0)
// PORTWDF<PWDF1>
extern volatile __bit                   PWDF1               __at(0x2521);	// @ (0x4A4 * 8 + 1)
#define                                 PWDF1_bit           _BIT_ACCESS(PORTWDF,1)
// PORTWDF<PWDF2>
extern volatile __bit                   PWDF2               __at(0x2522);	// @ (0x4A4 * 8 + 2)
#define                                 PWDF2_bit           _BIT_ACCESS(PORTWDF,2)
// PORTWDF<PWDF3>
extern volatile __bit                   PWDF3               __at(0x2523);	// @ (0x4A4 * 8 + 3)
#define                                 PWDF3_bit           _BIT_ACCESS(PORTWDF,3)
// PORTWDF<PWDF4>
extern volatile __bit                   PWDF4               __at(0x2524);	// @ (0x4A4 * 8 + 4)
#define                                 PWDF4_bit           _BIT_ACCESS(PORTWDF,4)
// PORTWDF<PWDF5>
extern volatile __bit                   PWDF5               __at(0x2525);	// @ (0x4A4 * 8 + 5)
#define                                 PWDF5_bit           _BIT_ACCESS(PORTWDF,5)
// PORTWDF<PWDF6>
extern volatile __bit                   PWDF6               __at(0x2526);	// @ (0x4A4 * 8 + 6)
#define                                 PWDF6_bit           _BIT_ACCESS(PORTWDF,6)
// PORTWDF<PWDF7>
extern volatile __bit                   PWDF7               __at(0x2527);	// @ (0x4A4 * 8 + 7)
#define                                 PWDF7_bit           _BIT_ACCESS(PORTWDF,7)
// PWM1ERSPPS<PWM1ERSPPS0>
extern volatile __bit                   PWM1ERSPPS0         __at(0x1C30);	// @ (0x386 * 8 + 0)
#define                                 PWM1ERSPPS0_bit     _BIT_ACCESS(PWM1ERSPPS,0)
// PWM1ERSPPS<PWM1ERSPPS1>
extern volatile __bit                   PWM1ERSPPS1         __at(0x1C31);	// @ (0x386 * 8 + 1)
#define                                 PWM1ERSPPS1_bit     _BIT_ACCESS(PWM1ERSPPS,1)
// PWM1ERSPPS<PWM1ERSPPS2>
extern volatile __bit                   PWM1ERSPPS2         __at(0x1C32);	// @ (0x386 * 8 + 2)
#define                                 PWM1ERSPPS2_bit     _BIT_ACCESS(PWM1ERSPPS,2)
// PWM1ERSPPS<PWM1ERSPPS3>
extern volatile __bit                   PWM1ERSPPS3         __at(0x1C33);	// @ (0x386 * 8 + 3)
#define                                 PWM1ERSPPS3_bit     _BIT_ACCESS(PWM1ERSPPS,3)
// PWM1ERSPPS<PWM1ERSPPS4>
extern volatile __bit                   PWM1ERSPPS4         __at(0x1C34);	// @ (0x386 * 8 + 4)
#define                                 PWM1ERSPPS4_bit     _BIT_ACCESS(PWM1ERSPPS,4)
// PIE4<PWM1IE>
extern volatile __bit                   PWM1IE              __at(0x23BF);	// @ (0x477 * 8 + 7)
#define                                 PWM1IE_bit          _BIT_ACCESS(PIE4,7)
// PIR4<PWM1IF>
extern volatile __bit                   PWM1IF              __at(0x236F);	// @ (0x46D * 8 + 7)
#define                                 PWM1IF_bit          _BIT_ACCESS(PIR4,7)
// IPR4<PWM1IP>
extern volatile __bit                   PWM1IP              __at(0x240F);	// @ (0x481 * 8 + 7)
#define                                 PWM1IP_bit          _BIT_ACCESS(IPR4,7)
// PMD2<PWM1MD>
extern volatile __bit                   PWM1MD              __at(0x1814);	// @ (0x302 * 8 + 4)
#define                                 PWM1MD_bit          _BIT_ACCESS(PMD2,4)
// PIE4<PWM1PIE>
extern volatile __bit                   PWM1PIE             __at(0x23BE);	// @ (0x477 * 8 + 6)
#define                                 PWM1PIE_bit         _BIT_ACCESS(PIE4,6)
// PIR4<PWM1PIF>
extern volatile __bit                   PWM1PIF             __at(0x236E);	// @ (0x46D * 8 + 6)
#define                                 PWM1PIF_bit         _BIT_ACCESS(PIR4,6)
// IPR4<PWM1PIP>
extern volatile __bit                   PWM1PIP             __at(0x240E);	// @ (0x481 * 8 + 6)
#define                                 PWM1PIP_bit         _BIT_ACCESS(IPR4,6)
// PWM2ERSPPS<PWM2ERSPPS0>
extern volatile __bit                   PWM2ERSPPS0         __at(0x1C38);	// @ (0x387 * 8 + 0)
#define                                 PWM2ERSPPS0_bit     _BIT_ACCESS(PWM2ERSPPS,0)
// PWM2ERSPPS<PWM2ERSPPS1>
extern volatile __bit                   PWM2ERSPPS1         __at(0x1C39);	// @ (0x387 * 8 + 1)
#define                                 PWM2ERSPPS1_bit     _BIT_ACCESS(PWM2ERSPPS,1)
// PWM2ERSPPS<PWM2ERSPPS2>
extern volatile __bit                   PWM2ERSPPS2         __at(0x1C3A);	// @ (0x387 * 8 + 2)
#define                                 PWM2ERSPPS2_bit     _BIT_ACCESS(PWM2ERSPPS,2)
// PWM2ERSPPS<PWM2ERSPPS3>
extern volatile __bit                   PWM2ERSPPS3         __at(0x1C3B);	// @ (0x387 * 8 + 3)
#define                                 PWM2ERSPPS3_bit     _BIT_ACCESS(PWM2ERSPPS,3)
// PWM2ERSPPS<PWM2ERSPPS4>
extern volatile __bit                   PWM2ERSPPS4         __at(0x1C3C);	// @ (0x387 * 8 + 4)
#define                                 PWM2ERSPPS4_bit     _BIT_ACCESS(PWM2ERSPPS,4)
// PIE5<PWM2IE>
extern volatile __bit                   PWM2IE              __at(0x23C1);	// @ (0x478 * 8 + 1)
#define                                 PWM2IE_bit          _BIT_ACCESS(PIE5,1)
// PIR5<PWM2IF>
extern volatile __bit                   PWM2IF              __at(0x2371);	// @ (0x46E * 8 + 1)
#define                                 PWM2IF_bit          _BIT_ACCESS(PIR5,1)
// IPR5<PWM2IP>
extern volatile __bit                   PWM2IP              __at(0x2411);	// @ (0x482 * 8 + 1)
#define                                 PWM2IP_bit          _BIT_ACCESS(IPR5,1)
// PMD2<PWM2MD>
extern volatile __bit                   PWM2MD              __at(0x1815);	// @ (0x302 * 8 + 5)
#define                                 PWM2MD_bit          _BIT_ACCESS(PMD2,5)
// PIE5<PWM2PIE>
extern volatile __bit                   PWM2PIE             __at(0x23C0);	// @ (0x478 * 8 + 0)
#define                                 PWM2PIE_bit         _BIT_ACCESS(PIE5,0)
// PIR5<PWM2PIF>
extern volatile __bit                   PWM2PIF             __at(0x2370);	// @ (0x46E * 8 + 0)
#define                                 PWM2PIF_bit         _BIT_ACCESS(PIR5,0)
// IPR5<PWM2PIP>
extern volatile __bit                   PWM2PIP             __at(0x2410);	// @ (0x482 * 8 + 0)
#define                                 PWM2PIP_bit         _BIT_ACCESS(IPR5,0)
// PWMIN0PPS<PWMIN0PPS0>
extern volatile __bit                   PWMIN0PPS0          __at(0x1C20);	// @ (0x384 * 8 + 0)
#define                                 PWMIN0PPS0_bit      _BIT_ACCESS(PWMIN0PPS,0)
// PWMIN0PPS<PWMIN0PPS1>
extern volatile __bit                   PWMIN0PPS1          __at(0x1C21);	// @ (0x384 * 8 + 1)
#define                                 PWMIN0PPS1_bit      _BIT_ACCESS(PWMIN0PPS,1)
// PWMIN0PPS<PWMIN0PPS2>
extern volatile __bit                   PWMIN0PPS2          __at(0x1C22);	// @ (0x384 * 8 + 2)
#define                                 PWMIN0PPS2_bit      _BIT_ACCESS(PWMIN0PPS,2)
// PWMIN0PPS<PWMIN0PPS3>
extern volatile __bit                   PWMIN0PPS3          __at(0x1C23);	// @ (0x384 * 8 + 3)
#define                                 PWMIN0PPS3_bit      _BIT_ACCESS(PWMIN0PPS,3)
// PWMIN0PPS<PWMIN0PPS4>
extern volatile __bit                   PWMIN0PPS4          __at(0x1C24);	// @ (0x384 * 8 + 4)
#define                                 PWMIN0PPS4_bit      _BIT_ACCESS(PWMIN0PPS,4)
// PWMIN1PPS<PWMIN1PPS0>
extern volatile __bit                   PWMIN1PPS0          __at(0x1C28);	// @ (0x385 * 8 + 0)
#define                                 PWMIN1PPS0_bit      _BIT_ACCESS(PWMIN1PPS,0)
// PWMIN1PPS<PWMIN1PPS1>
extern volatile __bit                   PWMIN1PPS1          __at(0x1C29);	// @ (0x385 * 8 + 1)
#define                                 PWMIN1PPS1_bit      _BIT_ACCESS(PWMIN1PPS,1)
// PWMIN1PPS<PWMIN1PPS2>
extern volatile __bit                   PWMIN1PPS2          __at(0x1C2A);	// @ (0x385 * 8 + 2)
#define                                 PWMIN1PPS2_bit      _BIT_ACCESS(PWMIN1PPS,2)
// PWMIN1PPS<PWMIN1PPS3>
extern volatile __bit                   PWMIN1PPS3          __at(0x1C2B);	// @ (0x385 * 8 + 3)
#define                                 PWMIN1PPS3_bit      _BIT_ACCESS(PWMIN1PPS,3)
// PWMIN1PPS<PWMIN1PPS4>
extern volatile __bit                   PWMIN1PPS4          __at(0x1C2C);	// @ (0x385 * 8 + 4)
#define                                 PWMIN1PPS4_bit      _BIT_ACCESS(PWMIN1PPS,4)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x2438);	// @ (0x487 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// RA0PPS<RA0PPS0>
extern volatile __bit                   RA0PPS0             __at(0x18C8);	// @ (0x319 * 8 + 0)
#define                                 RA0PPS0_bit         _BIT_ACCESS(RA0PPS,0)
// RA0PPS<RA0PPS1>
extern volatile __bit                   RA0PPS1             __at(0x18C9);	// @ (0x319 * 8 + 1)
#define                                 RA0PPS1_bit         _BIT_ACCESS(RA0PPS,1)
// RA0PPS<RA0PPS2>
extern volatile __bit                   RA0PPS2             __at(0x18CA);	// @ (0x319 * 8 + 2)
#define                                 RA0PPS2_bit         _BIT_ACCESS(RA0PPS,2)
// RA0PPS<RA0PPS3>
extern volatile __bit                   RA0PPS3             __at(0x18CB);	// @ (0x319 * 8 + 3)
#define                                 RA0PPS3_bit         _BIT_ACCESS(RA0PPS,3)
// RA0PPS<RA0PPS4>
extern volatile __bit                   RA0PPS4             __at(0x18CC);	// @ (0x319 * 8 + 4)
#define                                 RA0PPS4_bit         _BIT_ACCESS(RA0PPS,4)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x2439);	// @ (0x487 * 8 + 1)
