garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
extern volatile __bit                   SCANHADR0           __at(0x370);	// @ (0x6E * 8 + 0)
#define                                 SCANHADR0_bit       _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<SCANHADR1>
extern volatile __bit                   SCANHADR1           __at(0x371);	// @ (0x6E * 8 + 1)
#define                                 SCANHADR1_bit       _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<SCANHADR10>
extern volatile __bit                   SCANHADR10          __at(0x37A);	// @ (0x6F * 8 + 2)
#define                                 SCANHADR10_bit      _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<SCANHADR11>
extern volatile __bit                   SCANHADR11          __at(0x37B);	// @ (0x6F * 8 + 3)
#define                                 SCANHADR11_bit      _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x37C);	// @ (0x6F * 8 + 4)
#define                                 SCANHADR12_bit      _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x37D);	// @ (0x6F * 8 + 5)
#define                                 SCANHADR13_bit      _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x37E);	// @ (0x6F * 8 + 6)
#define                                 SCANHADR14_bit      _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<SCANHADR15>
extern volatile __bit                   SCANHADR15          __at(0x37F);	// @ (0x6F * 8 + 7)
#define                                 SCANHADR15_bit      _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<SCANHADR16>
extern volatile __bit                   SCANHADR16          __at(0x380);	// @ (0x70 * 8 + 0)
#define                                 SCANHADR16_bit      _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<SCANHADR17>
extern volatile __bit                   SCANHADR17          __at(0x381);	// @ (0x70 * 8 + 1)
#define                                 SCANHADR17_bit      _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<SCANHADR18>
extern volatile __bit                   SCANHADR18          __at(0x382);	// @ (0x70 * 8 + 2)
#define                                 SCANHADR18_bit      _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<SCANHADR19>
extern volatile __bit                   SCANHADR19          __at(0x383);	// @ (0x70 * 8 + 3)
#define                                 SCANHADR19_bit      _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<SCANHADR2>
extern volatile __bit                   SCANHADR2           __at(0x372);	// @ (0x6E * 8 + 2)
#define                                 SCANHADR2_bit       _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<SCANHADR20>
extern volatile __bit                   SCANHADR20          __at(0x384);	// @ (0x70 * 8 + 4)
#define                                 SCANHADR20_bit      _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<SCANHADR21>
extern volatile __bit                   SCANHADR21          __at(0x385);	// @ (0x70 * 8 + 5)
#define                                 SCANHADR21_bit      _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<SCANHADR3>
extern volatile __bit                   SCANHADR3           __at(0x373);	// @ (0x6E * 8 + 3)
#define                                 SCANHADR3_bit       _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<SCANHADR4>
extern volatile __bit                   SCANHADR4           __at(0x374);	// @ (0x6E * 8 + 4)
#define                                 SCANHADR4_bit       _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<SCANHADR5>
extern volatile __bit                   SCANHADR5           __at(0x375);	// @ (0x6E * 8 + 5)
#define                                 SCANHADR5_bit       _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<SCANHADR6>
extern volatile __bit                   SCANHADR6           __at(0x376);	// @ (0x6E * 8 + 6)
#define                                 SCANHADR6_bit       _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<SCANHADR7>
extern volatile __bit                   SCANHADR7           __at(0x377);	// @ (0x6E * 8 + 7)
#define                                 SCANHADR7_bit       _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<SCANHADR8>
extern volatile __bit                   SCANHADR8           __at(0x378);	// @ (0x6F * 8 + 0)
#define                                 SCANHADR8_bit       _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<SCANHADR9>
extern volatile __bit                   SCANHADR9           __at(0x379);	// @ (0x6F * 8 + 1)
#define                                 SCANHADR9_bit       _BIT_ACCESS(SCANHADRH,1)
// PIE2<SCANIE>
extern volatile __bit                   SCANIE              __at(0x23AE);	// @ (0x475 * 8 + 6)
#define                                 SCANIE_bit          _BIT_ACCESS(PIE2,6)
// PIR2<SCANIF>
extern volatile __bit                   SCANIF              __at(0x235E);	// @ (0x46B * 8 + 6)
#define                                 SCANIF_bit          _BIT_ACCESS(PIR2,6)
// IPR2<SCANIP>
extern volatile __bit                   SCANIP              __at(0x23FE);	// @ (0x47F * 8 + 6)
#define                                 SCANIP_bit          _BIT_ACCESS(IPR2,6)
// SCANLADRL<SCANLADR0>
extern volatile __bit                   SCANLADR0           __at(0x358);	// @ (0x6B * 8 + 0)
#define                                 SCANLADR0_bit       _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<SCANLADR1>
extern volatile __bit                   SCANLADR1           __at(0x359);	// @ (0x6B * 8 + 1)
#define                                 SCANLADR1_bit       _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<SCANLADR10>
extern volatile __bit                   SCANLADR10          __at(0x362);	// @ (0x6C * 8 + 2)
#define                                 SCANLADR10_bit      _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<SCANLADR11>
extern volatile __bit                   SCANLADR11          __at(0x363);	// @ (0x6C * 8 + 3)
#define                                 SCANLADR11_bit      _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<SCANLADR12>
extern volatile __bit                   SCANLADR12          __at(0x364);	// @ (0x6C * 8 + 4)
#define                                 SCANLADR12_bit      _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<SCANLADR13>
extern volatile __bit                   SCANLADR13          __at(0x365);	// @ (0x6C * 8 + 5)
#define                                 SCANLADR13_bit      _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<SCANLADR14>
extern volatile __bit                   SCANLADR14          __at(0x366);	// @ (0x6C * 8 + 6)
#define                                 SCANLADR14_bit      _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<SCANLADR15>
extern volatile __bit                   SCANLADR15          __at(0x367);	// @ (0x6C * 8 + 7)
#define                                 SCANLADR15_bit      _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<SCANLADR16>
extern volatile __bit                   SCANLADR16          __at(0x368);	// @ (0x6D * 8 + 0)
#define                                 SCANLADR16_bit      _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<SCANLADR17>
extern volatile __bit                   SCANLADR17          __at(0x369);	// @ (0x6D * 8 + 1)
#define                                 SCANLADR17_bit      _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<SCANLADR18>
extern volatile __bit                   SCANLADR18          __at(0x36A);	// @ (0x6D * 8 + 2)
#define                                 SCANLADR18_bit      _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<SCANLADR19>
extern volatile __bit                   SCANLADR19          __at(0x36B);	// @ (0x6D * 8 + 3)
#define                                 SCANLADR19_bit      _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<SCANLADR2>
extern volatile __bit                   SCANLADR2           __at(0x35A);	// @ (0x6B * 8 + 2)
#define                                 SCANLADR2_bit       _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<SCANLADR20>
extern volatile __bit                   SCANLADR20          __at(0x36C);	// @ (0x6D * 8 + 4)
#define                                 SCANLADR20_bit      _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<SCANLADR21>
extern volatile __bit                   SCANLADR21          __at(0x36D);	// @ (0x6D * 8 + 5)
#define                                 SCANLADR21_bit      _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<SCANLADR3>
extern volatile __bit                   SCANLADR3           __at(0x35B);	// @ (0x6B * 8 + 3)
#define                                 SCANLADR3_bit       _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<SCANLADR4>
extern volatile __bit                   SCANLADR4           __at(0x35C);	// @ (0x6B * 8 + 4)
#define                                 SCANLADR4_bit       _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<SCANLADR5>
extern volatile __bit                   SCANLADR5           __at(0x35D);	// @ (0x6B * 8 + 5)
#define                                 SCANLADR5_bit       _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<SCANLADR6>
extern volatile __bit                   SCANLADR6           __at(0x35E);	// @ (0x6B * 8 + 6)
#define                                 SCANLADR6_bit       _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<SCANLADR7>
extern volatile __bit                   SCANLADR7           __at(0x35F);	// @ (0x6B * 8 + 7)
#define                                 SCANLADR7_bit       _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<SCANLADR8>
extern volatile __bit                   SCANLADR8           __at(0x360);	// @ (0x6C * 8 + 0)
#define                                 SCANLADR8_bit       _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<SCANLADR9>
extern volatile __bit                   SCANLADR9           __at(0x361);	// @ (0x6C * 8 + 1)
#define                                 SCANLADR9_bit       _BIT_ACCESS(SCANLADRH,1)
// PMD0<SCANMD>
extern volatile __bit                   SCANMD              __at(0x1806);	// @ (0x300 * 8 + 6)
#define                                 SCANMD_bit          _BIT_ACCESS(PMD0,6)
// SCANPR<SCANPR0>
extern volatile __bit                   SCANPR0             __at(0x1F8);	// @ (0x3F * 8 + 0)
#define                                 SCANPR0_bit         _BIT_ACCESS(SCANPR,0)
// SCANPR<SCANPR1>
extern volatile __bit                   SCANPR1             __at(0x1F9);	// @ (0x3F * 8 + 1)
#define                                 SCANPR1_bit         _BIT_ACCESS(SCANPR,1)
// SCANPR<SCANPR2>
extern volatile __bit                   SCANPR2             __at(0x1FA);	// @ (0x3F * 8 + 2)
#define                                 SCANPR2_bit         _BIT_ACCESS(SCANPR,2)
// I3C1PIE0<SCCCIE>
extern volatile __bit                   SCCCIE              __at(0x470);	// @ (0x8E * 8 + 0)
#define                                 SCCCIE_bit          _BIT_ACCESS(I3C1PIE0,0)
// I3C1PIR0<SCCCIF>
extern volatile __bit                   SCCCIF              __at(0x450);	// @ (0x8A * 8 + 0)
#define                                 SCCCIF_bit          _BIT_ACCESS(I3C1PIR0,0)
// DMAnSCNTL<SCNT0>
extern volatile __bit                   SCNT0               __at(0x250);	// @ (0x4A * 8 + 0)
#define                                 SCNT0_bit           _BIT_ACCESS(DMAnSCNTL,0)
// DMAnSCNTL<SCNT1>
extern volatile __bit                   SCNT1               __at(0x251);	// @ (0x4A * 8 + 1)
#define                                 SCNT1_bit           _BIT_ACCESS(DMAnSCNTL,1)
// DMAnSCNTH<SCNT10>
extern volatile __bit                   SCNT10              __at(0x25A);	// @ (0x4B * 8 + 2)
#define                                 SCNT10_bit          _BIT_ACCESS(DMAnSCNTH,2)
// DMAnSCNTH<SCNT11>
extern volatile __bit                   SCNT11              __at(0x25B);	// @ (0x4B * 8 + 3)
#define                                 SCNT11_bit          _BIT_ACCESS(DMAnSCNTH,3)
// DMAnSCNTL<SCNT2>
extern volatile __bit                   SCNT2               __at(0x252);	// @ (0x4A * 8 + 2)
#define                                 SCNT2_bit           _BIT_ACCESS(DMAnSCNTL,2)
// DMAnSCNTL<SCNT3>
extern volatile __bit                   SCNT3               __at(0x253);	// @ (0x4A * 8 + 3)
#define                                 SCNT3_bit           _BIT_ACCESS(DMAnSCNTL,3)
// DMAnSCNTL<SCNT4>
extern volatile __bit                   SCNT4               __at(0x254);	// @ (0x4A * 8 + 4)
#define                                 SCNT4_bit           _BIT_ACCESS(DMAnSCNTL,4)
// DMAnSCNTL<SCNT5>
extern volatile __bit                   SCNT5               __at(0x255);	// @ (0x4A * 8 + 5)
#define                                 SCNT5_bit           _BIT_ACCESS(DMAnSCNTL,5)
// DMAnSCNTL<SCNT6>
extern volatile __bit                   SCNT6               __at(0x256);	// @ (0x4A * 8 + 6)
#define                                 SCNT6_bit           _BIT_ACCESS(DMAnSCNTL,6)
// DMAnSCNTL<SCNT7>
extern volatile __bit                   SCNT7               __at(0x257);	// @ (0x4A * 8 + 7)
#define                                 SCNT7_bit           _BIT_ACCESS(DMAnSCNTL,7)
// DMAnSCNTH<SCNT8>
extern volatile __bit                   SCNT8               __at(0x258);	// @ (0x4B * 8 + 0)
#define                                 SCNT8_bit           _BIT_ACCESS(DMAnSCNTH,0)
// DMAnSCNTH<SCNT9>
extern volatile __bit                   SCNT9               __at(0x259);	// @ (0x4B * 8 + 1)
#define                                 SCNT9_bit           _BIT_ACCESS(DMAnSCNTH,1)
// I2C1CON2<SDAHT0>
extern volatile __bit                   SDAHT0              __at(0xF42);	// @ (0x1E8 * 8 + 2)
#define                                 SDAHT0_bit          _BIT_ACCESS(I2C1CON2,2)
// I2C1CON2<SDAHT1>
extern volatile __bit                   SDAHT1              __at(0xF43);	// @ (0x1E8 * 8 + 3)
#define                                 SDAHT1_bit          _BIT_ACCESS(I2C1CON2,3)
// SPI1CON1<SDIP>
extern volatile __bit                   SDIP                __at(0xEE1);	// @ (0x1DC * 8 + 1)
#define                                 SDIP_bit            _BIT_ACCESS(SPI1CON1,1)
// SPI1CON1<SDOP>
extern volatile __bit                   SDOP                __at(0xEE0);	// @ (0x1DC * 8 + 0)
#define                                 SDOP_bit            _BIT_ACCESS(SPI1CON1,0)
// HLVDCON1<SEL0>
extern volatile __bit                   SEL0                __at(0x1018);	// @ (0x203 * 8 + 0)
#define                                 SEL0_bit            _BIT_ACCESS(HLVDCON1,0)
// HLVDCON1<SEL1>
extern volatile __bit                   SEL1                __at(0x1019);	// @ (0x203 * 8 + 1)
#define                                 SEL1_bit            _BIT_ACCESS(HLVDCON1,1)
// HLVDCON1<SEL2>
extern volatile __bit                   SEL2                __at(0x101A);	// @ (0x203 * 8 + 2)
#define                                 SEL2_bit            _BIT_ACCESS(HLVDCON1,2)
// HLVDCON1<SEL3>
extern volatile __bit                   SEL3                __at(0x101B);	// @ (0x203 * 8 + 3)
#define                                 SEL3_bit            _BIT_ACCESS(HLVDCON1,3)
// WDTCON0<SEN>
extern volatile __bit                   SEN                 __at(0x3A0);	// @ (0x74 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(WDTCON0,0)
// CRCCON0<SETUP0>
extern volatile __bit                   SETUP0              __at(0x342);	// @ (0x68 * 8 + 2)
#define                                 SETUP0_bit          _BIT_ACCESS(CRCCON0,2)
// CRCCON0<SETUP1>
extern volatile __bit                   SETUP1              __at(0x343);	// @ (0x68 * 8 + 3)
#define                                 SETUP1_bit          _BIT_ACCESS(CRCCON0,3)
// OSCSTAT<SFOR>
extern volatile __bit                   SFOR                __at(0x3E9);	// @ (0x7D * 8 + 1)
#define                                 SFOR_bit            _BIT_ACCESS(OSCSTAT,1)
// SCANCON0<SGO>
extern volatile __bit                   SGO                 __at(0x38D);	// @ (0x71 * 8 + 5)
#define                                 SGO_bit             _BIT_ACCESS(SCANCON0,5)
// SHADCON<SHADLO>
extern volatile __bit                   SHADLO              __at(0x1BB0);	// @ (0x376 * 8 + 0)
#define                                 SHADLO_bit          _BIT_ACCESS(SHADCON,0)
// CRCSHFTL<SHIFT0>
extern volatile __bit                   SHIFT0              __at(0x320);	// @ (0x64 * 8 + 0)
#define                                 SHIFT0_bit          _BIT_ACCESS(CRCSHFTL,0)
// CRCSHFTL<SHIFT1>
extern volatile __bit                   SHIFT1              __at(0x321);	// @ (0x64 * 8 + 1)
#define                                 SHIFT1_bit          _BIT_ACCESS(CRCSHFTL,1)
// CRCSHFTH<SHIFT10>
extern volatile __bit                   SHIFT10             __at(0x32A);	// @ (0x65 * 8 + 2)
#define                                 SHIFT10_bit         _BIT_ACCESS(CRCSHFTH,2)
// CRCSHFTH<SHIFT11>
extern volatile __bit                   SHIFT11             __at(0x32B);	// @ (0x65 * 8 + 3)
#define                                 SHIFT11_bit         _BIT_ACCESS(CRCSHFTH,3)
// CRCSHFTH<SHIFT12>
extern volatile __bit                   SHIFT12             __at(0x32C);	// @ (0x65 * 8 + 4)
#define                                 SHIFT12_bit         _BIT_ACCESS(CRCSHFTH,4)
// CRCSHFTH<SHIFT13>
extern volatile __bit                   SHIFT13             __at(0x32D);	// @ (0x65 * 8 + 5)
#define                                 SHIFT13_bit         _BIT_ACCESS(CRCSHFTH,5)
// CRCSHFTH<SHIFT14>
extern volatile __bit                   SHIFT14             __at(0x32E);	// @ (0x65 * 8 + 6)
#define                                 SHIFT14_bit         _BIT_ACCESS(CRCSHFTH,6)
// CRCSHFTH<SHIFT15>
extern volatile __bit                   SHIFT15             __at(0x32F);	// @ (0x65 * 8 + 7)
#define                                 SHIFT15_bit         _BIT_ACCESS(CRCSHFTH,7)
// CRCSHFTU<SHIFT16>
extern volatile __bit                   SHIFT16             __at(0x330);	// @ (0x66 * 8 + 0)
#define                                 SHIFT16_bit         _BIT_ACCESS(CRCSHFTU,0)
// CRCSHFTU<SHIFT17>
extern volatile __bit                   SHIFT17             __at(0x331);	// @ (0x66 * 8 + 1)
#define                                 SHIFT17_bit         _BIT_ACCESS(CRCSHFTU,1)
// CRCSHFTU<SHIFT18>
extern volatile __bit                   SHIFT18             __at(0x332);	// @ (0x66 * 8 + 2)
#define                                 SHIFT18_bit         _BIT_ACCESS(CRCSHFTU,2)
// CRCSHFTU<SHIFT19>
extern volatile __bit                   SHIFT19             __at(0x333);	// @ (0x66 * 8 + 3)
#define                                 SHIFT19_bit         _BIT_ACCESS(CRCSHFTU,3)
// CRCSHFTL<SHIFT2>
extern volatile __bit                   SHIFT2              __at(0x322);	// @ (0x64 * 8 + 2)
#define                                 SHIFT2_bit          _BIT_ACCESS(CRCSHFTL,2)
// CRCSHFTU<SHIFT20>
extern volatile __bit                   SHIFT20             __at(0x334);	// @ (0x66 * 8 + 4)
#define                                 SHIFT20_bit         _BIT_ACCESS(CRCSHFTU,4)
// CRCSHFTU<SHIFT21>
extern volatile __bit                   SHIFT21             __at(0x335);	// @ (0x66 * 8 + 5)
#define                                 SHIFT21_bit         _BIT_ACCESS(CRCSHFTU,5)
// CRCSHFTU<SHIFT22>
extern volatile __bit                   SHIFT22             __at(0x336);	// @ (0x66 * 8 + 6)
#define                                 SHIFT22_bit         _BIT_ACCESS(CRCSHFTU,6)
// CRCSHFTU<SHIFT23>
extern volatile __bit                   SHIFT23             __at(0x337);	// @ (0x66 * 8 + 7)
#define                                 SHIFT23_bit         _BIT_ACCESS(CRCSHFTU,7)
// CRCSHFTT<SHIFT24>
extern volatile __bit                   SHIFT24             __at(0x338);	// @ (0x67 * 8 + 0)
#define                                 SHIFT24_bit         _BIT_ACCESS(CRCSHFTT,0)
// CRCSHFTT<SHIFT25>
extern volatile __bit                   SHIFT25             __at(0x339);	// @ (0x67 * 8 + 1)
#define                                 SHIFT25_bit         _BIT_ACCESS(CRCSHFTT,1)
// CRCSHFTT<SHIFT26>
extern volatile __bit                   SHIFT26             __at(0x33A);	// @ (0x67 * 8 + 2)
#define                                 SHIFT26_bit         _BIT_ACCESS(CRCSHFTT,2)
// CRCSHFTT<SHIFT27>
extern volatile __bit                   SHIFT27             __at(0x33B);	// @ (0x67 * 8 + 3)
#define                                 SHIFT27_bit         _BIT_ACCESS(CRCSHFTT,3)
// CRCSHFTT<SHIFT28>
extern volatile __bit                   SHIFT28             __at(0x33C);	// @ (0x67 * 8 + 4)
#define                                 SHIFT28_bit         _BIT_ACCESS(CRCSHFTT,4)
// CRCSHFTT<SHIFT29>
extern volatile __bit                   SHIFT29             __at(0x33D);	// @ (0x67 * 8 + 5)
#define                                 SHIFT29_bit         _BIT_ACCESS(CRCSHFTT,5)
// CRCSHFTL<SHIFT3>
extern volatile __bit                   SHIFT3              __at(0x323);	// @ (0x64 * 8 + 3)
#define                                 SHIFT3_bit          _BIT_ACCESS(CRCSHFTL,3)
// CRCSHFTT<SHIFT30>
extern volatile __bit                   SHIFT30             __at(0x33E);	// @ (0x67 * 8 + 6)
#define                                 SHIFT30_bit         _BIT_ACCESS(CRCSHFTT,6)
// CRCSHFTT<SHIFT31>
extern volatile __bit                   SHIFT31             __at(0x33F);	// @ (0x67 * 8 + 7)
#define                                 SHIFT31_bit         _BIT_ACCESS(CRCSHFTT,7)
// CRCSHFTL<SHIFT4>
extern volatile __bit                   SHIFT4              __at(0x324);	// @ (0x64 * 8 + 4)
#define                                 SHIFT4_bit          _BIT_ACCESS(CRCSHFTL,4)
// CRCSHFTL<SHIFT5>
extern volatile __bit                   SHIFT5              __at(0x325);	// @ (0x64 * 8 + 5)
#define                                 SHIFT5_bit          _BIT_ACCESS(CRCSHFTL,5)
// CRCSHFTL<SHIFT6>
extern volatile __bit                   SHIFT6              __at(0x326);	// @ (0x64 * 8 + 6)
#define                                 SHIFT6_bit          _BIT_ACCESS(CRCSHFTL,6)
// CRCSHFTL<SHIFT7>
extern volatile __bit                   SHIFT7              __at(0x327);	// @ (0x64 * 8 + 7)
#define                                 SHIFT7_bit          _BIT_ACCESS(CRCSHFTL,7)
// CRCSHFTH<SHIFT8>
extern volatile __bit                   SHIFT8              __at(0x328);	// @ (0x65 * 8 + 0)
#define                                 SHIFT8_bit          _BIT_ACCESS(CRCSHFTH,0)
// CRCSHFTH<SHIFT9>
extern volatile __bit                   SHIFT9              __at(0x329);	// @ (0x65 * 8 + 1)
#define                                 SHIFT9_bit          _BIT_ACCESS(CRCSHFTH,1)
// CRCCON0<SHIFTM>
extern volatile __bit                   SHIFTM              __at(0x341);	// @ (0x68 * 8 + 1)
#define                                 SHIFTM_bit          _BIT_ACCESS(CRCCON0,1)
// CWG1AS0<SHUTDOWN>
extern volatile __bit                   SHUTDOWN            __at(0xCFF);	// @ (0x19F * 8 + 7)
#define                                 SHUTDOWN_bit        _BIT_ACCESS(CWG1AS0,7)
// DMAnSIRQ<SIRQ0>
extern volatile __bit                   SIRQ0               __at(0x2B8);	// @ (0x57 * 8 + 0)
#define                                 SIRQ0_bit           _BIT_ACCESS(DMAnSIRQ,0)
// DMAnSIRQ<SIRQ1>
extern volatile __bit                   SIRQ1               __at(0x2B9);	// @ (0x57 * 8 + 1)
#define                                 SIRQ1_bit           _BIT_ACCESS(DMAnSIRQ,1)
// DMAnSIRQ<SIRQ2>
extern volatile __bit                   SIRQ2               __at(0x2BA);	// @ (0x57 * 8 + 2)
#define                                 SIRQ2_bit           _BIT_ACCESS(DMAnSIRQ,2)
// DMAnSIRQ<SIRQ3>
extern volatile __bit                   SIRQ3               __at(0x2BB);	// @ (0x57 * 8 + 3)
#define                                 SIRQ3_bit           _BIT_ACCESS(DMAnSIRQ,3)
// DMAnSIRQ<SIRQ4>
extern volatile __bit                   SIRQ4               __at(0x2BC);	// @ (0x57 * 8 + 4)
#define                                 SIRQ4_bit           _BIT_ACCESS(DMAnSIRQ,4)
// DMAnSIRQ<SIRQ5>
extern volatile __bit                   SIRQ5               __at(0x2BD);	// @ (0x57 * 8 + 5)
#define                                 SIRQ5_bit           _BIT_ACCESS(DMAnSIRQ,5)
// DMAnSIRQ<SIRQ6>
extern volatile __bit                   SIRQ6               __at(0x2BE);	// @ (0x57 * 8 + 6)
#define                                 SIRQ6_bit           _BIT_ACCESS(DMAnSIRQ,6)
// DMAnSIRQ<SIRQ7>
extern volatile __bit                   SIRQ7               __at(0x2BF);	// @ (0x57 * 8 + 7)
