garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
extern volatile __bit                   TMR2IP              __at(0x2408);	// @ (0x481 * 8 + 0)
#define                                 TMR2IP_bit          _BIT_ACCESS(IPR4,0)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x180E);	// @ (0x301 * 8 + 6)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,6)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x8DF);	// @ (0x11B * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// PIE4<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x23B9);	// @ (0x477 * 8 + 1)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x2369);	// @ (0x46D * 8 + 1)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x2409);	// @ (0x481 * 8 + 1)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR4,1)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x180F);	// @ (0x301 * 8 + 7)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,7)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x90F);	// @ (0x121 * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// TU16ACON1<TMRAOSEN>
extern volatile __bit                   TMRAOSEN            __at(0x96E);	// @ (0x12D * 8 + 6)
#define                                 TMRAOSEN_bit        _BIT_ACCESS(TU16ACON1,6)
// TU16BCON1<TMRBOSEN>
extern volatile __bit                   TMRBOSEN            __at(0x9DE);	// @ (0x13B * 8 + 6)
#define                                 TMRBOSEN_bit        _BIT_ACCESS(TU16BCON1,6)
// I2C1BTO<TOBY32>
extern volatile __bit                   TOBY32              __at(0xFBE);	// @ (0x1F7 * 8 + 6)
#define                                 TOBY32_bit          _BIT_ACCESS(I2C1BTO,6)
// I2C1BTO<TOREC>
extern volatile __bit                   TOREC               __at(0xFBF);	// @ (0x1F7 * 8 + 7)
#define                                 TOREC_bit           _BIT_ACCESS(I2C1BTO,7)
// I2C1BTO<TOTIME0>
extern volatile __bit                   TOTIME0             __at(0xFB8);	// @ (0x1F7 * 8 + 0)
#define                                 TOTIME0_bit         _BIT_ACCESS(I2C1BTO,0)
// I2C1BTO<TOTIME1>
extern volatile __bit                   TOTIME1             __at(0xFB9);	// @ (0x1F7 * 8 + 1)
#define                                 TOTIME1_bit         _BIT_ACCESS(I2C1BTO,1)
// I2C1BTO<TOTIME2>
extern volatile __bit                   TOTIME2             __at(0xFBA);	// @ (0x1F7 * 8 + 2)
#define                                 TOTIME2_bit         _BIT_ACCESS(I2C1BTO,2)
// I2C1BTO<TOTIME3>
extern volatile __bit                   TOTIME3             __at(0xFBB);	// @ (0x1F7 * 8 + 3)
#define                                 TOTIME3_bit         _BIT_ACCESS(I2C1BTO,3)
// I2C1BTO<TOTIME4>
extern volatile __bit                   TOTIME4             __at(0xFBC);	// @ (0x1F7 * 8 + 4)
#define                                 TOTIME4_bit         _BIT_ACCESS(I2C1BTO,4)
// I2C1BTO<TOTIME5>
extern volatile __bit                   TOTIME5             __at(0xFBD);	// @ (0x1F7 * 8 + 5)
#define                                 TOTIME5_bit         _BIT_ACCESS(I2C1BTO,5)
// SCANCON0<TRIGEN>
extern volatile __bit                   TRIGEN              __at(0x38E);	// @ (0x71 * 8 + 6)
#define                                 TRIGEN_bit          _BIT_ACCESS(SCANCON0,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x2468);	// @ (0x48D * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x2469);	// @ (0x48D * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x246A);	// @ (0x48D * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x246C);	// @ (0x48D * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x246D);	// @ (0x48D * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x2478);	// @ (0x48F * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x2479);	// @ (0x48F * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x247B);	// @ (0x48F * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x247C);	// @ (0x48F * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x247D);	// @ (0x48F * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x247E);	// @ (0x48F * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x247F);	// @ (0x48F * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// SCANTRIG<TSEL0>
extern volatile __bit                   TSEL0               __at(0x390);	// @ (0x72 * 8 + 0)
#define                                 TSEL0_bit           _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<TSEL1>
extern volatile __bit                   TSEL1               __at(0x391);	// @ (0x72 * 8 + 1)
#define                                 TSEL1_bit           _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<TSEL2>
extern volatile __bit                   TSEL2               __at(0x392);	// @ (0x72 * 8 + 2)
#define                                 TSEL2_bit           _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<TSEL3>
extern volatile __bit                   TSEL3               __at(0x393);	// @ (0x72 * 8 + 3)
#define                                 TSEL3_bit           _BIT_ACCESS(SCANTRIG,3)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x100D);	// @ (0x201 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x100C);	// @ (0x201 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// TU16ACON1<TU16ACAPT>
extern volatile __bit                   TU16ACAPT           __at(0x96B);	// @ (0x12D * 8 + 3)
#define                                 TU16ACAPT_bit       _BIT_ACCESS(TU16ACON1,3)
// TU16ACON0<TU16ACIE>
extern volatile __bit                   TU16ACIE            __at(0x960);	// @ (0x12C * 8 + 0)
#define                                 TU16ACIE_bit        _BIT_ACCESS(TU16ACON0,0)
// TU16ACON1<TU16ACIF>
extern volatile __bit                   TU16ACIF            __at(0x968);	// @ (0x12D * 8 + 0)
#define                                 TU16ACIF_bit        _BIT_ACCESS(TU16ACON1,0)
// TU16ACLK<TU16ACLK0>
extern volatile __bit                   TU16ACLK0           __at(0x9C0);	// @ (0x138 * 8 + 0)
#define                                 TU16ACLK0_bit       _BIT_ACCESS(TU16ACLK,0)
// TU16ACLK<TU16ACLK1>
extern volatile __bit                   TU16ACLK1           __at(0x9C1);	// @ (0x138 * 8 + 1)
#define                                 TU16ACLK1_bit       _BIT_ACCESS(TU16ACLK,1)
// TU16ACLK<TU16ACLK2>
extern volatile __bit                   TU16ACLK2           __at(0x9C2);	// @ (0x138 * 8 + 2)
#define                                 TU16ACLK2_bit       _BIT_ACCESS(TU16ACLK,2)
// TU16ACLK<TU16ACLK3>
extern volatile __bit                   TU16ACLK3           __at(0x9C3);	// @ (0x138 * 8 + 3)
#define                                 TU16ACLK3_bit       _BIT_ACCESS(TU16ACLK,3)
// TU16ACLK<TU16ACLK4>
extern volatile __bit                   TU16ACLK4           __at(0x9C4);	// @ (0x138 * 8 + 4)
#define                                 TU16ACLK4_bit       _BIT_ACCESS(TU16ACLK,4)
// TU16ACON1<TU16ACLR>
extern volatile __bit                   TU16ACLR            __at(0x96D);	// @ (0x12D * 8 + 5)
#define                                 TU16ACLR_bit        _BIT_ACCESS(TU16ACON1,5)
// TU16ACON0<TU16ACPOL>
extern volatile __bit                   TU16ACPOL           __at(0x966);	// @ (0x12C * 8 + 6)
#define                                 TU16ACPOL_bit       _BIT_ACCESS(TU16ACON0,6)
// TU16ACRL<TU16ACR0>
extern volatile __bit                   TU16ACR0            __at(0x980);	// @ (0x130 * 8 + 0)
#define                                 TU16ACR0_bit        _BIT_ACCESS(TU16ACRL,0)
// TU16ACRL<TU16ACR1>
extern volatile __bit                   TU16ACR1            __at(0x981);	// @ (0x130 * 8 + 1)
#define                                 TU16ACR1_bit        _BIT_ACCESS(TU16ACRL,1)
// TU16ACRH<TU16ACR10>
extern volatile __bit                   TU16ACR10           __at(0x98A);	// @ (0x131 * 8 + 2)
#define                                 TU16ACR10_bit       _BIT_ACCESS(TU16ACRH,2)
// TU16ACRH<TU16ACR11>
extern volatile __bit                   TU16ACR11           __at(0x98B);	// @ (0x131 * 8 + 3)
#define                                 TU16ACR11_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACR12>
extern volatile __bit                   TU16ACR12           __at(0x98C);	// @ (0x131 * 8 + 4)
#define                                 TU16ACR12_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACR13>
extern volatile __bit                   TU16ACR13           __at(0x98D);	// @ (0x131 * 8 + 5)
#define                                 TU16ACR13_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACR14>
extern volatile __bit                   TU16ACR14           __at(0x98E);	// @ (0x131 * 8 + 6)
#define                                 TU16ACR14_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACR15>
extern volatile __bit                   TU16ACR15           __at(0x98F);	// @ (0x131 * 8 + 7)
#define                                 TU16ACR15_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACR2>
extern volatile __bit                   TU16ACR2            __at(0x982);	// @ (0x130 * 8 + 2)
#define                                 TU16ACR2_bit        _BIT_ACCESS(TU16ACRL,2)
// TU16ACRT<TU16ACR24>
extern volatile __bit                   TU16ACR24           __at(0x998);	// @ (0x133 * 8 + 0)
#define                                 TU16ACR24_bit       _BIT_ACCESS(TU16ACRT,0)
// TU16ACRT<TU16ACR25>
extern volatile __bit                   TU16ACR25           __at(0x999);	// @ (0x133 * 8 + 1)
#define                                 TU16ACR25_bit       _BIT_ACCESS(TU16ACRT,1)
// TU16ACRT<TU16ACR26>
extern volatile __bit                   TU16ACR26           __at(0x99A);	// @ (0x133 * 8 + 2)
#define                                 TU16ACR26_bit       _BIT_ACCESS(TU16ACRT,2)
// TU16ACRT<TU16ACR27>
extern volatile __bit                   TU16ACR27           __at(0x99B);	// @ (0x133 * 8 + 3)
#define                                 TU16ACR27_bit       _BIT_ACCESS(TU16ACRT,3)
// TU16ACRT<TU16ACR28>
extern volatile __bit                   TU16ACR28           __at(0x99C);	// @ (0x133 * 8 + 4)
#define                                 TU16ACR28_bit       _BIT_ACCESS(TU16ACRT,4)
// TU16ACRT<TU16ACR29>
extern volatile __bit                   TU16ACR29           __at(0x99D);	// @ (0x133 * 8 + 5)
#define                                 TU16ACR29_bit       _BIT_ACCESS(TU16ACRT,5)
// TU16ACRL<TU16ACR3>
extern volatile __bit                   TU16ACR3            __at(0x983);	// @ (0x130 * 8 + 3)
#define                                 TU16ACR3_bit        _BIT_ACCESS(TU16ACRL,3)
// TU16ACRT<TU16ACR30>
extern volatile __bit                   TU16ACR30           __at(0x99E);	// @ (0x133 * 8 + 6)
#define                                 TU16ACR30_bit       _BIT_ACCESS(TU16ACRT,6)
// TU16ACRT<TU16ACR31>
extern volatile __bit                   TU16ACR31           __at(0x99F);	// @ (0x133 * 8 + 7)
#define                                 TU16ACR31_bit       _BIT_ACCESS(TU16ACRT,7)
// TU16ACRL<TU16ACR4>
extern volatile __bit                   TU16ACR4            __at(0x984);	// @ (0x130 * 8 + 4)
#define                                 TU16ACR4_bit        _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACR5>
extern volatile __bit                   TU16ACR5            __at(0x985);	// @ (0x130 * 8 + 5)
#define                                 TU16ACR5_bit        _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACR6>
extern volatile __bit                   TU16ACR6            __at(0x986);	// @ (0x130 * 8 + 6)
#define                                 TU16ACR6_bit        _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACR7>
extern volatile __bit                   TU16ACR7            __at(0x987);	// @ (0x130 * 8 + 7)
#define                                 TU16ACR7_bit        _BIT_ACCESS(TU16ACRL,7)
// TU16ACRH<TU16ACR8>
extern volatile __bit                   TU16ACR8            __at(0x988);	// @ (0x131 * 8 + 0)
#define                                 TU16ACR8_bit        _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACR9>
extern volatile __bit                   TU16ACR9            __at(0x989);	// @ (0x131 * 8 + 1)
#define                                 TU16ACR9_bit        _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH0>
extern volatile __bit                   TU16ACRH0           __at(0x988);	// @ (0x131 * 8 + 0)
#define                                 TU16ACRH0_bit       _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACRH1>
extern volatile __bit                   TU16ACRH1           __at(0x989);	// @ (0x131 * 8 + 1)
#define                                 TU16ACRH1_bit       _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH2>
extern volatile __bit                   TU16ACRH2           __at(0x98A);	// @ (0x131 * 8 + 2)
#define                                 TU16ACRH2_bit       _BIT_ACCESS(TU16ACRH,2)
// TU16ACRH<TU16ACRH3>
extern volatile __bit                   TU16ACRH3           __at(0x98B);	// @ (0x131 * 8 + 3)
#define                                 TU16ACRH3_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACRH4>
extern volatile __bit                   TU16ACRH4           __at(0x98C);	// @ (0x131 * 8 + 4)
#define                                 TU16ACRH4_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACRH5>
extern volatile __bit                   TU16ACRH5           __at(0x98D);	// @ (0x131 * 8 + 5)
#define                                 TU16ACRH5_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACRH6>
extern volatile __bit                   TU16ACRH6           __at(0x98E);	// @ (0x131 * 8 + 6)
#define                                 TU16ACRH6_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACRH7>
extern volatile __bit                   TU16ACRH7           __at(0x98F);	// @ (0x131 * 8 + 7)
#define                                 TU16ACRH7_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACRL0>
extern volatile __bit                   TU16ACRL0           __at(0x980);	// @ (0x130 * 8 + 0)
#define                                 TU16ACRL0_bit       _BIT_ACCESS(TU16ACRL,0)
// TU16ACRL<TU16ACRL1>
extern volatile __bit                   TU16ACRL1           __at(0x981);	// @ (0x130 * 8 + 1)
#define                                 TU16ACRL1_bit       _BIT_ACCESS(TU16ACRL,1)
// TU16ACRL<TU16ACRL2>
extern volatile __bit                   TU16ACRL2           __at(0x982);	// @ (0x130 * 8 + 2)
#define                                 TU16ACRL2_bit       _BIT_ACCESS(TU16ACRL,2)
// TU16ACRL<TU16ACRL3>
extern volatile __bit                   TU16ACRL3           __at(0x983);	// @ (0x130 * 8 + 3)
#define                                 TU16ACRL3_bit       _BIT_ACCESS(TU16ACRL,3)
// TU16ACRL<TU16ACRL4>
extern volatile __bit                   TU16ACRL4           __at(0x984);	// @ (0x130 * 8 + 4)
#define                                 TU16ACRL4_bit       _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACRL5>
extern volatile __bit                   TU16ACRL5           __at(0x985);	// @ (0x130 * 8 + 5)
#define                                 TU16ACRL5_bit       _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACRL6>
extern volatile __bit                   TU16ACRL6           __at(0x986);	// @ (0x130 * 8 + 6)
#define                                 TU16ACRL6_bit       _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACRL7>
extern volatile __bit                   TU16ACRL7           __at(0x987);	// @ (0x130 * 8 + 7)
#define                                 TU16ACRL7_bit       _BIT_ACCESS(TU16ACRL,7)
// TU16ACRT<TU16ACRT0>
extern volatile __bit                   TU16ACRT0           __at(0x998);	// @ (0x133 * 8 + 0)
#define                                 TU16ACRT0_bit       _BIT_ACCESS(TU16ACRT,0)
// TU16ACRT<TU16ACRT1>
extern volatile __bit                   TU16ACRT1           __at(0x999);	// @ (0x133 * 8 + 1)
#define                                 TU16ACRT1_bit       _BIT_ACCESS(TU16ACRT,1)
// TU16ACRT<TU16ACRT2>
extern volatile __bit                   TU16ACRT2           __at(0x99A);	// @ (0x133 * 8 + 2)
#define                                 TU16ACRT2_bit       _BIT_ACCESS(TU16ACRT,2)
// TU16ACRT<TU16ACRT3>
extern volatile __bit                   TU16ACRT3           __at(0x99B);	// @ (0x133 * 8 + 3)
#define                                 TU16ACRT3_bit       _BIT_ACCESS(TU16ACRT,3)
// TU16ACRT<TU16ACRT4>
extern volatile __bit                   TU16ACRT4           __at(0x99C);	// @ (0x133 * 8 + 4)
#define                                 TU16ACRT4_bit       _BIT_ACCESS(TU16ACRT,4)
// TU16ACRT<TU16ACRT5>
extern volatile __bit                   TU16ACRT5           __at(0x99D);	// @ (0x133 * 8 + 5)
#define                                 TU16ACRT5_bit       _BIT_ACCESS(TU16ACRT,5)
// TU16ACRT<TU16ACRT6>
extern volatile __bit                   TU16ACRT6           __at(0x99E);	// @ (0x133 * 8 + 6)
#define                                 TU16ACRT6_bit       _BIT_ACCESS(TU16ACRT,6)
// TU16ACRT<TU16ACRT7>
extern volatile __bit                   TU16ACRT7           __at(0x99F);	// @ (0x133 * 8 + 7)
#define                                 TU16ACRT7_bit       _BIT_ACCESS(TU16ACRT,7)
// TU16AHLT<TU16ACSYNC>
extern volatile __bit                   TU16ACSYNC          __at(0x976);	// @ (0x12E * 8 + 6)
#define                                 TU16ACSYNC_bit      _BIT_ACCESS(TU16AHLT,6)
// TU16AHLT<TU16AEPOL>
extern volatile __bit                   TU16AEPOL           __at(0x977);	// @ (0x12E * 8 + 7)
#define                                 TU16AEPOL_bit       _BIT_ACCESS(TU16AHLT,7)
// TU16AERS<TU16AERS0>
extern volatile __bit                   TU16AERS0           __at(0x9C8);	// @ (0x139 * 8 + 0)
#define                                 TU16AERS0_bit       _BIT_ACCESS(TU16AERS,0)
// TU16AERS<TU16AERS1>
extern volatile __bit                   TU16AERS1           __at(0x9C9);	// @ (0x139 * 8 + 1)
#define                                 TU16AERS1_bit       _BIT_ACCESS(TU16AERS,1)
// TU16AERS<TU16AERS2>
extern volatile __bit                   TU16AERS2           __at(0x9CA);	// @ (0x139 * 8 + 2)
#define                                 TU16AERS2_bit       _BIT_ACCESS(TU16AERS,2)
// TU16AERS<TU16AERS3>
extern volatile __bit                   TU16AERS3           __at(0x9CB);	// @ (0x139 * 8 + 3)
#define                                 TU16AERS3_bit       _BIT_ACCESS(TU16AERS,3)
// TU16AERS<TU16AERS4>
extern volatile __bit                   TU16AERS4           __at(0x9CC);	// @ (0x139 * 8 + 4)
#define                                 TU16AERS4_bit       _BIT_ACCESS(TU16AERS,4)
// TU16AERS<TU16AERS5>
extern volatile __bit                   TU16AERS5           __at(0x9CD);	// @ (0x139 * 8 + 5)
#define                                 TU16AERS5_bit       _BIT_ACCESS(TU16AERS,5)
// PIE4<TU16AIE>
extern volatile __bit                   TU16AIE             __at(0x23BA);	// @ (0x477 * 8 + 2)
#define                                 TU16AIE_bit         _BIT_ACCESS(PIE4,2)
// PIR4<TU16AIF>
extern volatile __bit                   TU16AIF             __at(0x236A);	// @ (0x46D * 8 + 2)
#define                                 TU16AIF_bit         _BIT_ACCESS(PIR4,2)
// IPR4<TU16AIP>
extern volatile __bit                   TU16AIP             __at(0x240A);	// @ (0x481 * 8 + 2)
#define                                 TU16AIP_bit         _BIT_ACCESS(IPR4,2)
// TU16ACON1<TU16ALIMIT>
extern volatile __bit                   TU16ALIMIT          __at(0x96C);	// @ (0x12D * 8 + 4)
#define                                 TU16ALIMIT_bit      _BIT_ACCESS(TU16ACON1,4)
// PMD2<TU16AMD>
extern volatile __bit                   TU16AMD             __at(0x1810);	// @ (0x302 * 8 + 0)
#define                                 TU16AMD_bit         _BIT_ACCESS(PMD2,0)
// TU16ACON0<TU16AOM>
extern volatile __bit                   TU16AOM             __at(0x965);	// @ (0x12C * 8 + 5)
#define                                 TU16AOM_bit         _BIT_ACCESS(TU16ACON0,5)
// TU16ACON0<TU16AON>
extern volatile __bit                   TU16AON             __at(0x967);	// @ (0x12C * 8 + 7)
#define                                 TU16AON_bit         _BIT_ACCESS(TU16ACON0,7)
// TU16ACON0<TU16AOPOL>
extern volatile __bit                   TU16AOPOL           __at(0x964);	// @ (0x12C * 8 + 4)
#define                                 TU16AOPOL_bit       _BIT_ACCESS(TU16ACON0,4)
// TU16APRL<TU16APR0>
extern volatile __bit                   TU16APR0            __at(0x9A0);	// @ (0x134 * 8 + 0)
#define                                 TU16APR0_bit        _BIT_ACCESS(TU16APRL,0)
// TU16APRL<TU16APR1>
extern volatile __bit                   TU16APR1            __at(0x9A1);	// @ (0x134 * 8 + 1)
#define                                 TU16APR1_bit        _BIT_ACCESS(TU16APRL,1)
// TU16APRH<TU16APR10>
extern volatile __bit                   TU16APR10           __at(0x9AA);	// @ (0x135 * 8 + 2)
#define                                 TU16APR10_bit       _BIT_ACCESS(TU16APRH,2)
// TU16APRH<TU16APR11>
extern volatile __bit                   TU16APR11           __at(0x9AB);	// @ (0x135 * 8 + 3)
#define                                 TU16APR11_bit       _BIT_ACCESS(TU16APRH,3)
// TU16APRH<TU16APR12>
extern volatile __bit                   TU16APR12           __at(0x9AC);	// @ (0x135 * 8 + 4)
#define                                 TU16APR12_bit       _BIT_ACCESS(TU16APRH,4)
// TU16APRH<TU16APR13>
extern volatile __bit                   TU16APR13           __at(0x9AD);	// @ (0x135 * 8 + 5)
#define                                 TU16APR13_bit       _BIT_ACCESS(TU16APRH,5)
// TU16APRH<TU16APR14>
extern volatile __bit                   TU16APR14           __at(0x9AE);	// @ (0x135 * 8 + 6)
#define                                 TU16APR14_bit       _BIT_ACCESS(TU16APRH,6)
// TU16APRH<TU16APR15>
extern volatile __bit                   TU16APR15           __at(0x9AF);	// @ (0x135 * 8 + 7)
#define                                 TU16APR15_bit       _BIT_ACCESS(TU16APRH,7)
// TU16APRL<TU16APR2>
extern volatile __bit                   TU16APR2            __at(0x9A2);	// @ (0x134 * 8 + 2)
#define                                 TU16APR2_bit        _BIT_ACCESS(TU16APRL,2)
// TU16APRT<TU16APR24>
extern volatile __bit                   TU16APR24           __at(0x9B8);	// @ (0x137 * 8 + 0)
