garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.h
#define                                 U1MODE1_bit         _BIT_ACCESS(U1CON0,1)
// U1CON0<U1MODE2>
extern volatile __bit                   U1MODE2             __at(0xDCA);	// @ (0x1B9 * 8 + 2)
#define                                 U1MODE2_bit         _BIT_ACCESS(U1CON0,2)
// U1CON0<U1MODE3>
extern volatile __bit                   U1MODE3             __at(0xDCB);	// @ (0x1B9 * 8 + 3)
#define                                 U1MODE3_bit         _BIT_ACCESS(U1CON0,3)
// U1CON1<U1ON>
extern volatile __bit                   U1ON                __at(0xDD7);	// @ (0x1BA * 8 + 7)
#define                                 U1ON_bit            _BIT_ACCESS(U1CON1,7)
// U1ERRIE<U1PERIE>
extern volatile __bit                   U1PERIE             __at(0xE16);	// @ (0x1C2 * 8 + 6)
#define                                 U1PERIE_bit         _BIT_ACCESS(U1ERRIE,6)
// U1ERRIR<U1PERIF>
extern volatile __bit                   U1PERIF             __at(0xE0E);	// @ (0x1C1 * 8 + 6)
#define                                 U1PERIF_bit         _BIT_ACCESS(U1ERRIR,6)
// U1FIFO<U1RCIDL>
extern volatile __bit                   U1RCIDL             __at(0xDF3);	// @ (0x1BE * 8 + 3)
#define                                 U1RCIDL_bit         _BIT_ACCESS(U1FIFO,3)
// U1CON2<U1RUNOVF>
extern volatile __bit                   U1RUNOVF            __at(0xDDF);	// @ (0x1BB * 8 + 7)
#define                                 U1RUNOVF_bit        _BIT_ACCESS(U1CON2,7)
// U1FIFO<U1RXBE>
extern volatile __bit                   U1RXBE              __at(0xDF1);	// @ (0x1BE * 8 + 1)
#define                                 U1RXBE_bit          _BIT_ACCESS(U1FIFO,1)
// U1FIFO<U1RXBF>
extern volatile __bit                   U1RXBF              __at(0xDF0);	// @ (0x1BE * 8 + 0)
#define                                 U1RXBF_bit          _BIT_ACCESS(U1FIFO,0)
// U1CON1<U1RXBIMD>
extern volatile __bit                   U1RXBIMD            __at(0xDD3);	// @ (0x1BA * 8 + 3)
#define                                 U1RXBIMD_bit        _BIT_ACCESS(U1CON1,3)
// U1ERRIE<U1RXBKIE>
extern volatile __bit                   U1RXBKIE            __at(0xE12);	// @ (0x1C2 * 8 + 2)
#define                                 U1RXBKIE_bit        _BIT_ACCESS(U1ERRIE,2)
// U1ERRIR<U1RXBKIF>
extern volatile __bit                   U1RXBKIF            __at(0xE0A);	// @ (0x1C1 * 8 + 2)
#define                                 U1RXBKIF_bit        _BIT_ACCESS(U1ERRIR,2)
// U1CON0<U1RXEN>
extern volatile __bit                   U1RXEN              __at(0xDCC);	// @ (0x1B9 * 8 + 4)
#define                                 U1RXEN_bit          _BIT_ACCESS(U1CON0,4)
// U1ERRIE<U1RXFOIE>
extern volatile __bit                   U1RXFOIE            __at(0xE11);	// @ (0x1C2 * 8 + 1)
#define                                 U1RXFOIE_bit        _BIT_ACCESS(U1ERRIE,1)
// U1ERRIR<U1RXFOIF>
extern volatile __bit                   U1RXFOIF            __at(0xE09);	// @ (0x1C1 * 8 + 1)
#define                                 U1RXFOIF_bit        _BIT_ACCESS(U1ERRIR,1)
// U1FIFO<U1RXIDL>
extern volatile __bit                   U1RXIDL             __at(0xDF3);	// @ (0x1BE * 8 + 3)
#define                                 U1RXIDL_bit         _BIT_ACCESS(U1FIFO,3)
// PIE6<U1RXIE>
extern volatile __bit                   U1RXIE              __at(0x23C8);	// @ (0x479 * 8 + 0)
#define                                 U1RXIE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<U1RXIF>
extern volatile __bit                   U1RXIF              __at(0x2378);	// @ (0x46F * 8 + 0)
#define                                 U1RXIF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<U1RXIP>
extern volatile __bit                   U1RXIP              __at(0x2418);	// @ (0x483 * 8 + 0)
#define                                 U1RXIP_bit          _BIT_ACCESS(IPR6,0)
// U1CON2<U1RXPOL>
extern volatile __bit                   U1RXPOL             __at(0xDDE);	// @ (0x1BB * 8 + 6)
#define                                 U1RXPOL_bit         _BIT_ACCESS(U1CON2,6)
// U1RXPPS<U1RXPPS0>
extern volatile __bit                   U1RXPPS0            __at(0x1D10);	// @ (0x3A2 * 8 + 0)
#define                                 U1RXPPS0_bit        _BIT_ACCESS(U1RXPPS,0)
// U1RXPPS<U1RXPPS1>
extern volatile __bit                   U1RXPPS1            __at(0x1D11);	// @ (0x3A2 * 8 + 1)
#define                                 U1RXPPS1_bit        _BIT_ACCESS(U1RXPPS,1)
// U1RXPPS<U1RXPPS2>
extern volatile __bit                   U1RXPPS2            __at(0x1D12);	// @ (0x3A2 * 8 + 2)
#define                                 U1RXPPS2_bit        _BIT_ACCESS(U1RXPPS,2)
// U1RXPPS<U1RXPPS3>
extern volatile __bit                   U1RXPPS3            __at(0x1D13);	// @ (0x3A2 * 8 + 3)
#define                                 U1RXPPS3_bit        _BIT_ACCESS(U1RXPPS,3)
// U1RXPPS<U1RXPPS4>
extern volatile __bit                   U1RXPPS4            __at(0x1D14);	// @ (0x3A2 * 8 + 4)
#define                                 U1RXPPS4_bit        _BIT_ACCESS(U1RXPPS,4)
// U1CON1<U1SENDB>
extern volatile __bit                   U1SENDB             __at(0xDD0);	// @ (0x1BA * 8 + 0)
#define                                 U1SENDB_bit         _BIT_ACCESS(U1CON1,0)
// U1CON2<U1STP0>
extern volatile __bit                   U1STP0              __at(0xDDC);	// @ (0x1BB * 8 + 4)
#define                                 U1STP0_bit          _BIT_ACCESS(U1CON2,4)
// U1CON2<U1STP1>
extern volatile __bit                   U1STP1              __at(0xDDD);	// @ (0x1BB * 8 + 5)
#define                                 U1STP1_bit          _BIT_ACCESS(U1CON2,5)
// U1FIFO<U1STPMD>
extern volatile __bit                   U1STPMD             __at(0xDF6);	// @ (0x1BE * 8 + 6)
#define                                 U1STPMD_bit         _BIT_ACCESS(U1FIFO,6)
// U1FIFO<U1TXBE>
extern volatile __bit                   U1TXBE              __at(0xDF5);	// @ (0x1BE * 8 + 5)
#define                                 U1TXBE_bit          _BIT_ACCESS(U1FIFO,5)
// U1FIFO<U1TXBF>
extern volatile __bit                   U1TXBF              __at(0xDF4);	// @ (0x1BE * 8 + 4)
#define                                 U1TXBF_bit          _BIT_ACCESS(U1FIFO,4)
// U1ERRIE<U1TXCIE>
extern volatile __bit                   U1TXCIE             __at(0xE10);	// @ (0x1C2 * 8 + 0)
#define                                 U1TXCIE_bit         _BIT_ACCESS(U1ERRIE,0)
// U1ERRIR<U1TXCIF>
extern volatile __bit                   U1TXCIF             __at(0xE08);	// @ (0x1C1 * 8 + 0)
#define                                 U1TXCIF_bit         _BIT_ACCESS(U1ERRIR,0)
// U1CON0<U1TXEN>
extern volatile __bit                   U1TXEN              __at(0xDCD);	// @ (0x1B9 * 8 + 5)
#define                                 U1TXEN_bit          _BIT_ACCESS(U1CON0,5)
// PIE6<U1TXIE>
extern volatile __bit                   U1TXIE              __at(0x23C9);	// @ (0x479 * 8 + 1)
#define                                 U1TXIE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<U1TXIF>
extern volatile __bit                   U1TXIF              __at(0x2379);	// @ (0x46F * 8 + 1)
#define                                 U1TXIF_bit          _BIT_ACCESS(PIR6,1)
// IPR6<U1TXIP>
extern volatile __bit                   U1TXIP              __at(0x2419);	// @ (0x483 * 8 + 1)
#define                                 U1TXIP_bit          _BIT_ACCESS(IPR6,1)
// U1ERRIE<U1TXMTIE>
extern volatile __bit                   U1TXMTIE            __at(0xE17);	// @ (0x1C2 * 8 + 7)
#define                                 U1TXMTIE_bit        _BIT_ACCESS(U1ERRIE,7)
// U1ERRIR<U1TXMTIF>
extern volatile __bit                   U1TXMTIF            __at(0xE0F);	// @ (0x1C1 * 8 + 7)
#define                                 U1TXMTIF_bit        _BIT_ACCESS(U1ERRIR,7)
// U1CON2<U1TXPOL>
extern volatile __bit                   U1TXPOL             __at(0xDDA);	// @ (0x1BB * 8 + 2)
#define                                 U1TXPOL_bit         _BIT_ACCESS(U1CON2,2)
// U1FIFO<U1TXWRE>
extern volatile __bit                   U1TXWRE             __at(0xDF7);	// @ (0x1BE * 8 + 7)
#define                                 U1TXWRE_bit         _BIT_ACCESS(U1FIFO,7)
// U1CON1<U1WUE>
extern volatile __bit                   U1WUE               __at(0xDD4);	// @ (0x1BA * 8 + 4)
#define                                 U1WUE_bit           _BIT_ACCESS(U1CON1,4)
// U1UIR<U1WUIF>
extern volatile __bit                   U1WUIF              __at(0xE07);	// @ (0x1C0 * 8 + 7)
#define                                 U1WUIF_bit          _BIT_ACCESS(U1UIR,7)
// U1FIFO<U1XON>
extern volatile __bit                   U1XON               __at(0xDF2);	// @ (0x1BE * 8 + 2)
#define                                 U1XON_bit           _BIT_ACCESS(U1FIFO,2)
// U2CON0<U2ABDEN>
extern volatile __bit                   U2ABDEN             __at(0xE6E);	// @ (0x1CD * 8 + 6)
#define                                 U2ABDEN_bit         _BIT_ACCESS(U2CON0,6)
// U2UIR<U2ABDIE>
extern volatile __bit                   U2ABDIE             __at(0xEA2);	// @ (0x1D4 * 8 + 2)
#define                                 U2ABDIE_bit         _BIT_ACCESS(U2UIR,2)
// U2UIR<U2ABDIF>
extern volatile __bit                   U2ABDIF             __at(0xEA6);	// @ (0x1D4 * 8 + 6)
#define                                 U2ABDIF_bit         _BIT_ACCESS(U2UIR,6)
// U2ERRIE<U2ABDOVE>
extern volatile __bit                   U2ABDOVE            __at(0xEB5);	// @ (0x1D6 * 8 + 5)
#define                                 U2ABDOVE_bit        _BIT_ACCESS(U2ERRIE,5)
// U2ERRIR<U2ABDOVF>
extern volatile __bit                   U2ABDOVF            __at(0xEAD);	// @ (0x1D5 * 8 + 5)
#define                                 U2ABDOVF_bit        _BIT_ACCESS(U2ERRIR,5)
// U2CON0<U2BRGS>
extern volatile __bit                   U2BRGS              __at(0xE6F);	// @ (0x1CD * 8 + 7)
#define                                 U2BRGS_bit          _BIT_ACCESS(U2CON0,7)
// U2CON1<U2BRKOVR>
extern volatile __bit                   U2BRKOVR            __at(0xE71);	// @ (0x1CE * 8 + 1)
#define                                 U2BRKOVR_bit        _BIT_ACCESS(U2CON1,1)
// U2CTSPPS<U2CTSPPS0>
extern volatile __bit                   U2CTSPPS0           __at(0x1D18);	// @ (0x3A3 * 8 + 0)
#define                                 U2CTSPPS0_bit       _BIT_ACCESS(U2CTSPPS,0)
// U2CTSPPS<U2CTSPPS1>
extern volatile __bit                   U2CTSPPS1           __at(0x1D19);	// @ (0x3A3 * 8 + 1)
#define                                 U2CTSPPS1_bit       _BIT_ACCESS(U2CTSPPS,1)
// U2CTSPPS<U2CTSPPS2>
extern volatile __bit                   U2CTSPPS2           __at(0x1D1A);	// @ (0x3A3 * 8 + 2)
#define                                 U2CTSPPS2_bit       _BIT_ACCESS(U2CTSPPS,2)
// U2CTSPPS<U2CTSPPS3>
extern volatile __bit                   U2CTSPPS3           __at(0x1D1B);	// @ (0x3A3 * 8 + 3)
#define                                 U2CTSPPS3_bit       _BIT_ACCESS(U2CTSPPS,3)
// U2CTSPPS<U2CTSPPS4>
extern volatile __bit                   U2CTSPPS4           __at(0x1D1C);	// @ (0x3A3 * 8 + 4)
#define                                 U2CTSPPS4_bit       _BIT_ACCESS(U2CTSPPS,4)
// PIE6<U2EIE>
extern volatile __bit                   U2EIE               __at(0x23CF);	// @ (0x479 * 8 + 7)
#define                                 U2EIE_bit           _BIT_ACCESS(PIE6,7)
// PIR6<U2EIF>
extern volatile __bit                   U2EIF               __at(0x237F);	// @ (0x46F * 8 + 7)
#define                                 U2EIF_bit           _BIT_ACCESS(PIR6,7)
// IPR6<U2EIP>
extern volatile __bit                   U2EIP               __at(0x241F);	// @ (0x483 * 8 + 7)
#define                                 U2EIP_bit           _BIT_ACCESS(IPR6,7)
// U2ERRIE<U2FERIE>
extern volatile __bit                   U2FERIE             __at(0xEB3);	// @ (0x1D6 * 8 + 3)
#define                                 U2FERIE_bit         _BIT_ACCESS(U2ERRIE,3)
// U2ERRIR<U2FERIF>
extern volatile __bit                   U2FERIF             __at(0xEAB);	// @ (0x1D5 * 8 + 3)
#define                                 U2FERIF_bit         _BIT_ACCESS(U2ERRIR,3)
// U2CON2<U2FLO0>
extern volatile __bit                   U2FLO0              __at(0xE78);	// @ (0x1CF * 8 + 0)
#define                                 U2FLO0_bit          _BIT_ACCESS(U2CON2,0)
// U2CON2<U2FLO1>
extern volatile __bit                   U2FLO1              __at(0xE79);	// @ (0x1CF * 8 + 1)
#define                                 U2FLO1_bit          _BIT_ACCESS(U2CON2,1)
// PIE6<U2IE>
extern volatile __bit                   U2IE                __at(0x23CE);	// @ (0x479 * 8 + 6)
#define                                 U2IE_bit            _BIT_ACCESS(PIE6,6)
// PIR6<U2IF>
extern volatile __bit                   U2IF                __at(0x237E);	// @ (0x46F * 8 + 6)
#define                                 U2IF_bit            _BIT_ACCESS(PIR6,6)
// IPR6<U2IP>
extern volatile __bit                   U2IP                __at(0x241E);	// @ (0x483 * 8 + 6)
#define                                 U2IP_bit            _BIT_ACCESS(IPR6,6)
// PMD3<U2MD>
extern volatile __bit                   U2MD                __at(0x181C);	// @ (0x303 * 8 + 4)
#define                                 U2MD_bit            _BIT_ACCESS(PMD3,4)
// U2CON0<U2MODE0>
extern volatile __bit                   U2MODE0             __at(0xE68);	// @ (0x1CD * 8 + 0)
#define                                 U2MODE0_bit         _BIT_ACCESS(U2CON0,0)
// U2CON0<U2MODE1>
extern volatile __bit                   U2MODE1             __at(0xE69);	// @ (0x1CD * 8 + 1)
#define                                 U2MODE1_bit         _BIT_ACCESS(U2CON0,1)
// U2CON0<U2MODE2>
extern volatile __bit                   U2MODE2             __at(0xE6A);	// @ (0x1CD * 8 + 2)
#define                                 U2MODE2_bit         _BIT_ACCESS(U2CON0,2)
// U2CON1<U2ON>
extern volatile __bit                   U2ON                __at(0xE77);	// @ (0x1CE * 8 + 7)
#define                                 U2ON_bit            _BIT_ACCESS(U2CON1,7)
// U2ERRIE<U2PERIE>
extern volatile __bit                   U2PERIE             __at(0xEB6);	// @ (0x1D6 * 8 + 6)
#define                                 U2PERIE_bit         _BIT_ACCESS(U2ERRIE,6)
// U2ERRIR<U2PERIF>
extern volatile __bit                   U2PERIF             __at(0xEAE);	// @ (0x1D5 * 8 + 6)
#define                                 U2PERIF_bit         _BIT_ACCESS(U2ERRIR,6)
// U2FIFO<U2RCIDL>
extern volatile __bit                   U2RCIDL             __at(0xE93);	// @ (0x1D2 * 8 + 3)
#define                                 U2RCIDL_bit         _BIT_ACCESS(U2FIFO,3)
// U2CON2<U2RUNOVF>
extern volatile __bit                   U2RUNOVF            __at(0xE7F);	// @ (0x1CF * 8 + 7)
#define                                 U2RUNOVF_bit        _BIT_ACCESS(U2CON2,7)
// U2FIFO<U2RXBE>
extern volatile __bit                   U2RXBE              __at(0xE91);	// @ (0x1D2 * 8 + 1)
#define                                 U2RXBE_bit          _BIT_ACCESS(U2FIFO,1)
// U2FIFO<U2RXBF>
extern volatile __bit                   U2RXBF              __at(0xE90);	// @ (0x1D2 * 8 + 0)
#define                                 U2RXBF_bit          _BIT_ACCESS(U2FIFO,0)
// U2CON1<U2RXBIMD>
extern volatile __bit                   U2RXBIMD            __at(0xE73);	// @ (0x1CE * 8 + 3)
#define                                 U2RXBIMD_bit        _BIT_ACCESS(U2CON1,3)
// U2ERRIE<U2RXBKIE>
extern volatile __bit                   U2RXBKIE            __at(0xEB2);	// @ (0x1D6 * 8 + 2)
#define                                 U2RXBKIE_bit        _BIT_ACCESS(U2ERRIE,2)
// U2ERRIR<U2RXBKIF>
extern volatile __bit                   U2RXBKIF            __at(0xEAA);	// @ (0x1D5 * 8 + 2)
#define                                 U2RXBKIF_bit        _BIT_ACCESS(U2ERRIR,2)
// U2CON0<U2RXEN>
extern volatile __bit                   U2RXEN              __at(0xE6C);	// @ (0x1CD * 8 + 4)
#define                                 U2RXEN_bit          _BIT_ACCESS(U2CON0,4)
// U2ERRIE<U2RXFOIE>
extern volatile __bit                   U2RXFOIE            __at(0xEB1);	// @ (0x1D6 * 8 + 1)
#define                                 U2RXFOIE_bit        _BIT_ACCESS(U2ERRIE,1)
// U2ERRIR<U2RXFOIF>
extern volatile __bit                   U2RXFOIF            __at(0xEA9);	// @ (0x1D5 * 8 + 1)
#define                                 U2RXFOIF_bit        _BIT_ACCESS(U2ERRIR,1)
// U2FIFO<U2RXIDL>
extern volatile __bit                   U2RXIDL             __at(0xE93);	// @ (0x1D2 * 8 + 3)
#define                                 U2RXIDL_bit         _BIT_ACCESS(U2FIFO,3)
// PIE6<U2RXIE>
extern volatile __bit                   U2RXIE              __at(0x23CC);	// @ (0x479 * 8 + 4)
#define                                 U2RXIE_bit          _BIT_ACCESS(PIE6,4)
// PIR6<U2RXIF>
extern volatile __bit                   U2RXIF              __at(0x237C);	// @ (0x46F * 8 + 4)
#define                                 U2RXIF_bit          _BIT_ACCESS(PIR6,4)
// IPR6<U2RXIP>
extern volatile __bit                   U2RXIP              __at(0x241C);	// @ (0x483 * 8 + 4)
#define                                 U2RXIP_bit          _BIT_ACCESS(IPR6,4)
// U2CON2<U2RXPOL>
extern volatile __bit                   U2RXPOL             __at(0xE7E);	// @ (0x1CF * 8 + 6)
#define                                 U2RXPOL_bit         _BIT_ACCESS(U2CON2,6)
// U2RXPPS<U2RXPPS0>
extern volatile __bit                   U2RXPPS0            __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 U2RXPPS0_bit        _BIT_ACCESS(U2RXPPS,0)
// U2RXPPS<U2RXPPS1>
extern volatile __bit                   U2RXPPS1            __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 U2RXPPS1_bit        _BIT_ACCESS(U2RXPPS,1)
// U2RXPPS<U2RXPPS2>
extern volatile __bit                   U2RXPPS2            __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 U2RXPPS2_bit        _BIT_ACCESS(U2RXPPS,2)
// U2RXPPS<U2RXPPS3>
extern volatile __bit                   U2RXPPS3            __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 U2RXPPS3_bit        _BIT_ACCESS(U2RXPPS,3)
// U2RXPPS<U2RXPPS4>
extern volatile __bit                   U2RXPPS4            __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 U2RXPPS4_bit        _BIT_ACCESS(U2RXPPS,4)
// U2CON1<U2SENDB>
extern volatile __bit                   U2SENDB             __at(0xE70);	// @ (0x1CE * 8 + 0)
#define                                 U2SENDB_bit         _BIT_ACCESS(U2CON1,0)
// U2CON2<U2STP0>
extern volatile __bit                   U2STP0              __at(0xE7C);	// @ (0x1CF * 8 + 4)
#define                                 U2STP0_bit          _BIT_ACCESS(U2CON2,4)
// U2CON2<U2STP1>
extern volatile __bit                   U2STP1              __at(0xE7D);	// @ (0x1CF * 8 + 5)
#define                                 U2STP1_bit          _BIT_ACCESS(U2CON2,5)
// U2FIFO<U2STPMD>
extern volatile __bit                   U2STPMD             __at(0xE96);	// @ (0x1D2 * 8 + 6)
#define                                 U2STPMD_bit         _BIT_ACCESS(U2FIFO,6)
// U2FIFO<U2TXBE>
extern volatile __bit                   U2TXBE              __at(0xE95);	// @ (0x1D2 * 8 + 5)
#define                                 U2TXBE_bit          _BIT_ACCESS(U2FIFO,5)
// U2FIFO<U2TXBF>
extern volatile __bit                   U2TXBF              __at(0xE94);	// @ (0x1D2 * 8 + 4)
#define                                 U2TXBF_bit          _BIT_ACCESS(U2FIFO,4)
// U2CON0<U2TXEN>
extern volatile __bit                   U2TXEN              __at(0xE6D);	// @ (0x1CD * 8 + 5)
#define                                 U2TXEN_bit          _BIT_ACCESS(U2CON0,5)
// PIE6<U2TXIE>
extern volatile __bit                   U2TXIE              __at(0x23CD);	// @ (0x479 * 8 + 5)
#define                                 U2TXIE_bit          _BIT_ACCESS(PIE6,5)
// PIR6<U2TXIF>
extern volatile __bit                   U2TXIF              __at(0x237D);	// @ (0x46F * 8 + 5)
#define                                 U2TXIF_bit          _BIT_ACCESS(PIR6,5)
// IPR6<U2TXIP>
extern volatile __bit                   U2TXIP              __at(0x241D);	// @ (0x483 * 8 + 5)
#define                                 U2TXIP_bit          _BIT_ACCESS(IPR6,5)
// U2ERRIE<U2TXMTIE>
extern volatile __bit                   U2TXMTIE            __at(0xEB7);	// @ (0x1D6 * 8 + 7)
#define                                 U2TXMTIE_bit        _BIT_ACCESS(U2ERRIE,7)
// U2ERRIR<U2TXMTIF>
extern volatile __bit                   U2TXMTIF            __at(0xEAF);	// @ (0x1D5 * 8 + 7)
#define                                 U2TXMTIF_bit        _BIT_ACCESS(U2ERRIR,7)
// U2CON2<U2TXPOL>
extern volatile __bit                   U2TXPOL             __at(0xE7A);	// @ (0x1CF * 8 + 2)
#define                                 U2TXPOL_bit         _BIT_ACCESS(U2CON2,2)
// U2FIFO<U2TXWRE>
extern volatile __bit                   U2TXWRE             __at(0xE97);	// @ (0x1D2 * 8 + 7)
#define                                 U2TXWRE_bit         _BIT_ACCESS(U2FIFO,7)
// U2CON1<U2WUE>
extern volatile __bit                   U2WUE               __at(0xE74);	// @ (0x1CE * 8 + 4)
#define                                 U2WUE_bit           _BIT_ACCESS(U2CON1,4)
// U2UIR<U2WUIF>
extern volatile __bit                   U2WUIF              __at(0xEA7);	// @ (0x1D4 * 8 + 7)
#define                                 U2WUIF_bit          _BIT_ACCESS(U2UIR,7)
// U2FIFO<U2XON>
extern volatile __bit                   U2XON               __at(0xE92);	// @ (0x1D2 * 8 + 2)
#define                                 U2XON_bit           _BIT_ACCESS(U2FIFO,2)
// I3C1ERRIE0<UCCCIE>
extern volatile __bit                   UCCCIE              __at(0x480);	// @ (0x90 * 8 + 0)
#define                                 UCCCIE_bit          _BIT_ACCESS(I3C1ERRIE0,0)
// I3C1ERRIR0<UCCCIF>
extern volatile __bit                   UCCCIF              __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 UCCCIF_bit          _BIT_ACCESS(I3C1ERRIR0,0)
// ACTCON<UD>
extern volatile __bit                   UD                  __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 UD_bit              _BIT_ACCESS(ACTCON,6)
// ADUTHL<UTH0>
extern volatile __bit                   UTH0                __at(0x10B8);	// @ (0x217 * 8 + 0)
#define                                 UTH0_bit            _BIT_ACCESS(ADUTHL,0)
// ADUTHL<UTH1>
extern volatile __bit                   UTH1                __at(0x10B9);	// @ (0x217 * 8 + 1)
#define                                 UTH1_bit            _BIT_ACCESS(ADUTHL,1)
// ADUTHH<UTH10>
extern volatile __bit                   UTH10               __at(0x10C2);	// @ (0x218 * 8 + 2)
#define                                 UTH10_bit           _BIT_ACCESS(ADUTHH,2)
// ADUTHH<UTH11>
extern volatile __bit                   UTH11               __at(0x10C3);	// @ (0x218 * 8 + 3)
#define                                 UTH11_bit           _BIT_ACCESS(ADUTHH,3)
// ADUTHH<UTH12>
extern volatile __bit                   UTH12               __at(0x10C4);	// @ (0x218 * 8 + 4)
#define                                 UTH12_bit           _BIT_ACCESS(ADUTHH,4)
// ADUTHH<UTH13>
extern volatile __bit                   UTH13               __at(0x10C5);	// @ (0x218 * 8 + 5)
#define                                 UTH13_bit           _BIT_ACCESS(ADUTHH,5)
// ADUTHH<UTH14>
extern volatile __bit                   UTH14               __at(0x10C6);	// @ (0x218 * 8 + 6)
#define                                 UTH14_bit           _BIT_ACCESS(ADUTHH,6)
// ADUTHH<UTH15>
extern volatile __bit                   UTH15               __at(0x10C7);	// @ (0x218 * 8 + 7)
#define                                 UTH15_bit           _BIT_ACCESS(ADUTHH,7)
// ADUTHL<UTH2>
extern volatile __bit                   UTH2                __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 UTH2_bit            _BIT_ACCESS(ADUTHL,2)
// ADUTHL<UTH3>
extern volatile __bit                   UTH3                __at(0x10BB);	// @ (0x217 * 8 + 3)
